[
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 0,
    "text": "AMENDMENT NO. 5 October 2013 TO AIS-022/2001 Automotive Vehicles – Advance - Warning Triangles and Conspicuity Marking Tape - Specifications 1.0 Title of the standard Substitute following title for the existing title wherever it appears in the standard: “Automotive Vehicles - Advance - Warning Triangles - Specifications” 2.0 Page No. Nil, INTRODUCTION Delete 4th and 5th paragraphs. 3.0 Page No.1, clause No. 1 Delete clause No. 1.3. 4.0. Page No.1, clause 2.0, REFERENCES Delete Sr. No. 3 under sub-clause 2.1. 5.0 Page No.2, clause 4.0, APPLICATION FOR APPROVAL Delete sub clause No. 4.6. 6.0 Page No.3, clause 6.0, APPROVAL Delete sub clause No. 6.4. 7.0 Page No.3, clause 7.0, GENERAL REQUIREMENTS Delete sub clause No. 7.8 and renumber existing clause “7.9” as “7.8”. 8.0 Page No. 25, Annexure 8 Delete Annexure 8 and renumber existing “Annexures 9” as “Annexure 8”. PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P. B. NO. 832, PUNE 411 004 ON BEHALF OFAUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF ROAD TRANSPORT & HIGHWAYS (DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS) GOVERNMENT OF INDIA October 2013 AMENDMENT NO. 4 TO AIS-022/2001 Automotive Vehicles – Advance – Warning Triangles and Conspicuity Marking Tape – Specifications 1.0 Page No. Nil, Introduction: Insert new paragraph after 4th paragraph as follows: “ Further, since AIS-090: Approval of Retro-Reflective Markings for Heavy and Long vehicles, their Trailers and Semi-Trailers is now notified vide G.S.R. 784 (E) 12th November 2008 for N category of vehicles including N3, w.e.f. 1st April 2009 and that for M2 and M3 category vehicles w.e.f. from 1st October 2009, the transitory provisions in this standard for alternate conspicuity markings for N3 category of vehicles complying to IS:14221-1995 needs to be standardized. However, the same will be continued for",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 1,
    "text": "of vehicles including N3, w.e.f. 1st April 2009 and that for M2 and M3 category vehicles w.e.f. from 1st October 2009, the transitory provisions in this standard for alternate conspicuity markings for N3 category of vehicles complying to IS:14221-1995 needs to be standardized. However, the same will be continued for M3 category of vehicles and shall comply to AIS-090 till 1st October 2009 as specified in above mentioned notification. The amendment No. 4 to this standard is to this effect. ” 2.0 Page No.1, clause 1, Scope and Applicability, clause 1.3: Substitute “---- M3-----” for “---M3 and N3-----” 3.0 Page No.1, clause 2.1, 3): Substitute following text for the existing text: “ 3) AIS-090 : Approval of Retro-Reflective Markings for Heavy and Long vehicles, their Trailers and Semi-Trailers”. 4.0 Page No.2, clause 4.0 Application for Approval, sub-clause 4.6: Substitute “------ AIS-090.” For “-------IS: 14221-95”. 5.0 Page No. 3, clause 6.0, Approval, sub-clause 6.4: Substitute “----M3----.” for “----M3 and N3-----.” 6.0 Page No.25, Annexure 8, and clause 1.0; Substitute “-----M3----.” for “----M3 and N3-----.” 1/2 7.0 Page No.25, Annexure 8, clause 1.0, c); Substitute following text for the existing text: “c) The conspicuity marking tape shall conform to the requirements of Annexure-4, 5 and 6 of AIS-090.” 8.0 Page No.25, Annexure 8, clause 2.0, 1st para.: Substitute “-----M3----.” for “----M3 and N3-----.” 9.0 Page No.25, Annexure 8, clause 2.0, c); Substitute following text for the existing text: “c) The conspicuity marking tape shall conform to the requirements of Annexure-4, 5 and 6 of AIS-090.” PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P. B. NO. 832, PUNE 411 004 ON BEHALF OF AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF SHIPPING, ROAD TRANSPORT & HIGHWAYS (DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS) GOVERNMENT",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 2,
    "text": "6 of AIS-090.” PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P. B. NO. 832, PUNE 411 004 ON BEHALF OF AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF SHIPPING, ROAD TRANSPORT & HIGHWAYS (DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS) GOVERNMENT OF INDIA April 2009 2/2 AMENDMENT NO. 3 TO AIS-022/2001 Automotive Vehicles – Advance – Warning Triangles and Conspicuity Marking Tape – Specifications 1.0 Page No.3, clause 6.4: Substitute following text for existing clause 6.4 as follows; “6.4 The conspicuity markings on the front and rear of the vehicle for the M3 and N3 categories of vehicles shall be as per Annexure 8 of this standard.” 2.0 Page No. 25 : Substitute following Annexure 8 for existing Annexure 8. ANNEXURE : 8 REQUIREMENTS OF ALTERNATE CONSPICUITY MARKERS IN THE FORM OF RETRO-REFLECTIVE TAPES 1.0 Motor vehicles of category M3 and N3 shall be affixed with retro-reflective conspicuity markers, at front as specified below: a) The marker shall be white in colour. b) The marking shall be rectangular in shape and consist of tape or equivalent. c) The marking tape shall meet the requirements of Grade I & pressure bounding type as specified in IS: 14221 1995. d) The marking shall have a minimum width of 75 mm and shall be affixed horizontally or vertically on the vehicle front face on or above the bumper. The lower edge of the marking shall be affixed at the minimum height of at least 250 mm above the ground with maximum height of 1500 mm. However, a height of 2100 mm may be accepted in cases where technical conditions prevent the adherence to the maximum value of 1500 mm. Optionally a vertical mounting of marker is acceptable provided strip of minimum width of 75",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 3,
    "text": "250 mm above the ground with maximum height of 1500 mm. However, a height of 2100 mm may be accepted in cases where technical conditions prevent the adherence to the maximum value of 1500 mm. Optionally a vertical mounting of marker is acceptable provided strip of minimum width of 75 mm consisting of continuous or non-continuous elements, if body structure doesn’t allow fixing marker continuously, is affixed on both side of vehicle between 250 mm to 1500 mm from the ground, meeting the requirements of (e) and (f) below. However, a height of 2100 mm may be accepted in cases where technical conditions prevent the adherence to the maximum value of 1500 mm. 1/3 e) The marker shall begin at a location not further than 150 mm from the outer edges of vehicle defined by outer edges of the bumper. f) The marker shall cover atleast 80% of the width of the vehicle at the front and may be in the form of continuous or non-continuous elements, if body structure doesn’t allow fixing marker continuously. ” 2.0 Motor vehicles of category M3 and N3 shall be affixed with retro-reflective conspicuity markers, at rear as specified below: a) The marker shall be red in colour. b) The marking shall be rectangular in shape and consist of tape or equivalent. c) The marking tape shall meet the requirements of Grade I & pressure bounding type as specified in IS: 14221 1995. d) The marking shall have a minimum width of 75 mm and shall be affixed horizontally or vertically on the vehicle rear face. The lower edge of the marking shall be affixed at the minimum height of at least 250 mm above the ground with maximum height of 1500 mm. However, a height of 2100 mm may be accepted in cases",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 4,
    "text": "and shall be affixed horizontally or vertically on the vehicle rear face. The lower edge of the marking shall be affixed at the minimum height of at least 250 mm above the ground with maximum height of 1500 mm. However, a height of 2100 mm may be accepted in cases where technical conditions prevent the adherence to the maximum value of 1500 mm. Optionally a vertical mounting of marker is acceptable provided one strip of minimum width of 75 mm consisting of continuous or non-continuous elements, if body structure doesn’t allow fixing marker continuously, is affixed on both side of vehicle between 250 mm to 1500 mm from the ground, meeting the requirements of (e) and (f) below. However, a height of 2100 mm may be accepted in cases where technical conditions prevent the adherence to the maximum value of 1500 mm. e) The marker shall begin at a location not further than 150 mm from the outer edges of vehicle defined by outer edges of the bumper. 2/3 f) The marker shall cover at least 80% of the width of the vehicle at the rear and may be in the form of continuous or non-continuous elements, if body structure doesn’t allow fixing marker continuously. ” PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P. B. NO. 832, PUNE 411 004 ON BEHALF OF AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF SHIPPING, ROAD TRANSPORT & HIGHWAYS (DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS) GOVERNMENT OF INDIA December 2007 3/3 AMENDMENT NO. 2 TO AIS-022/2001 Automotive Vehicles – Advance–Warning Triangles – Specifications 1.0 Title of the standard : Substitute following title for the existing title : “Automotive Vehicles – Advance - Warning Triangles and Conspicuity Marking Tape - Specifications ” 2.0 Page",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 5,
    "text": "& HIGHWAYS) GOVERNMENT OF INDIA December 2007 3/3 AMENDMENT NO. 2 TO AIS-022/2001 Automotive Vehicles – Advance–Warning Triangles – Specifications 1.0 Title of the standard : Substitute following title for the existing title : “Automotive Vehicles – Advance - Warning Triangles and Conspicuity Marking Tape - Specifications ” 2.0 Page No. nil, Introduction: Insert new paragraph after 3rd paragraph as follows: “ The need of alternate conspicuity markings for complying with requirements of retro-reflective tapes has been addressed in the Amendment No. 2 as agreed in 18th CMVR-TSC meeting. This shall be transitory provision till AIS 090 (under formulation) is notified. ” 3.0 Page No. nil, Introduction, last paragraph: Substitute following text for the existing text; The Automotive Industry Standards Committee responsible for preparation of this standard is in Annexure- 9. 4.0 Page No.1, Title of the standard: Substitute following title for the existing title : “Automotive Vehicles – Advance - Warning Triangles and Conspicuity Marking Tape - Specifications ” 5.0 Page No.1, clause No. 1., Scope and Applicability: Add new clause 1.3 as follows; “ 1.3 The requirement of conspicuity markings shall be applicable for M3 and N3 categories of vehicles ” 6.0 Page No.1, clause 2., References: Add new paragraph as follows; 1/3 “ 3) IS:14221 - 1995 : Automotive Vehicles – Retro-reflective Sheets and Tapes – Specifications.” 7.0 Page No.2, clause 4.0, Application for Approval: Add new clause 4.6 as follows; “ 4.6 For the approval of the conspicuity marking, sample shall be submitted as per the IS: 14221-95.” 8.0 Page No.3, clause 6.0, Approval: Add new clause 6.4 as follows; “ 6.4 The conspicuity markings on the front of the vehicle for the M3 and N3 categories of vehicles shall be as per Annexure 8 of this standard. 9.0 Page No. 25 : Insert new Annexure",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 6,
    "text": "IS: 14221-95.” 8.0 Page No.3, clause 6.0, Approval: Add new clause 6.4 as follows; “ 6.4 The conspicuity markings on the front of the vehicle for the M3 and N3 categories of vehicles shall be as per Annexure 8 of this standard. 9.0 Page No. 25 : Insert new Annexure 8 as follows; \" ANNEXURE 8 REQUIREMENTS OF ALTERNATE CONSPICUITY MARKERS IN THE FORM OF RETRO-REFLECTIVE TAPES Motor vehicles of category M3 and N3 shall be affixed with retro-reflective conspicuity markers, at front as specified below: a) The marker shall be WHITE in colour. b) The marking shall be rectangular in shape and consist of tape or equivalent. c) The marking tape shall meet the requirements of Grade I & pressure bounding type as specified in IS: 14221 1995. d) The marking shall have a minimum width of 75 mm and shall be affixed horizontally or vertically on the vehicle front face above the bumper. The lower edge of the marking shall be affixed at the minimum height of atleast 250 mm above the ground with maximum height of 1500 mm. However, a height of 2100 mm may be accepted in cases where technical conditions prevent the adherence to the maximum value of 1500 mm. Optionally a vertical mounting of marker is acceptable provided one strip of minimum width of 75 mm consisting of continuous or non-continuous elements, if body structure doesn’t allow fixing marker continuously, is affixed on either side of vehicle between 250 mm to 1500 mm from the ground, meeting the requirements of (e) and (f) below. 2/3 e) The marker shall begin at a location not further than 150 mm from the outer edges of vehicle defined by outer edges of the bumper. f) The marker shall cover atleast 80% of the width of the vehicle",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 7,
    "text": "the ground, meeting the requirements of (e) and (f) below. 2/3 e) The marker shall begin at a location not further than 150 mm from the outer edges of vehicle defined by outer edges of the bumper. f) The marker shall cover atleast 80% of the width of the vehicle at the front and may be in the form of continuous or non-continuous elements, if body structure doesn’t allow fixing marker continuously. ” 10.0 Renumber existing “Annexure 8” as “ Annexure 9 ” PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P.B. NO. 832, PUNE 412 004 ON BEHALF OF AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF SHIPPING, ROAD TRANSPORT & HIGHWAYS ( DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS ) GOVERNMENT OF INDIA March 2006 3/3 AMENDMENT NO. 1 TO AIS-022/2001 Automotive Vehicles – Advance–Warning Triangles – Specifications 1. Page no.3, clause no. 7.8: Replace existing text with the following text: “Reflecting as well as fluorescent surface of the device shall not be flexible in nature. Retro-reflecting and fluorescent coating shall not be on the flexible material such as cloth, canvas etc. as a substrate” 2. Page no.3, clause no. 7.8: Renumber existing cl. “ 7.8 ” as “ 7.9 ” PRINTED BY: THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P. B. NO. 832. PUNE 411 004 ON BEHALF OF : AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF ROAD TRANSPORT & HIGHWAYS GOVERNMENT OF INDIA January 2004 AIS - 022/2001 AUTOMOTIVE INDUSTRY STANDARD Automotive Vehicles – Advance –Warning Triangles - Specifications PRINTED BY: THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P. B. NO. 832. PUNE 411 004 ON BEHALF OF : AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 8,
    "text": "HIGHWAYS GOVERNMENT OF INDIA January 2004 AIS - 022/2001 AUTOMOTIVE INDUSTRY STANDARD Automotive Vehicles – Advance –Warning Triangles - Specifications PRINTED BY: THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P. B. NO. 832. PUNE 411 004 ON BEHALF OF : AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF ROAD TRANSPORT & HIGHWAYS GOVERNMENT OF INDIA May 2001 AIS - 022/2001 Status chart of the Standard to be used by the purchaser for updating the record Sr. Corr- Amend- Revision Date Remark Misc. No. igenda. ment General remarks : AIS - 022/2001 Introduction The Automotive Industries Standards Committee (AISC) functions under the guidance of CMVR Technical Standing Committee. AISC is set up to assist the Automotive Industry as well as Government of India in the preparation of new standards and review of the existing standards. ARAI acts as the secretariat of AISC. Advance Warning Triangles are used to indicate the presence of the halted vehicle. This type of signalling device will serve as an advance warning to all the vehicles which may approach the halted vehicle. In order to serve its purpose, it is proposed to place the triangle on the carriageway at some distance prior to the actual position of the halted vehicle, so that the oncoming driver can take evasive action on seeing the triangle even before he/she sees the vehicle. The distance at which it is to be placed can be deliberated upon. Also the advance warning triangle is to be used both during the day and night. Presently CMVR 138 (4)-C stipulates a triangle of size 150 mm with a red reflecting surface as per IS : 8339- 1993. But this size is too small to provide an effective warning and hence alignment with ECE R 27 is necessary",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 9,
    "text": "be used both during the day and night. Presently CMVR 138 (4)-C stipulates a triangle of size 150 mm with a red reflecting surface as per IS : 8339- 1993. But this size is too small to provide an effective warning and hence alignment with ECE R 27 is necessary as this specifies a larger triangle. This standard fulfils the above requirement. The Committee responsible for preparation of this standard is in Annexure- 8. AIS - 022/2001 Automotive Vehicles – Advance Warning Triangles Specifications 1. SCOPE AND APPLICABILITY 1.0 This Standard applies to advance-warning triangles intended to be on board motor vehicles and to be placed on the carriageway (road) in order to signal, by day and at night, the presence of a halted vehicle. 1.1 The motor vehicles mentioned above include all 4 – wheelers except Agricultural Tractors. 2. REFERENCES 2.1 The following Indian Standards are necessary adjuncts to this standard : 1) IS :8339 - 1993 : Automotive vehicles - Reflex Reflectors - Specification 2) Considerable assistance has been taken from ECE R 27. 3. DEFINITIONS For the purposes of this Standard, 3.1 Advance-warning triangle means the device referred to in Paragraph 1 above, and in the form of an equilateral triangle. 3.2 Type of triangle means advance-warning triangles which do not differ in such essential respects as, 3.2.1 the manufacturer, 3.2.2 the optical characteristics; 3.2.3 the distinctive geometrical and mechanical features of the design; 3.3 Retro-reflecting device means an assembly, ready for use, comprising one or more retro-reflecting optical units; 3.4 Front Face of the triangle means the face carrying the optical units; 3.5 \"Axis of the advance-warning triangle means the straight line which, perpendicular to the front face of the triangle, passes through its centre; 3.6 Fluorescent material which, either in the mass or at the",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 10,
    "text": "retro-reflecting optical units; 3.4 Front Face of the triangle means the face carrying the optical units; 3.5 \"Axis of the advance-warning triangle means the straight line which, perpendicular to the front face of the triangle, passes through its centre; 3.6 Fluorescent material which, either in the mass or at the surface, when excited by daylight, exhibits the phenomenon of photo-luminescence ceasing rather shortly after excitation; 1 AIS - 022/2001 3.7 Luminance factor the ratio of the luminance of the body considered to the luminance of the perfect diffuser under identical conditions of illumination and observation. The luminance of the body considered includes that produced by reflection and by fluorescence; 3.8 Co-efficient of Luminous Intensity (CIL) means the value obtained by dividing the luminous intensity reflected in the direction considered, by the illumination of the retro-reflecting device, for given observation, entrance and rotation angles. 4.0 APPLICATION FOR APPROVAL The application for approval shall be submitted by the manufacturer or by his duly accredited representative, and shall be accompanied by: 4.1 Dimensional drawings in A4 or folded A4 size in triplicate with sufficient details to permit identification of the type; 4.2 Technical specifications of the advance-warning triangle as per Annexure 1; 4.3 A copy of the instructions on its assembly for use, if applicable; 4.4 Four samples of the advance-warning triangle and at least two protective covers if the advance-warning triangles are to be supplied with protective covers; 4.5 Two samples of the fluorescent material in which a 100x100 mm square can be inscribed and which are fully representative of the material applied under the same conditions to the same base material as used for the advance-warning triangle. 5.0 MARKINGS 5.1 Every advance-warning triangle and its protective cover shall, when submitted for approval, bear the trade name or mark of the applicant;",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 11,
    "text": "be inscribed and which are fully representative of the material applied under the same conditions to the same base material as used for the advance-warning triangle. 5.0 MARKINGS 5.1 Every advance-warning triangle and its protective cover shall, when submitted for approval, bear the trade name or mark of the applicant; such marking shall be clearly legible and be indelible. 5.2 Every advance-warning triangle and its protective cover shall provide adequate space for ‘S’ or ‘E’ mark; the space aforesaid shall be shown in the drawings referred to in Paragraph 4.1 above. 6.0 APPROVAL 6.1 If all the samples of a type of advance-warning triangle which are submitted in conformity with the provisions of Paragraph 4 above meet the requirements of this Standard, approval shall be granted. 6.2 The trade name or mark on the protective cover shall be visible from the outside. 2 AIS - 022/2001 6.3 The ‘S’ or ‘E’ mark shall be clearly legible and indelible. 7.0 GENERAL SPECIFICATIONS 7.1 The advance-warning triangle shall be open at the at the centre and shall comprise a red border composed of an outer retro-reflecting strip and an inner fluorescent strip, the whole supported at a certain height above the surface of the carriageway. The open centre and the fluorescent and retro- reflecting strips shall be bounded by concentric equilateral triangle contours. 7.2 Advance-warning triangles shall be so made that in normal use (on the road and when carried in the vehicle) they retain the prescribed characteristics and their satisfactory functioning continues to be ensured. 7.3 The optical units of the advance-warning triangle shall not be easily disassembled. The various parts making up the advance-warning triangle shall provide good stability on the road. They shall not be easily disassembled. If a triangle has to be folded in order to be placed",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 12,
    "text": "continues to be ensured. 7.3 The optical units of the advance-warning triangle shall not be easily disassembled. The various parts making up the advance-warning triangle shall provide good stability on the road. They shall not be easily disassembled. If a triangle has to be folded in order to be placed in its protective cover, the movable parts, including its supports, shall not be detachable. 7.4 When the advance-warning triangle is in the position of use on the road, the front face of the triangle must be vertical. This condition is deemed fulfilled if the axis of the triangle does not form an angle of more than 50 with the base plane. 7.5 The front face of the advance-warning triangle shall be easy to clean; in particular it shall not be rough, and such protuberances as it may exhibit shall not prevent such cleaning. 7.6 The advance-warning triangle and its support shall not present sharp edges or corners. 7.7 The advance-warning triangle shall be accompanied by its protective cover, if any, against external agents, especially during carriage; it may however be supplied without protective cover where the necessary protection is provided by other means. These means shall be stated in the Technical Specifications mentioned in Paragraph 4.2 above. 7.8 Each triangle shall be required to be accompanied by a copy of the instructions referred to in Paragraph 4.3 above. 8.0 PARTICULAR SPECIFICATIONS 8.1 Requirements as to Shape and Dimensions 8.1.1 Shape and Dimensions of the Triangle (see Annex 2) 3 AIS - 022/2001 8.1.1.1.The theoretical sides of the triangle shall be at least 500– 50 mm in length. 8.1.1.2 The retro-reflecting units shall be arranged along the edge within a strip of an unvarying width which shall be between 25 mm and 50 mm. 8.1.1.3 Between the outer edge of the",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 13,
    "text": "- 022/2001 8.1.1.1.The theoretical sides of the triangle shall be at least 500– 50 mm in length. 8.1.1.2 The retro-reflecting units shall be arranged along the edge within a strip of an unvarying width which shall be between 25 mm and 50 mm. 8.1.1.3 Between the outer edge of the triangle and the retro-reflecting strip, there may be an edging not more than 5 mm wide and not necessarily red- coloured. 8.1.1.4 The retro reflecting strip may be continuous or not. In the latter case the free area of the supporting material must be red. 8.1.1.5 The fluorescent material must be contiguous to the retro-reflecting units. It shall be arranged symmetrically along the three sides of the triangle. When in use, its surface area shall be not less than 315 square cms. However, an edging, continuous or not, not more than 5 mm wide, which need not necessarily be red-coloured, may be placed between the retro-reflecting surface and the fluorescent surface. 8.1.1.6 The side of the open central triangle shall have a minimum length of 70 mm (Fig.1) 8.1.2 Shape and Dimensions of the Support 8.1.2.1 The distance between the supporting surface and the lower side of the advance-warning triangle shall not exceed 300 mm (Fig.1). 8.2 Colorimetric specifications 8.2.1 Retro-reflecting Devices 8.2.1.1 Retro-reflecting devices shall be made of material coloured red in the mass. 8.2.1.2 When the retro-reflecting device is illuminated by the CIE standard illuminant A, with an observation angle of 0(cid:176) 20’ and an entrance angle V=H=0(cid:176) , or, if this produces a colourless surface reflection, an angle V= – 5(cid:176) , H=0(cid:176) , the trichromatic co-ordinates of the red reflected luminous flux shall be within the following limits: Limit towards yellow y £ 0.335 Limit towards purple z £ 0.008 8.2.1.3 The testing of the colour",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 14,
    "text": ", or, if this produces a colourless surface reflection, an angle V= – 5(cid:176) , H=0(cid:176) , the trichromatic co-ordinates of the red reflected luminous flux shall be within the following limits: Limit towards yellow y £ 0.335 Limit towards purple z £ 0.008 8.2.1.3 The testing of the colour shall be carried out according to the method described in Annexure 4, paragraph 2.1. 8.2.2 Fluorescent Materials 8.2.2.1 The fluorescent materials shall either be coloured in the mass or take the form of separate coatings applied to the surface of the triangle. 4 AIS - 022/2001 8.2.2.2 When the fluorescent material is illuminated by the CIE standard illuminant C the trichromatic co-ordinates of the light reflected and emitted by the fluorescence shall be within an area of which the corner points are determined by the following co-ordinates {the angle of illumination being 45(cid:176) and the observation being made at an angle of 90(cid:176) to the sample (45(cid:176) /0(cid:176) measuring geometry)}: Point 1 2 3 4 x 0.690 0.595 0.569 0.655 y 0.310 0.315 0.341 0.345 8.2.2.3 The testing of colour shall be carried out according to the method described in Annexure 4, paragraph 2.2. 8.3 Photometric specifications 8.3.1 Retro-reflecting Devices 8.3.1.1 The values of CIL of retro-reflecting optical units shall be not less than those given in the table below, expressed in millicandelas per lux, for the angles of observation(or divergence) and the entrance(illumination) angle shown Illumination angles b Vertical V (b ) 0 – 20(cid:176) 0(cid:176) 0(cid:176) 1 Horizontal H (b ) 0 or – 5(cid:176) 0(cid:176) – 30(cid:176) – 40(cid:176) 2 Angles of Divergence 20’ 8000 4000 1750 600 ( a ) 600 200 100 50 1(cid:176) 30’ 8.3.1.2 The CIL measured on random slices of 50 mm length of the reto-reflecting device shall lie between extremes having",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 15,
    "text": "H (b ) 0 or – 5(cid:176) 0(cid:176) – 30(cid:176) – 40(cid:176) 2 Angles of Divergence 20’ 8000 4000 1750 600 ( a ) 600 200 100 50 1(cid:176) 30’ 8.3.1.2 The CIL measured on random slices of 50 mm length of the reto-reflecting device shall lie between extremes having a ratio not in excess of 3. These slices are taken between the perpendiculars to the side of the triangle and passing through the corresponding apexes of the central aperture. This requirement applies to an angle of divergence of 20’ and to illumination angles of V = 0(cid:176) , H = 0(cid:176) or – 5(cid:176) and V = – 20(cid:176) , H = 0(cid:176) . 8.3.1.3 Diversity of luminance at angles of illumination of V = 0(cid:176) , H = – 30(cid:176) and V = 0(cid:176) , H = – 40(cid:176) shall be tolerated on condition that the triangular shape remains clearly discernible, for an angle of divergence of 20’ and an illumination of approximately 1 lux. 8.3.1.4 The measurements referred to above shall be performed by the method described in Annexure 4 to this standard, paragraph 4. 5 AIS - 022/2001 8.3.2 Fluorescent Materials 8.3.2.1 The Luminance factor including the luminance by reflection and fluorescence, shall not be less than 30%. 8.3.2.2 The measurement of luminance factor shall be carried out according to the method described in Annexure 4, paragraph 3. 9.0 TEST PROCEDURE Every advance-warning triangle and its protective cover, if any, shall meet the requirements of the checks and tests described in Annex 4 of this Standard. 10. MODIFICATIONS OF THE ADVANCE-WARNING TRIANGLE TYPE AND EXTENSION OF APPROVAL 10.1 Every modification of the triangle type shall be notified to the Testing Agency which granted approval. The Testing Agency may then consider whether: 10.1.1 the modifications made are",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 16,
    "text": "checks and tests described in Annex 4 of this Standard. 10. MODIFICATIONS OF THE ADVANCE-WARNING TRIANGLE TYPE AND EXTENSION OF APPROVAL 10.1 Every modification of the triangle type shall be notified to the Testing Agency which granted approval. The Testing Agency may then consider whether: 10.1.1 the modifications made are unlikely to have an appreciable adverse effect, and that in any case the triangle meets the requirements; or 10.1.2 any testing is required 10.2 For considering whether testing is required or not, the guidelines given in Annexure 5 should be followed. 10.3 In case of 10.1.2, tests need to be carried out only for those parameters which are affected by the modifications. 10.4 In the event of 10.1.1. or in case of 10.1.2 after successful compliance to the performance requirements, the certificate of compliance shall be validated for the modified version 11.0 CONFORMITY OF PRODUCTION 11.1 Advance-Warning Triangles approved under this standard shall be so manufactured as to conform to the type approval by meeting the requirements set forth in Paragraphs 7,8 and 9 above. 11.2 The minimum requirements for conformity of production control procedures set forth in Annex 7 shall be complied with. 11.3 The authority which has granted type approval may at any time verify the conformity control methods applied in each production facility. The normal frequency of these verifications shall be once every two years. 6 AIS - 022/2001 ANNEXURE 1 (Ref. Para 4.2) Technical Specifications of Advance-Warning Triangles 1. Trade name or mark of the advance-warning triangle 2. Manufacturer’s name 3. Address 4. If applicable, name of manufacturer's representative Type of warning triangle (Foldable/ non-foldable) Sketch showing dimensions of warning triangle Type of protective cover , when provided Type of protection if provided by other means Location where ‘S’ or ‘E’ mark will be printed (as",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 17,
    "text": "triangle 2. Manufacturer’s name 3. Address 4. If applicable, name of manufacturer's representative Type of warning triangle (Foldable/ non-foldable) Sketch showing dimensions of warning triangle Type of protective cover , when provided Type of protection if provided by other means Location where ‘S’ or ‘E’ mark will be printed (as applicable) 7 AIS - 022/2001 ANNEXURE 2 (Ref. Para 8.1.1) 8 AIS - 022/2001 9 AIS - 022/2001 ANNEXURE 3 DETERMINATION OF THE ROUGHNESS OF THE ROAD SURFACE ‘SANDY BEACH’ METHOD 1. PURPOSE OF THE METHOD 1.1 The purpose of this method is to describe and to determine to a certain extent the geometric roughness of that part of the road surface on which the advance-warning triangle is placed during the test of stability in wind, as required according to Annex 4, Paragraph 10. 2. PRINCIPLE OF THE METHOD 2.1 A known volume V of sand is spread evenly on the surface of the carriageway (road) in the form of a circle. The ratio of the volume used to the area S covered is defined as \"mean sand depth\" H and is expressed in S mm. H = V/S S 2.2 The test is carried out by means of round-grain, dry sand and having a grain size between 0.160 mm and 0.315 mm. The volume amounts to 25 ml ± 0.15 ml. The sand is spread out over the surface where the test is carried out by means of a flat, circular disc with a diameter of 65 mm, one side of which is covered with a sheet of rubber having a thickness of 1.5 mm to 2.5 mm and the other being provided with an appropriate handle. If the diameter of the circular area covered with sand is D mm, the mean sand depth will be calculated in accordance",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 18,
    "text": "side of which is covered with a sheet of rubber having a thickness of 1.5 mm to 2.5 mm and the other being provided with an appropriate handle. If the diameter of the circular area covered with sand is D mm, the mean sand depth will be calculated in accordance with the formula: H = (4/p ) x (25/D2) x 103 mm S 3. PERFORMANCE OF THE TEST 3.1 The surface on which the test is to be carried out must be dry and at first be brushed with a soft brush to remove any dirt or loose gravel. 3.2 The sand which has been firmly filled into an appropriate receptacle is then poured out on the surface to be tested in a single heap. The sand is then carefully spread out on the surface by means of repeated circular movements of the rubber faced disc so as to form the largest possible round area covered with sand. The sand will then fill all depressions and hollows. 3.3 Two diameters, at right angles to one another, of the \"beach\" thus formed are usually measured. The mean value is rounded off to the nearest 5 mm, with the depth of the sand H being calculated according to the S formula given in Paragraph 2.2. 3.4 Six tests of this kind are carried out on the supporting surface, with the parts to be tested being distributed over the surface to be tested as evenly as possible. The overall mean of the results obtained is given as the mean sand depth H of the road surface where the advance-warning S triangle has been placed. 10 AIS - 022/2001 ANNEXXURE 4 TEST PROCEDURES 1. GENERAL 1.1 The applicant shall submit samples, as mentioned in clause 4.4 and 4.5 of this Standard, for approval. 1.2",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 19,
    "text": "obtained is given as the mean sand depth H of the road surface where the advance-warning S triangle has been placed. 10 AIS - 022/2001 ANNEXXURE 4 TEST PROCEDURES 1. GENERAL 1.1 The applicant shall submit samples, as mentioned in clause 4.4 and 4.5 of this Standard, for approval. 1.2 After verification of the general specifications (clause 7 of the Standard) and the specifications of shape and dimensions (clause 8.1 of this Standard), all samples shall be subjected to the Heat resistance test mentioned in paragraph 7 below. 1.3 After the heat resistance test and subsequent storage for 12 consecutive hours at a temperature of 25 + 50 C, the advance warning triangle, in its protective cover, is to be subjected to the Cold Test according to the paragraph 8 mentioned below. Immediately after removal from the cold room, no fractures or visible distortion shall be noticeable on the device and especially on its optical parts. The protective cover, if provided, shall be properly openable, and shall neither tear nor adhere to the advance – warning triangle. 1.4 The CIL value of the four samples of the advance-warning triangles submitted is measured at an observation angle of 20' and at an illumination angle with the components V = 00, H = – 50; this test is carried out in accordance with the method described in paragraph 4 below. 1.5 The two triangles which show the smallest and the largest CIL value during the tests carried out according to Paragraph 1.4 above shall be visually compared, during daylight and at a distance of 30m by an observer having normal colour response, with the two samples submitted in accordance with clause 4.5 of this standard. There shall be no noticeable difference in colour or luminance between the fluorescent material on the four",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 20,
    "text": "above shall be visually compared, during daylight and at a distance of 30m by an observer having normal colour response, with the two samples submitted in accordance with clause 4.5 of this standard. There shall be no noticeable difference in colour or luminance between the fluorescent material on the four samples. 1.6 The same two samples with the smallest and the largest CIL value in the tests according to Paragraph 1.4 above shall be subsequently subjected to the following tests: 1.6.1 Measurement of the values of the CIL in respect of the observation and illumination angles referred to in clause 8.3.1.1 and 8.3.1.2 of this standard according to the method described in paragraph 4 below. The visual inspection as meant in paragraph 8.3.1.3 and 8.3.1.4 of this standard shall then also be performed. 1.6.2 Testing of the colour of the retro-reflected light according to paragraph 2.1 below on the sample which, as a result of a visual inspection seems to have the least favourable colorimetric characteristics; in other cases the sample with the highest CIL concerned shall be examined. 11 AIS - 022/2001 1.6.3 Test of clearance to ground according to Paragraph 5 below. 1.6.4 Mechanical solidity test according to Paragraph 6 below. 1.7 One sample other than those referred to in Paragraph 1.5 above shall be subjected to the following tests: 1.7.1 Testing of Resistance to penetration of water into the retro-reflecting device according to paragraph 12.1 mentioned below or if relevant, of the mirror-backed reverse side of the retro-reflecting device, according to paragraph 12.2 mentioned below. 1.8 The second sample, other than those referred to in Paragraph 1.5 above shall be subjected to the following tests: 1.8.1 Water test according to Paragraph 9 below. 1.8.2 Testing of resistance to fuels according to paragraph 10.0 mentioned below. 1.7.3 Test",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 21,
    "text": "retro-reflecting device, according to paragraph 12.2 mentioned below. 1.8 The second sample, other than those referred to in Paragraph 1.5 above shall be subjected to the following tests: 1.8.1 Water test according to Paragraph 9 below. 1.8.2 Testing of resistance to fuels according to paragraph 10.0 mentioned below. 1.7.3 Test of stability against wind according to Paragraph 11.0 below. 1.9 After the tests specified in the Paragraph 1.5 above, the two samples submitted according to clause 4.5 of this standard shall be subjected to the following tests: 1.9.1 Colour Test according to Paragraph 2.2 below. 1.9.2 Test of Luminance factor according to Paragraph 3 below. 1.9.3 Test of weather resistance according to Paragraph 13 below. 2. COLOUR TESTS 2.1 Colour of the Retro-reflecting Devices 2.1.1 The colour of the retro-reflecting devices to be tested according to the Paragraph 8.2.1 of this standard may be ascertained visually by observers having normal colour-response, by means of comparison with coloured lights the trichromatic co-ordinates of which is adequately within the colour limits defined in Paragraph 8.2.1.2 of this standard. 2.1.2 If any doubt remains after this test, compliance with the colorimetric specifications shall be verified by determining the trichromatic co- ordinates of the most doubtful sample. 12 AIS - 022/2001 2.2 Colour of the Fluorescent material 2.2.1 The colour of the fluorescent material to be tested according to the Paragraph 8.2.2 of this standard may be ascertained visually by the observers having normal colour-response, by comparison with fluorescent materials the trichromatic co-ordinates of which is adequately within the colour limits defined in Paragraph 8.2.2.2 of this standard. The illumination and observation of the samples shall be carried out in the measuring geometry 45(cid:176) /0(cid:176) , and the illuminance shall be chosen so as to ensure photopic vision. 2.2.2 If any doubt remains after",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 22,
    "text": "which is adequately within the colour limits defined in Paragraph 8.2.2.2 of this standard. The illumination and observation of the samples shall be carried out in the measuring geometry 45(cid:176) /0(cid:176) , and the illuminance shall be chosen so as to ensure photopic vision. 2.2.2 If any doubt remains after this test, compliance with the colorimetric specifications shall be verified by determining the trichromatic co-ordinates of the most doubtful sample. 3. DETERMINATION OF THE LUMINANCE FACTOR OF THE FLUORESCENT MATERIAL 3.1 For the determination of the luminance factor the sample shall be illuminated by a light source of the CIE illuminant C, at an angle of illumination of 45(cid:176) to the normal, and the light emitted by luminosity and reflection observed in the direction of the normal (geometry 45(cid:176) /0(cid:176) ) shall be measured. The luminance factor may be obtained by the following method: 3.1.1 By putting the luminance L of the sample into relation to the luminance L o of a perfect diffuser whose luminance factor b is known under identical o conditions of illumination and observation; the luminance factor b of the sample then results from the formula: b =( L/ L )• b o o 3.1.2 When the colour of the fluorescent material has been colorimetrically determined in compliance with Paragraph 2.2.2 above, from the ratio of the tristimulus value Y the sample and the tristimulus value of the perfect diffuser Y ; in this case it is: o b = Y/Y o 4. MEASUREMENT OF THE CIL VALUE OF RETRO-REFLECTING DEVICES 4.1 For this measurement it is assumed that the direction of illumination H=V= 0º for the advance-warning triangle in its position of use is parallel to the base plane and vertical to the lower side of the triangle, which in turn is parallel to the",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 23,
    "text": "CIL VALUE OF RETRO-REFLECTING DEVICES 4.1 For this measurement it is assumed that the direction of illumination H=V= 0º for the advance-warning triangle in its position of use is parallel to the base plane and vertical to the lower side of the triangle, which in turn is parallel to the said plane. 4.2 The measurement shall be performed by the method described in Annexure 6 to this standard. 13 AIS - 022/2001 5. TEST OF CLEARANCE TO GROUND 5.1 The advance-warning triangle shall be required to pass the following tests: 5.1.1 For this test, the apparatus shown in Annex 2, Figure 2, of this Standard, which has the form of an inverted hollow pyramid, shall be placed on a horizontal base plane. 5.1.2 The individual supports to the ground shall be placed one after another in the square hole 0 of the test apparatus. During the test of each support, it shall be required to find a position of the test apparatus in relation to the advance-warning triangle and its supporting device, which is favourable for the triangle and which ensures that: 5.1.2.1all supports are resting simultaneously on the base plane, 5.1.2.2 outside the area covered by the test apparatus, the distance between the base plane and parts of the triangle as well as of the supporting device is at least 50 mm (with the exception of the supports proper). 6. MECHANICAL SOLIDITY TEST 6.1 When the advance-warning triangle has been set up as required by the manufacturer and its bases are firmly held, a force of 2 N shall be applied to the apex of the triangle parallel to the supporting surface and normal to the lower side of the triangle. 6.2 The apex of the triangle shall not move more than 5 cm in the direction in which",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 24,
    "text": "bases are firmly held, a force of 2 N shall be applied to the apex of the triangle parallel to the supporting surface and normal to the lower side of the triangle. 6.2 The apex of the triangle shall not move more than 5 cm in the direction in which the force is exerted. 6.3 After the test, the position of the device shall not be significantly different from its original position. 7. HEAT RESISTANCE TEST 7.1 The advance-warning triangle in its protective cover, if provided, shall be kept for 12 hours in a dry atmosphere at a temperature of 70 – 3(cid:176) C. 7.2 After the test, no cracking or noticeable distortion of the device shall be visible; this applies in particular to the retro-reflecting device. The cover shall be openable and shall not adhere to the triangle. 8. COLD TEST The advance-warning triangle in its protective cover shall be tested for low temperature use at the following conditions: Temperature -10(cid:176) C Duration of exposure 12 hours 14 AIS - 022/2001 9. WATER TEST The triangle - collapsible advance-warning triangles are to be assembled is for use - shall be immersed flat for 2 hours on the bottom of a tank containing water of 25 ± 50 C, with the active face of the triangle slowing upwards and being 5 cm under the surface of the water. The triangle shall then be removed and dried. No part of the device may exhibit clear signs of deterioration which might impair the effectiveness of the triangle. 10.0 TEST OF RESISTANCE TO FUELS The triangle and its protective cover shall be immersed separately in a tank containing a mixture of petrol and benzene (proportion 90:10). After 60 seconds they shall be removed from the tank and drained of excess liquid. The triangle",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 25,
    "text": "the effectiveness of the triangle. 10.0 TEST OF RESISTANCE TO FUELS The triangle and its protective cover shall be immersed separately in a tank containing a mixture of petrol and benzene (proportion 90:10). After 60 seconds they shall be removed from the tank and drained of excess liquid. The triangle shall then be placed in its protective cover and the unit shall be laid flat in a still atmosphere. When completely dried, the triangle shall not adhere to its protective cover, and there shall be no visually noticeable change on its surface and shall not present apparent detrimental modifications; however, slight surface cracks may be tolerated 11. TEST OF STABILITY AGAINST WIND 11.1 The advance-warning triangle shall be set up in a wind tunnel, on a base measuring about 1.5 m by 1.2 m formed of a road surface as normally used by the competent authorities. This surface shall be characterised by its geometric roughness H = 0.5 mm ± 0.05 mm, which shall be defined and S determined by the so-called \"sandy beach\" method according to Annex 3 of this Standard. 11.2 When set up in this manner, the advance-warning triangle shall be subjected for 3 minutes to an air stream exerting a dynamic pressure of 180 Pa (about 60 km/h under normal conditions) parallel to the supporting surface, in a direction which seems to be most unfavourable for the stability. or alternative test method 11.3 The advance-warning triangle shall be set up on asphalted road and subjected for 3 minutes to an air stream exerting a dynamic pressure of 180 Pa (about 60 km/h under normal conditions) parallel to the supporting surface, in a direction which seems to be most unfavorable for the stability. 11.4 The advance-warning triangle shall: 11.4.1 neither overturn, 11.4.2 nor shift. Slight shifting of",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 26,
    "text": "3 minutes to an air stream exerting a dynamic pressure of 180 Pa (about 60 km/h under normal conditions) parallel to the supporting surface, in a direction which seems to be most unfavorable for the stability. 11.4 The advance-warning triangle shall: 11.4.1 neither overturn, 11.4.2 nor shift. Slight shifting of the points of contact with the road surface by not more than 5 cm, however, shall be allowed. 11.5 The triangular part of the device shall not rotate through more than 10(cid:176) round a horizontal axis or a vertical axis from its initial position. 15 AIS - 022/2001 12. TEST OF RESISTANCE OF THE RETRO-REFLECTING DEVICE 12.1 Test of Resistance to penetration of water 12.1.1 The triangle-collapsible triangles are to be assembled as for use – shall be immersed for 10 minutes in water having a temperature of 50 – 5(cid:176) C, with the highest point of the upper part of the illuminating surface being about 20 mm below the water surface. Immediately afterwards this retro- reflecting device shall be immersed under the same conditions in water having a temperature of 25 – 5(cid:176) C. 12.1.2 After this test, no water shall have penetrated to the reflecting surface of the retro-reflecting device. If a visual inspection clearly reveals the presence of water, the device shall be considered not to comply with this standard. 12.1.3 If the visual inspection does not reveal the presence of water, or in case of doubt the value of the CIL shall again be measured under the same conditions as specified in paragraph 1.3 above, after the retro-reflecting device has been gently shaken to remove excess water from the outside. The CIL shall not have diminished by more than 40% of the values recorded before the test. 12.2 Test of Resistance of the Accessible reverse side",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 27,
    "text": "the same conditions as specified in paragraph 1.3 above, after the retro-reflecting device has been gently shaken to remove excess water from the outside. The CIL shall not have diminished by more than 40% of the values recorded before the test. 12.2 Test of Resistance of the Accessible reverse side of the mirror-backed retro-reflecting device The reverse side of the retro-reflecting device shall be brushed with a hard nylon brush and then thoroughly wetted with a mixture of petrol and benzene(proportion 90:10). After 1 minute, the mixture shall be removed and the device allowed to dry. As soon as evaporation is completed, the reverse side shall be brushed with the same brush as before. The value of the CIL shall then be measured under the same conditions as specified in paragraph 1.4 above, after the whole surface of the mirror-coated reverse side has been covered with Indian ink. The CIL shall not have diminished by more than 40% of the values recorded before the test. 13. TEST OF WEATHER-RESISTANCE OF THE LUMINANCE FACTOR AND OF THE COLOUR OF THE FLUORESCENT MATERIAL 13.1 One of the samples of the fluorescent material submitted according to paragraph 4.5 of this standard shall be subjected to a temperature and irradiation test described in ISO 105 of 1978 until the contrast No. 4 of the grey scale has been reached for the reference sample No. 5. 13.2 After this test, the colour co-ordinates of the fluorescent material shall comply with colour specification in paragraph 8.2.2.2 of this standard. The luminance factor (see Paragraph 3 above shall be at least 30% and shall not have increased by more than 5% compared with the value ascertained according to Paragraph 1.8.2 above. 16 AIS - 022/2001 13.3 The sample shall not exhibit any visible damage such as cracks,",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 28,
    "text": "of this standard. The luminance factor (see Paragraph 3 above shall be at least 30% and shall not have increased by more than 5% compared with the value ascertained according to Paragraph 1.8.2 above. 16 AIS - 022/2001 13.3 The sample shall not exhibit any visible damage such as cracks, scaling or peeling of the fluorescent material. 13.4 If the fluorescent material is an adhesive film which had already successfully passed the above mentioned tests in a previous approval test, the test need not be repeated; a corresponding note shall be entered as “Remarks” in the final test report. 17 AIS - 022/2001 ANNEXURE : 5 WORST CASE CRITERIA PREAMBLE : This Annexure gives factors to be considered while selecting a warning triangle to represent a range of variants for establishing compliance for Type Approval (TA). This is also applicable to : • Extension of TA for changes in Technical Specifications of an already Type Approved warning triangle. • Establishing compliance of new warning triangles / variants based on an already Type Approved warning triangle In general, when changes in Technical Specifications of a warning triangle do not affect the performance adversely, and are still within the stipulated limits, the TA can be extended without further verification. If the changes affect some of the parameters, tests shall be carried out for only those parameters. When some parts/components/assemblies, used on an already Type Approved warning triangle are used in another mode/variant, no additional tests shall be needed to establish compliance of these parts/ components/assemblies to the respective performance requirements. In the case of the following changes, tests shown against each, are necessary to be carried out for establishing compliance. Sr. Parameter and Change Tests to be conducted No. 1 Dimension of the reflex All tests except test for clearance to ground",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 29,
    "text": "these parts/ components/assemblies to the respective performance requirements. In the case of the following changes, tests shown against each, are necessary to be carried out for establishing compliance. Sr. Parameter and Change Tests to be conducted No. 1 Dimension of the reflex All tests except test for clearance to ground are reflecting surface to be conducted if dimensions are increased. However in case dimensions are reduced but are still above the minimum value prescribed in this standard the no tests are required 2 Dimension of the Tests for clearance to ground and stability base/support of the warning against wind are to be conducted triangle 3 Change in the material of the All tests except reflex reflecting surface 1. test for clearance to ground 2. test for stability against wind are to be conducted 4 Change in material of the Test for stability against wind is to be base/ support of the warning conducted triangle 5 Change in material of the Heat and cold resistance tests to be conducted protective cover of the warning triangle 6 Decrease in the thickness of Mechanical solidity test to be conducted the warning triangle Changes other than those listed above are considered to be having no adverse effect on Warning Triangle. 18 AIS - 022/2001 ANNEXURE 6 METHOD OF MEASUREMENT OF THE CIL OF THE RETRO- REFLECTING DEVICE 1. DEFINITIONS Needed definitions are explained in Figures 1 to 4. 2. DIMENSIONAL AND PHYSICAL SPECIFICATIONS FOR THE PHOTOMETRY OF RETRO-REFLECTORS 2.1 The CIE-angular system shown in Figure 1 shall be used. An adequate support (goniometer) is demonstrated in Figure 2. 2.2 The measuring distance It shall be so chosen in such an order that at least the limits for the angles d , g and h given in Figure 4 are respected, but not lower than",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 30,
    "text": "Figure 1 shall be used. An adequate support (goniometer) is demonstrated in Figure 2. 2.2 The measuring distance It shall be so chosen in such an order that at least the limits for the angles d , g and h given in Figure 4 are respected, but not lower than 10 m or its optical equivalent. 2.3 The illuminance at the retro-reflector. The illuminance over the useful area of the retro-reflector, measured perpendicular to the incident light shall be sufficiently uniform. A check on this condition requires a measuring element, the sensitive area of which is not greater than one-tenth of the area to be examined. The variation in the value of the illuminance shall then comply with the condition: Maximum value -------------------- £ 1.05 Minimum value 2.4 The colour temperature and the spectral distribution of the source. The source used for the illuminating the retro-reflector shall as faithfully as possible represent the CIE illuminant A, both as regards colour temperature and spectral power distribution. 2.5 The photometer head (measuring element) 2.5.1 The photometer head shall be correct5ed to the spectral luminous efficiency for the CIE standard photometric observer in photopic vision. 2.5.2 The device shall not show a perceptible change in local sensitivity within the area of its aperture; otherwise suitable provisions must be added, e.g. the application of a diffusing window at a certain distance in front of the sensitive surface. 19 AIS - 022/2001 2.5.3 Experience has shown that non-linearity of photometer heads may be a problem with the very small quantities which are the rule in the photometry of retro-reflectors. A check at comparable illuminance levels on the photometer head is recommended. 2.6 The influence of a regular reflection The amount and distribution of the regular reflection from the surface of the retro-reflector depends on the",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 31,
    "text": "with the very small quantities which are the rule in the photometry of retro-reflectors. A check at comparable illuminance levels on the photometer head is recommended. 2.6 The influence of a regular reflection The amount and distribution of the regular reflection from the surface of the retro-reflector depends on the flatness and the gloss of the surface. In general, the regular is best avoided when the reference axis is placed so that the regular reflection is directed on the opposite side of the source from the photometer head (for example with b = - 5(cid:176) ) 1 Figure 1 The CIE Co-ordinate System 1: First Axis I: Illumination Axis a: Observation angle 2: Second Axis O: Observation Axis b ,b : Entrance angles 1 2 R: Reference Axis R: Rotation angle e : Rotation angle The CIE angular system for specifying and measuring retro-reflectors. The first axis is perpendicular to the plane containing the observation axis and the illumination axis. The second axis is perpendicular both to the first axis and to the reference axis. All axes, angles, and directions of rotation are shown positive. 20 AIS - 022/2001 Note: (a) The principal fixed axis is the illumination axis. (b) The first axis is fixed perpendicular to the plane containing the observation and illumination axis. (c) The reference axis is fixed in the retro-reflector and moveable with b and 1 b 2 Figure 2 Goniometer mechanism embodying the CIE Angular system 1: First Axis I: Illumination Axis a: Observation angle 2: Second Axis O: Observation Axis b ,b : Entrance angles 1 2 R: Reference Axis e : Rotation angle P: Retro-reflective material Representation of a Goniometer mechanism embodying the CIE angular system for specifying and measuring retro-reflectors. All angles and directions of rotationare shown Positive. 21 AIS - 022/2001",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 32,
    "text": "2: Second Axis O: Observation Axis b ,b : Entrance angles 1 2 R: Reference Axis e : Rotation angle P: Retro-reflective material Representation of a Goniometer mechanism embodying the CIE angular system for specifying and measuring retro-reflectors. All angles and directions of rotationare shown Positive. 21 AIS - 022/2001 22 AIS - 022/2001 ANNEXURE 7 MINIMUM REQUIREMENTS FOR CONFORMITY OF PRODUCTION CONTROL PROCEDURES 1. GENERAL 1.1 The conformity requirements shall be considered satisfied from a mechanical and geometric standpoint, if the differences do not exceed inevitable manufacturing deviations within the requirements of this Standard. 1.2 With respect to photometric performances, the conformity of mass- produced advance-warning triangles shall not be contested if, when testing photometric performances of any advance-warning triangle chosen at random no measured value deviates unfavourably by more than 20% from the minimum values prescribed in this Standard. 1.3 The chromaticity co-ordinates shall be complied with. 2. MINIMUM REQUIREMENTS FOR VERIFICATION OF CONFORMITY BY THE MANUFACTURER For each type of advance-warning triangle the holder of the approval shall carry out at least the following tests, at appropriate intervals. The tests shall be carried out in accordance with the provisions of this Standard. If any sampling shows nonconformity with regard to the type of test concerned, further samples shall be taken and tested. The manufacturer shall take steps to ensure the conformity of the production concerned. 2.1 Nature of Tests Tests of conformity in this Standard shall cover the photometric and colorimetric characteristics and the resistance to penetration of water. 2.2 Methods Used in Tests 2.2.1 Tests shall generally be carried out in accordance with the methods set out in this Standard. 2.2.2 In any test of conformity carried out by the manufacturer, equivalent methods may be used with the consent of the Test Agency responsible for approval",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 33,
    "text": "of water. 2.2 Methods Used in Tests 2.2.1 Tests shall generally be carried out in accordance with the methods set out in this Standard. 2.2.2 In any test of conformity carried out by the manufacturer, equivalent methods may be used with the consent of the Test Agency responsible for approval tests. The manufacturer is responsible for proving that the applied methods are equivalent to those laid down in this Standard. 2.2.3 The application of Paragraphs 2.2.1 and 2.2.2. requires regular calibration of test apparatus and its correlation with measurements made by a competent authority. 23 AIS - 022/2001 2.2.4 In all cases the reference methods shall be those of this Standard, particularly for the purpose of administrative verification and sampling. 2.3 Nature of Sampling Samples of advance-warning triangles shall be selected at random from the production of a uniform batch. A uniform batch means a set of advance- warning triangles of the same type, defined according to the production methods of the manufacturer. The assessment shall in general cover series production from individual factories. However, a manufacturer may group together records concerning the same type from several factories, provided these operate under the same quality system and quality management. 2.4 Measured and Recorded Photometric Characteristics The sampled advance-warning triangle shall be subjected to photometric measurements at the points and the chromaticity co-ordinates provided for in this Standard . 2.5 Criteria Governing Acceptability The manufacturer is responsible for carrying out a statistical study of the test results and for defining, in agreement with the test agency, criteria governing the acceptability of his products in order to meet the specifications laid down for verification of conformity of products in Paragraph 11.1 of this Standard . 24 AIS - 022/2001 ANNEXURE-8 (see Introduction) COMMITTEE COMPOSITION Automotive Industry Standards Committee Chairman Shri. B. Bhanot",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 34,
    "text": "agreement with the test agency, criteria governing the acceptability of his products in order to meet the specifications laid down for verification of conformity of products in Paragraph 11.1 of this Standard . 24 AIS - 022/2001 ANNEXURE-8 (see Introduction) COMMITTEE COMPOSITION Automotive Industry Standards Committee Chairman Shri. B. Bhanot Director, The Automotive Research Association of India, Pune. Members Representing Shri. Alok Rawat . Ministry of Road Transport & Highways, New Delhi. Shri. V.C. Mathur Department of Heavy Industry, Ministry of Industries & Public Enterprises, New Delhi. Shri. G. S. Kashyab Office of the Development Commissioner Shri. M.K. Bhat (Alternate ) Small Scale Industries, Ministry of Industry, New Delhi. Shri. A. R. Gulati Bureau of Indian Standards. Shri. R. C. Sethi Vehicle Research & Development Establishment, Shri. N. Karuppaiah ( Alternate ) Ahmednagar. Shri. D. G. Shirke Central Institute of Road Transport, Pune. Shri. P. C. Barjatia ( Alternate ) Shri. R. M. Srivastava Society of Indian Automobile Manufacturers. Shri. T. M. Balaraman Society of Indian Automobile Manufacturers. Shri. I. V. Rao Society of Indian Automobile Manufacturers. Shri. Z. A. Mujawar ( Alternate ) Society of Indian Automobile Manufacturers. Shri. Vivek Adyanthaya (Alternate ) Society of Indian Automobile Manufacturers. Shri. U. K. Kini ( Alternate ) Society of Indian Automobile Manufacturers. Shri. T. C. Gopalan Tractor Manufacturers Association, New Delhi. Shri. Vishnu Mathur Automotive Components Manufacturers Association. Shri. K. N. D. Nambudiripad Automotive Components Manufacturers Association. Member Secretary Mrs. Rashmi Urdhwareshe Sr. Assistant Director, The Automotive Research Association of India, Pune 25",
    "region": "Unknown"
  },
  {
    "pdf_file": "AIS_022.pdf",
    "chunk_index": 35,
    "text": "Pune 25",
    "region": "Unknown"
  }
]