{
  "chunks": [
    {
      "chunk_id": "768788600fec16f5b240a024b6f13fac3eeefd3eb2b5c149ef01881ee97118f9",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 0,
      "text": "AMENDMENT NO. 2 10 April 2015 TO AIS 021/ 2004 Field of Vision of Motor Vehicle Drivers for M1 Category Page I and page 1/22, Title of the standard Substitute the following title for existing title. “Field of Vision of Motor Vehicle Drivers for M1 and L7-M Category.” Page No 1/22, clause 1.1 Substitute the following text for existing text. “1.1 This standard applies to the 180° forward field of vision of the drivers of vehicles in category M1 and L7-M » Page No 1/22, clause 1.2 Substitute the following text for existing text. “1.2 The requirements of this standard are so worded as to apply to category M1 and L7-M vehicles in which the driver is on the right.” PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P. B.NO. 832, PUNE 411 004 ON BEHALF OF AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLES RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF ROAD TRANSPORT & HIGHWAYS (DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS) GOVERNMENT OF INDIA 10 April 2015 AMENDMENT NO. 1 TO AIS-021/2004 Field of Vision of Motor Vehicle Drivers for M1 Category 1.0 Page No. 4/22 clause 3.1.3 Substitute following text for existing text: Except as provided in 3.1.3.1 or 3.1.3.2., other than the obstructions created by the A pillars, the fixed or movable vent or side window division bars, outside radio aerials, rear-view mirrors and windscreen wipers, there should be no obstruction in the driver’s 180° forward direct field of vision below a horizontal plane passing through V1, and above three planes through V2, one being perpendicular to the plane X-Z and declining forward 4° below the horizontal, and the other two being perpendicular to the plane Y-Z and declining 4° below the horizontal (Annexure II , figure 5).\" The following are not considered to be",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "c2457b8e9c389b9f2f818ad4a760f58c19def63fcc0449aab5fe079dc67a7ec9",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 1,
      "text": "through V1, and above three planes through V2, one being perpendicular to the plane X-Z and declining forward 4° below the horizontal, and the other two being perpendicular to the plane Y-Z and declining 4° below the horizontal (Annexure II , figure 5).\" The following are not considered to be obstruction to the field of vision. - embedded or printed “radio aerial” conductors no wider than the following: - embedded conductors 0.5 mm. - printed conductors 1.0 mm. These “radio aerial” conductors shall not cross zone A, as defined in AIS-019. However three “ radio aerial” conductors may cross zone \"A\" if their width does not exceed 0.5 mm. - within zone A “defrosting/demisting™ conductors, normally in zigzag or sinusoidal formal having the following dimensions : - Maximum visible width 0.030 mm - Maximum conductor density: - If the conductors vertical: 8/cm - If the conductors are horizontal: 5/cm. 3131 An obstruction created by the steering-wheel rim and the instrument panel inside the steering wheel will be tolerated if a plane through V2, perpendicular to the plane x -z and tangential to the highest part of the steering-wheel rim,is declined at least 1° below the horizontal. The steering wheel, if adjustable, shall be placed in the normal position indicated by the manufacturer or, failing that, midway between the limits of its range(s) of adjustment.” 3132 An obstruction between a plane through V2, and declined at least 1° below the horizontal and a plane through V2 and declined 4° below the horizontal will be tolerated if the conical projection of this obstruction, starting from V2, on an area \"S\" as defined in paragraph 3.1.3.2.1. does not exceed 20 per cent of this area. The steering wheel, if adjustable, shall be placed in the normal position indicated by the manufacturer or, failing",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "f7efe0339288e2409ebd9154e65285990567f180a3ba3ab89a248805cd16bf90",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 2,
      "text": "horizontal will be tolerated if the conical projection of this obstruction, starting from V2, on an area \"S\" as defined in paragraph 3.1.3.2.1. does not exceed 20 per cent of this area. The steering wheel, if adjustable, shall be placed in the normal position indicated by the manufacturer or, failing that, midway between the limits of its range(s) of adjustment.\" 31321 The area \"S\" (see Annexure II, figure 8) is a rectangular vertical area located in a plane perpendicular to the X coordinate 1500 mm forward of the point V2. The upper edge of the area \"S\" is defined by a plane passing through V2 declined forward 1° below the horizontal. The lower edge of the area 'S' is defined by a plane passing through V2 declined forward 4° below the horizontal. The left and right edges of the area \"S\" are vertical and generated from the intersection lines of the three planes declined 4° as defined in paragraph 3.1.3. above. 3.1.3.2.2. In the case of a windscreen extending beyond 1500 mm forward of the point V2, the distance between the area \"S\" and the point V2 may be extended accordingly. 2.0 Page No. 21/22,Annexure IT Add Figure 8 as follows after Figure 7 Upper edge of [ 1 s thearea\"s\" Right edge - | Intersection lines of the three Lower ed‘g‘e of Left edge planes passing through V, the area's 1500 mm windscreen Area « S» v2 = — e Plane 1° / N Plane 4° Figure 8 Definition of the area \"S\" (Paragraph 3.1. PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P.B.NO. 832, PUNE 411 004 ON BEHALF OF AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF ROAD TRANSPORT & HIGHWAYS (DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS) GOVERNMENT",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "7b988fcc459b2419de695fe48e21c85a44a35602f46545a8c675b45c3bf19f8d",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 3,
      "text": "of the area \"S\" (Paragraph 3.1. PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P.B.NO. 832, PUNE 411 004 ON BEHALF OF AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF ROAD TRANSPORT & HIGHWAYS (DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS) GOVERNMENT OF INDIA October 2011 AUTOMOTIVE INDUSTRY STANDARD Field of Vision of Motor Vehicle Drivers for M1 Category PRINTED BY THE AUTOMOTIVE RESEARCH ASSOCIATION OF INDIA P.B.NO. 832. PUNE 411 004 ON BEHALF OF AUTOMOTIVE INDUSTRY STANDARDS COMMITTEE UNDER CENTRAL MOTOR VEHICLE RULES - TECHNICAL STANDING COMMITTEE SET-UP BY MINISTRY OF SHIPPING, ROAD TRANSPORT & HIGHWAYS (DEPARTMENT OF ROAD TRANSPORT & HIGHWAYS) GOVERNMENT OF INDIA December 2004 Status chart of the Standard to be used by the purchaser for updating the record Sr. Corr- Amend- Revision Date Remark Misc. No. igenda. ment General remarks: I INTRODUCTION The Government of India felt the need for a permanent agency to expedite the publication of standards and development of test facilities in parallel when the work on the preparation of the standards is going on, as the development of improved safety critical parts can be undertaken only after the publication of the standard and commissioning of test facilities. To this end, the erstwhile Ministry of Surface Transport (MOST) has constituted a permanent Automotive Industry Standard Committee (AISC) vide order No. RT-11028/11/97-MVL dated September 15, 1997. The standards prepared by AISC will be approved by the permanent CMVR Technical Standing Committee (CTSC). After approval, the Automotive Research Association of India, (ARAI), Pune, being the secretariat of the AIS Committee, has published this standard. For better dissemination of this information ARAI may publish this document on their Web site. An unobstructed forward field of vision of a automotive vehicle driver ensure safe driving and enhance safety",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "9d1d09df560ec0be27781919765792ba4621b9b9934bf5c312035aca2293831c",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 4,
      "text": "Automotive Research Association of India, (ARAI), Pune, being the secretariat of the AIS Committee, has published this standard. For better dissemination of this information ARAI may publish this document on their Web site. An unobstructed forward field of vision of a automotive vehicle driver ensure safe driving and enhance safety of other road users as well. The importance of the subject in the heterogeneous traffic condition in India was understood and in the process of harmonization of Indian Standards with ECE regulations, this subject was identified for formulation of AIS. The purpose of this standard is to ensure an adequate field of vision in all circumstances (when the windscreen and other glazed surfaces are dry and clean). This standard addresses the requirements and measurement procedure of driver’s forward field of vision of M1 category of vehicles considering obstructions such as instrument panel, steering wheel, mirror, vehicle structure supporting roof like “A” and “B” pillars etc. The requirements for four wheeled vehicles other than M1 category of vehicles is under discussion ( Draft AIS-032). As there is no ECE regulation on this subject, in preparation of this AIS considerable assistance is drawn from EEC Directive 77/649/EEC as amended by Directives 81/643/EEC, 88/366/EEC and 90/630/EEC — “ On the approximation of the laws of the member states relating to the field of vision of motor vehicle drivers ” The Automotive Industry Standards Committee responsible for preparation of this standard is given in Annexure - I I AIS- 021 Field of Vision of Motor Vehicle Drivers for M1 Category 1.0 SCOPE 11 This standard applies to the 180° forward field of vision of the drivers of vehicles in category M;. Its purpose is to ensure an adequate field of vision when the windscreen and other glazed surfaces are dry and clean. 12 The",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "a905abe200b617ec7be24c0acb2386f981e566ad56e8199e4d8adaba5989115c",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 5,
      "text": "Motor Vehicle Drivers for M1 Category 1.0 SCOPE 11 This standard applies to the 180° forward field of vision of the drivers of vehicles in category M;. Its purpose is to ensure an adequate field of vision when the windscreen and other glazed surfaces are dry and clean. 12 The requirements of this standard are so worded as to apply to category M1 vehicles in which the driver is on the right. 2.0 DEFINITIONS 21 Vehicle type with regard to the field of vision “Vehicle type with regard to the field of vision” means vehicles which do not differ in such essential respects as: The external and internal forms and arrangements within the area specified in Clause 1.0 which may affect visibility, and The shape and dimension of the windscreen and its mounting. Three-dimensional reference grid “Three-dimensional reference grid” means a reference system which consists of a vertical longitudinal plane X-Z, a horizontal plane X-Y and a vertical transverse plane Y-Z, the grid is used to determine the dimensional relationships between the position of design points on drawing and their position on the actual vehicle. The procedure for situating the vehicle relative to the gird is specified in Annexure II all coordinates referred to ground zero shall be based on the vehicle in running order plus one front-seat passenger, the mass of the passenger being 75kg+ 1 %. 221 Vehicles fitted with suspension enabling their ground clearance to be adjusted shall be tested under the normal conditions of use specified by the vehicle manufacturer. 23 Primary reference marks “Primary reference marks” means holes, surfaces, marks, and identification signs on the vehicle body. The type of reference marks used and the position of each mark relative to the XY, and Z coordinates of the three dimensional reference grid and to a",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "36c90510b41285d63cf16b0c19f532d6a2d9963b51ab29680cc75e8d3122dfad",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 6,
      "text": "by the vehicle manufacturer. 23 Primary reference marks “Primary reference marks” means holes, surfaces, marks, and identification signs on the vehicle body. The type of reference marks used and the position of each mark relative to the XY, and Z coordinates of the three dimensional reference grid and to a design ground plane shall be specified by the vehicle manufacturer. These marks may be the control points used for body-assembly purpose; 24 Actual seat back angle Actual seat back angle means the angle measured between a vertical line through the “H” point and the torso line using the back angle quadrant of the 3 DH machine. The actual torso angle corresponds theoretically to the design torso angle. 25 Design seat back angle “Design seat back angle means the angle measured between a vertical line through the “R” point and the torso line in a position which corresponds to the design position of the seat-back established by the vehicle manufacturer. 2.6 V Points “V points” means points whose position in the passenger compartment is determined as a function of vertical longitudinal plane passing through the centers of the outermost designated seating positions on the front seat and in relation to the \"R\" point and the design angle of the seat-back, which points are used for verifying compliance with the field of vision requirements. 27 R point or seating reference point R point or seating reference point means a design point defined by the vehicle manufacturer for each seating position and established with respect to the three-dimensional reference system. 28 H point H point means the pivot center of the torso and thigh of the 3 DH machine installed in the vehicle seat in a accordance with AnnexIu prarea. 4. The “H” point is located in the center of the centerline of",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "9ed2d8516904cfa3e4d68ea2408daaf2e0275970cf88cb622fd1213217ad259d",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 7,
      "text": "with respect to the three-dimensional reference system. 28 H point H point means the pivot center of the torso and thigh of the 3 DH machine installed in the vehicle seat in a accordance with AnnexIu prarea. 4. The “H” point is located in the center of the centerline of the device whichis between the “H” point sight button on either side of the 3 DH machine. The “H” point corresponds theoretically to the “R” point. 29 ‘Windscreen datum points “Windscreen datum points” means points situated at the intersection with the windscreen of lines radiating forward from the V points to the outer surface of the windscreen. 2.10 Transparent area “Transparent area” means that area of a vehicle windscreen or other glazed surface whose light transmittance measured at right angle of the surface, is not less than 70%. 211 P points “P points” means the points about which the driver’s head rotates when he views objects on a horizontal plane at eye level. 212 E points “E points” means points representing the centers of the driver’s eyes and used to assess the extent to which A pillar obscure the field of vision. 213 A pillar “A pillar” means any roof support forward of the vertical transverse plane located 68 mm in front of the V points and includes non- transparent items, such as windscreen mouldings and door frames, attached or contiguous to such a support. 2.14 Horizontal seat-adjustment range “Horizontal seat-adjustment range” means the range of normal driving positions designated by the vehicle manufacturer for the adjustment of the driver’s seat in the direction of the X axis. 2.15 Extended seat adjustment range “Extended seat adjustment range” means the range designated by the vehicle manufacturer for the adjustment of the seatin the direction of the X axis beyond the range",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "dbb4356bc706a131ca84afd77f2e50eda3e5b70db4256a3d66777f5f27f9d07a",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 8,
      "text": "by the vehicle manufacturer for the adjustment of the driver’s seat in the direction of the X axis. 2.15 Extended seat adjustment range “Extended seat adjustment range” means the range designated by the vehicle manufacturer for the adjustment of the seatin the direction of the X axis beyond the range of the normal driving position specified in 2.14 and used for converting seats into beds or facilitating entry into the vehicle. 3.0 SPECIFICATIONS 31 Driver’s field of vision The transparent area of the windscreen must include at least the windscreen datum points; these are: A horizontal datum point forward of V1 and 17°to the right. An upper vertical datum point forward of V1 and 7° above the horizontal. 3113 A lower vertical datum point forward of V2 and 5° below the horizontal. 3114 To verify compliance with the forward-vision requirement on the opposite half of the windscreen, three additional datum points, symmetrical to the points definedin 3.1.1.1 to 3.1.1.3 in relation to the median longitudinal plane of vehicle are obtained. The angle of obstruction of each “A” pillar, as described in point 3.1.2.1 shall not exceed 6° (Annexure II, Figure 3) The angle of obstruction of each “A” pillar on the passenger side, as describeidn point 3.1.2.1.2, need not be determined if the two pillars are located symmetrically in relation to the median longitudinal vertical plane of the vehicle. 3121 The angle of obstruction of each “A” pillar shall be measured by superimposing in a plane the following horizontal sections: Section 1: Starting from the Pm point situated at the location defined in point 3.3.1.1, draw a plane forming an angle of 2° upwards in relation to the horizontal plane passing forward through Pm. Determine the horizontal section of the “A” pillar starting from the foremost point of the intersection",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "ef8d4a056e0e251d852bcf5528fd19a56adb9c03df6a3daedba0f9cc847c81bb",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 9,
      "text": "Section 1: Starting from the Pm point situated at the location defined in point 3.3.1.1, draw a plane forming an angle of 2° upwards in relation to the horizontal plane passing forward through Pm. Determine the horizontal section of the “A” pillar starting from the foremost point of the intersection of the “A” pillar and the inclined plane. Section 2 : Repeat the same procedure, taking a plane at an angle of 5° downwards in relation to the horizontal plane passing forward through Pm. (Annexure II, Figure 2) 31211 The angle of obstruction of the “A” pillar on the driver’s side is the angle formed on the plane view by a parallel, starting from E2, to the tangent joining E1 with the outer edge of section S2 and the tangent joining E2 with the inner edge of section SI. ( Annexure II, Figure 3) 31212 The angle of obstruction of the “A” pillar on the passenger side is the angle formed on the plane view by the tangent joining E3, to the inner edge of section S1 and a parallel, starting from E3, to the tangent joining E4 to the outer edge of section S2 (Annexure II, Figure 3) 3122 No vehicles shall have more than two “A” pillars. Other than the obstructions created by the “A” pillars, the fixed or movable vent or side window division bars, outside radio aerials, rear-view mirrors and the windscreen wipers, there should be no obstruction in the driver’s 180° forward direct field of vision below a horizontal plane passing through VI, and above three planes through V2, one being perpendicular to the plane X-Z and declining forward 4° below the horizontal and the other two being perpendicular to the plane Y-Z and declining 4° below the horizontal. (Annexure II, Figure 5) The following",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "f1733cac33c89980f0c81238b17b79b44599b0a320bc2dbb25b88aa5e42eaeb0",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 10,
      "text": "vision below a horizontal plane passing through VI, and above three planes through V2, one being perpendicular to the plane X-Z and declining forward 4° below the horizontal and the other two being perpendicular to the plane Y-Z and declining 4° below the horizontal. (Annexure II, Figure 5) The following are not considered to be obstruction to the field of vision. - embedded or printed “radio aerial” conductors no wider than the following: - embedded conductors 0.5 mm. - printed conductors 1.0 mm. These “radio aerial” conductors shall not cross zone A, as defined in AIS 019. However three “ radio aerial” conductors may cross zone \"A\" if their width does not exceed 0.5 mm. - within zone A “defrosting/demisting” conductors, normally in zigzag or sinusoidal formal having the following dimensions: - Maximum visible width 0.030 mm - Maximum conductor density: - If the conductors vertical: 8/cm - If the conductors are horizontal : 5/cm. 3131 An obstruction created by the steering-wheel rim and the instrument panel inside the steering wheel will be tolerated if a plane through V2, perpendicular to the plane X-Z and tangential to the highest part of the steering-wheel rim, is declined at least 1° below the horizontal. 32 Position of the V points 321 The positions of the V points in relation to the R points, as indicated by XYZ coordinates from the three-dimensional reference grid, are as shown in Tablel and IV. 3211 TableI indicates the basic coordinates for a design seat back angle of 25°. The positive direction for the coordinates is indicated in (Annexure II, Figure 1) TABLE I V-Point X Y z V1 68 mm -Smm 665 mm V2 68 mm -5 mm 589 mm 33 Position of the P points 331 The position of the P points in relation to",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "34f512f8f75073226e78302c22b7057f13358485ee796b34d141c847c4231d11",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 11,
      "text": "of 25°. The positive direction for the coordinates is indicated in (Annexure II, Figure 1) TABLE I V-Point X Y z V1 68 mm -Smm 665 mm V2 68 mm -5 mm 589 mm 33 Position of the P points 331 The position of the P points in relation to the R point, as indicated by the XYZ coordinates from the three-dimensional reference grid, as shown by Tables II, III and IV. 3311 Table II sets out the basic coordinates for a design seat-back angle of 25° The positive direction of the coordinates is set out in (Annexure II, Figure 1) The Pm point is the point of intersection between the straight P1, P2 and the longitudinal vertical plane passing through the \"R\" point. TABLE II Point P X Y z P1 35 mm +20 mm 627 mm P2 63 mm -47 mm 627 mm Pm 43.36 mm 0 627 mm 3312 Table III indicates further corrections to be made to the X coordinates to Pl and P2 when the horizontal seat adjustment range as defined in 2.14 exceeds 108 mm. The positive direction for the coordinates is indicated in Annexure II, Figure 1. TABLE III Horizontal seat-adjustment range AX 108 to 120 mm -13 mm. 121 to 132mm -22 mm 133 to 145mm -32 mm 146 to 158 mm -42 mm more than 158 mm - 48mm. 34 Correction for design seat-back angles other than 25° Table IV indicates the further corrections to be made to the X andZ coordinates of each P point and each \"V\" point when the design seat-back angle isnot 25°. (Annexure II, Figure 1) TABLE IV Seat- Horizontal Vertical Seat-back | Horizontal | Vertical back coordinates | coordinates | angle coordinates | coordinates angle AX AZ (in °) AX AZ (in°) 5 -186 mm",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "19dde331079d24ee78831f485f1dd243536653056cd8a9e3e895e3c5a6d076d2",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 12,
      "text": "coordinates of each P point and each \"V\" point when the design seat-back angle isnot 25°. (Annexure II, Figure 1) TABLE IV Seat- Horizontal Vertical Seat-back | Horizontal | Vertical back coordinates | coordinates | angle coordinates | coordinates angle AX AZ (in °) AX AZ (in°) 5 -186 mm 28 mm 25 0 mm 0 6 -177mm 27 mm 26 9 mm -3 mm 7 -167 mm 27 mm 27 17 mm -5mm 8 -157 mm 27 mm 28 26 mm -8 mm 9 -147 mm 26 mm 29 34 mm -11 mm 10 -137 mm 25 mm 30 43 mm -14 mm 11 -128 mm 24 mm 31 51 mm -18 mm 12 -118 mm 23 mm 32 59 mm -21 mm 13 -109 mm 22 mm 33 67 mm -24 mm 14 -99 mm 21 mm 34 76 mm -28 mm 15 -90 mm 20 mm 35 84 mm -32 mm 16 -81 mm 18 mm 36 92 mm -35 mm 17 -72 mm 17 mm 37 100 mm -39 mm 18 -62 mm 15 mm 38 108 mm -43 mm 19 -53 mm 13 mm 39 115 mm -48 mm 20 -44 mm 11 mm 40 123 mm -52 mm 21 -35 mm 9 mm 22 -26 mm 7 mm 23 -18 mm 5 mm 24 -9 mm 3 mm 35 Positions of the E points 351 El and E2 are each 104 mm from P1. E2 is 65 mm from El 352 The straight line joining El and E2 is rotated about Pl until the tangent joining E1 to the outer edge of section 2 of the A-pillar on the driver’s side is normal to the straight line E1 - E2. 353 E3 and E4 are each 104 mm apart from P2. E3 is 65mm",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "31160cd6110d23a8468dd29518e6f1aa4f64dbb56967c2e058c1e864a1b29c9f",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 13,
      "text": "joining El and E2 is rotated about Pl until the tangent joining E1 to the outer edge of section 2 of the A-pillar on the driver’s side is normal to the straight line E1 - E2. 353 E3 and E4 are each 104 mm apart from P2. E3 is 65mm from E4. 354 The straight line E3-E4 is rotated about P2 until the tangent joining E4 to the outer edge of Section 2 of the A-pillar on the passenger’s side is normal to the straight line E3 - E4. ( Annexure-II, Figure 4) 4.0 TEST PROCEDURE 4.1 Driver’s field of Vision 4.1.1 The dimensional relationship between the vehicles primary reference marks and the three-dimensional reference grid shall be determined by the procedure prescribed in Annexure II. The position of the points V1 and V2 are determined in relation to the R point as indicated by XYZ coordinates from the three-dimensional reference grid and shown in Table I under 32.1.1and Table IV under 3.4. The windscreen datum points shall then be found from the corrected V-points as prescribed in 3.1.1 The relationship between the P points, the R point, and the centre- line of the driver’s seating position, as indicated by XYZ coordinates from the three-dimensional reference grid, shall be determined from Table IT in 3.3. The correction for design seat-back angles other than 25°is shown in Table IV under 3.4. The angle of obstruct(i osene 3.1.2) shall be measured in the inclined planes as indicated in Annexure II, Figure 2).The relationship between Pl and P2, which are connected to El1 and E2 and E3 and E4 respectively, 4.1.41 Straight line E1 —E2 shall be set as described in 3.5.2. The angle of obstruction of the A-pillar on the driver’s side shall then be measured as specified in 3.1.2.1.1. 4142 Straight",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "65365b1c5520d52ccd939e30acea21a9cd5cee64fdd7a54bba8f132829cdcff1",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 14,
      "text": "relationship between Pl and P2, which are connected to El1 and E2 and E3 and E4 respectively, 4.1.41 Straight line E1 —E2 shall be set as described in 3.5.2. The angle of obstruction of the A-pillar on the driver’s side shall then be measured as specified in 3.1.2.1.1. 4142 Straight line E3 —E4 shall be set as described in 3.5.4. The angle of obstruction of the A-pillar on the passenger side shall then be measured as specified in point 3.1.2.1.2 ANNEXURE :1 PROCEDURE FOR DETERMINING THE “H” POINT AND THE ACTUAL TORSO ANGLE FOR SEATING POSITIONISN THE MOTOR VEHICLES 1.0 PURPOSE The procedure described in this Annexure is used to establish the “H” point location and the actual torso angle for one or several seating positions in a motor vehicle and to verify the relationship of measured data to design specifications given by the vehicle manufacturer. 2.0 DEFINITIONS For the purpose of this Annexure. 21 “Reference data” means one or several of the following characteristics of a seating position: 211 The “H” point and the “R” point and their relationship; 212 The actual torso angle and the design torso angle and their relationship 22 “Three-dimensional ‘H’ point machine” ( 3 DH machine) means the device used for the determination of “H” points and actual torso angles. 23 “Hpoint” means the pivot centre of the torso and thigh of the 3 DH machine installed in the vehicle seat in a para. 4 of this Annexure. The “H” point is located in the centre of the centerline of the device whichis between the “H” point sight button on either side ofthe 3 DH machine. The “H” point corresponds theoretically to the “R” point. Once determined in accordance with the procedure described in paragraph 4 , the “H” point is considered fixed in",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "bde2f14a98770c9723ed6b3d26030af3bc8cb4cbb904c183e8144a7a47e9cdb6",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 15,
      "text": "the centre of the centerline of the device whichis between the “H” point sight button on either side ofthe 3 DH machine. The “H” point corresponds theoretically to the “R” point. Once determined in accordance with the procedure described in paragraph 4 , the “H” point is considered fixed in relation to the seat-cushion structure and to move with it when the seat is adjusted. 24 \"R\" point or seating reference point means a design point defined by the vehicle manufacturer for each seating position and established with respect to the three-dimensional reference system. 25 “Torso-line” means the centerline of the probe of the 3 DH machine with the probe in the fully rearward position; 2.6 Actual seat back angle ( Actual torso angle) means the angle measured between a vertical line through the “H” point and the torso line using the back angle quadrant of the 3 DH machine. The actual torso angle corresponds theoretically to the design torso angle. 27 “Design seat back ang( Dlesiegn torso angle) means the angle measured between a vertical line through the “R” point and the torso line in a position which corresponds to the design position of the seat-back established by the vehicle manufacturer 28 “Centreplane of occupant” (C/LO) means the median plane of the 3DH machine positioned in each designated seating position; it is represented by the co-ordinate to the “H”point on the “Y” axis. For individual seats, the centre plane of the seat coincides with the centre plane of the occupant. For other seats, the centre plane of the occupant is specified by the manufacturer. 29 “Three dimensional reference system” means a system as described in Appendix II of this Annexure. 2.10 “Fiducial marks” are physical points (holes, surfaces, marks or indentations) on the vehicle body as defined by the",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "ceee9875aeb922f31827445f87c74b30adfdb9d6043762bd10673ad75f358311",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 16,
      "text": "occupant. For other seats, the centre plane of the occupant is specified by the manufacturer. 29 “Three dimensional reference system” means a system as described in Appendix II of this Annexure. 2.10 “Fiducial marks” are physical points (holes, surfaces, marks or indentations) on the vehicle body as defined by the manufacturer. 211 “Vehicle measuring attitude” means the position of the vehicle as defined by the co-ordinates of fiducial marks in the three-dimensional reference system. 3.0 REQUIREMENTS 31 Data presentation For each seating position where reference data are required in order to demonstrate compliance with the provision of the present standard all or an appropriate selection of the following data shall be presented. The coordinates of the “R” point relative to the three-dimensional reference system; 312 The design torso angle 313 All indications necessary to adjust the seat (if it is adjustable) to the measuring position set out in item 4.3 below 32 Relationship between measured data and design specifications 321 The coordinates of the “H” point and the value of the actual torso angle obtained by the procedure set out in para. 4 below shall be compared, respectively with the coordinates of the “R” point and the value of the design torso angle indicated by the vehicle manufacturer. 322 The relative positions of the “R” point and the “H” point and the relationship between the design torso angle and the actual torso angle shall be considered satisfactory for the seating position in question if the “H” point, as defined by is coordinates, lies within a square of 50mm side length with horizontal and vertical side whose diagonals intersect at the “R” point, and if the actual torso angle is within 5° of the design torso angle. 323 If these conditions are met, the “R” point and the design torso angle",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "63145a797440b6e98559378c36bef29a39192b7e6c276a6d7d485374a90e4675",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 17,
      "text": "is coordinates, lies within a square of 50mm side length with horizontal and vertical side whose diagonals intersect at the “R” point, and if the actual torso angle is within 5° of the design torso angle. 323 If these conditions are met, the “R” point and the design torso angle shall be used to demonstrate compliance with the standard. 324 If the “H” point or the actual torso angle does not satisfy the requirements of item 3.2.2 above, the “H” point and the actual torso angle shall be determined twice mo(r theree times in all). If the results of two of these three operations satisfy the requirements the conditions of item 3.2.2 above shall apply. 325 If the results of at least two of all the three operations described in 3.2.4 above do not satisfy the requirements of item 3.2.2 above, or if the verification cannot take place because the vehicle manufacturer has failed to supply information regarding the position of the “R” point or regarding the design torso angle, the centered of the three measured points or the average of the three measured angles shall be used and be regarded as applicable in all cases where the “R” point or the design torso angle. 4.0 PROCEDURE FOR “H” POINT AND ACTUAL TORSO ANGLE DETERMINATION 4.1 The vehicle shall be preconditioned at the manufacturer’s discretion, at a temperature of 30 +3°C to ensure that the seat material reaches room temperature. If the seat to be checked has never been sat upon, a 70 to 80 kg person or device shall sit onthe seat twice for one minute to flex the cushionand back. At the manufacturer’s request all seat assemblies shall remain unloaded for a minimum period of 30 minutes prior to installation of the 3 DH machine. 42 The vehicle",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "f887b964a5636b509d27174c627c80173e3cd7186380a82a84c4b40434729a4e",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 18,
      "text": "upon, a 70 to 80 kg person or device shall sit onthe seat twice for one minute to flex the cushionand back. At the manufacturer’s request all seat assemblies shall remain unloaded for a minimum period of 30 minutes prior to installation of the 3 DH machine. 42 The vehicle shall be at the measuring attitude defined in2.11 above. 43 The seat, if it is adjustable, shall be adjusted first to the rearmost normal driving or riding position, as indicated by the wvehicle manufacturer, taking into consideration only the longitudinal adjustment of the seat, excluding seat travel used for purpose other than normal driving or riding positions. Where other modes of seat adjustment exi( svertticsal, angular, seat-back, etc.) these will be then adjusted to the position specified by the vehicle manufacturer. For suspension seats, the vertical position shall be rigidly fixed corresponding to a normal driving position as specified by the manufacturer. Place the seat and back assembly of the 3 DH machine so that the centre plane of the occupant (C/LO) coincides with the centreplane of the 3DH machine. At the manufacturer’s request, the 3 DH machine may be moved inboard with respectto the C/LO if the 3 DH machine is located so far outboard that the seat edge will not permit leveling of the 3 DH machine. 4.5 Attach the foot and lower leg assemblies to the seat pan assembly, either individually or by using the T-bar and lower leg assembly. A line through the “H” point sight buttons shall be parallel to the ground and perpendicular to the longitudinal centreplane of the seat. 4.6 Adjust the feet and leg positions of the 3 DH machine as follows 4.6.1 Designated seating position; driver and outside front passenger. 4.6.1.1 Both feet and leg assemblies shall be moved forward in",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "d824ee5a246c9b740631f384ef7530925a957593fb6750fc1fe25c8f550081f5",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 19,
      "text": "buttons shall be parallel to the ground and perpendicular to the longitudinal centreplane of the seat. 4.6 Adjust the feet and leg positions of the 3 DH machine as follows 4.6.1 Designated seating position; driver and outside front passenger. 4.6.1.1 Both feet and leg assemblies shall be moved forward in such a way that the feet take up natural positions on the floor, between the operating pedals if necessary. Where possible the left foot shall be located approximately the same distance to the left of the centreplane of the 3 DH machine as the right foot is to the right. The spirit level verifying the transverse orientation of the 3 DH machine is brought to the horizontal by readjustment of the seat pan if necessary or by adjusting the leg and foot assemblies towards the rear. The line passing through the “H” point sight button shall be maintained perpendicular to the longitudinal center plane of the seat. 4.6.1.2 If the left leg cannot be kept parallel to the right leg and the left foot cannot be supported by the structure move the left foot until it is supported. The alignment of the sight button shall be maintained. Apply lower leg and thigh weights and level the 3 DH machine Tilt the back pan forward against the forward stop and draw the 3 DH machine away from the seat-back using the T-bar. Reposition the 3 DH machine on the seat by one of the following methods 481 If the 3 DH machine tends to slide rearward, use the following procedure. Allow the 3 DH machine to slide rearward until a forward horizontal restraining load on the T-bar is no longer required i.e. until the seat pan contacts the seat-back. If necessary, reposition the lower leg. If the 3 DH machine does",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "6e9fb8c1f21ec67e4bca2b00b60bcb6338510405b9b8289f5960eb69e79d943c",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 20,
      "text": "machine tends to slide rearward, use the following procedure. Allow the 3 DH machine to slide rearward until a forward horizontal restraining load on the T-bar is no longer required i.e. until the seat pan contacts the seat-back. If necessary, reposition the lower leg. If the 3 DH machine does not tend to slide rearward, use the following procedure. Slide the 3 DH machine rearward by applying a horizontal rearward load to the T-bar until the seat pan contacts the seat-back. 4.9 Apply a 100 + 10N load to the back and pan assembly of the 3 DH machine at the intersection of the hip angle quadrant and the T-bar housing. The direction of the load application shall be maintained along a line passing by the above intersection to a point just above the thigh bar housing. Then carefully return the back pan to the seat-back. Care must be exercised throughout the remainder of the procedure to prevent the 3 DH machine from sliding forward. 4.10 Install the right and left buttock weights and then, alternately, the eight torso weights. Maintain the 3 DH machine level. 4.11 Take all measurements: 4.11.1 The co-ordinates of the “H” point are measured with respect to the three-dimensional reference system. 4112 The actual torso angle is read on the back angle quadrant of the 3 DH machine with the probe in its fully rearward position. 4.12 If a re-tun of the installation of the 3 DH machine is desired, the seat assembly should remain unloaded for a minimum period of 30 minutes prior to the re-run. The 3 DH machine should not be left loaded on the seat assembly longer than the time required to perform the test. 4.13 If the seats in the same row can be regarded as simi(l beancrh seat, identical",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "89907272d98124785423a362e54e4d603d39c975e7afe2128fb8b83407e817ac",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 21,
      "text": "unloaded for a minimum period of 30 minutes prior to the re-run. The 3 DH machine should not be left loaded on the seat assembly longer than the time required to perform the test. 4.13 If the seats in the same row can be regarded as simi(l beancrh seat, identical seats, etc.) only one “H” point and one “ actual torso angle” shall be determined for each row of seats. 4.13.1 In the case of the front row, the driver’s seat 4132 In the case of the rear row or rows an outer seat. APPENDIX:I DESCRIPTION OF THE THREE DIMENSIONAL “H” POINT MACHINE 1.0 BACK AND SEAT PANS The back and seat pans are constructed of reinforced plastic and metal; they stimulate the human torso and thigh and are mechanically hinged at the “H” point. A quadrant is fastened to the probe hinged at the “H” point to measure the actual torso angle. An adjustable thigh bar, attached to the seat pan, establishes the thigh centerline and serves as a baseline for the hip angle quadrant. 2.0 BODY AND LEG ELEMENTS Lower leg segments are connected to seat pan assembly at the T-bar joining the knees, which is lateral extension of the adjustable thigh bar. Quadrants are incorporated in the lower leg segment to measure knee angles. Shoe and foot assemblies are calibratetdo measure the foot angle. Two spirit levels orient the device in space. Body element weights are placed to the corresponding centres of gravity to provide seat penetration equivalent to a 76 kg male. All joints of the 3 DH machine should be checked for free movement without encountering noticeable friction. 3 DHMACHINE ELEMENTS DESIGNATION rrobe Back pan Torso weight hanger Back angle level Hip angle quadrant. Back angle Seat span. quadrant Thigh weight pad “B” point sight",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "79824be68d8d7db59c0876dd575a89431d737af730f5f6a9e7ff436f87039c8f",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 22,
      "text": "equivalent to a 76 kg male. All joints of the 3 DH machine should be checked for free movement without encountering noticeable friction. 3 DHMACHINE ELEMENTS DESIGNATION rrobe Back pan Torso weight hanger Back angle level Hip angle quadrant. Back angle Seat span. quadrant Thigh weight pad “B” point sight button “E” point T-bar joining pivot the knees Lateral level Thigh bar Xnee angle quadrant Foot angle quadrant APPENDIX: II THREE -DIMENSIONAL REFERENCE SYSTEM 1.0 The three-dimensional reference system is defined by three orthogonal plane established by the vehicle manufacturer. ( See Figure below) 20 The vehicle measuring attitude is established by positioning the vehicle on the supporting surface such that the coordinates of the fiducial marks correspond to the values indicated by the manufacturer. 30 The coordinates the “R” point and the “H” point are established in relation to the fiducial marks defined by the vehicle manufacturer. Zero Y plane (vartical longitudinal zero plane) Zero X plane {vertical transverse zero plane) +Y Zero Z plane (borizontal zera plane) Supporting surface Three-dimensional raferance aystam ANNEXURE :1I METHOD FOR DETERMINING THE RELATIONSHIPS BETWEEN THE VEHICLE’S PRIMARY REFERENCE MARKS AND THE TH- RDIMEENSIOENAL REFERENCE GRID 1.0 RELATIONSHIP BETWEEN REFERENCE GRID AND VEHICLE PRIMARY REFERENCE MARKS To verify specific dimensions on or within a vehicle submitted for type-approval in accordance with this standard, the relationship between the coordinates of the three-dimensional reference grid, which has been laid out in the initial vehicle-design state, and the positions of the primary reference marks must be established accurately so that specific points on the vehicle manufacturer’s drawings can be identified on an actual vehicle produced from those drawings. 2.0 METHOD FOR ESTABLISHING RELATIONSHIP OF REFERENCE GRID TO REFERENCE MARKS For this purpose, a ground reference plane shall be constructed which is marked with the X-X measurement",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "1dbcddb73cf4e69bf9e469a7ac53e6f7e74d2c856f3d45d842c5066cd9106dd5",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 23,
      "text": "established accurately so that specific points on the vehicle manufacturer’s drawings can be identified on an actual vehicle produced from those drawings. 2.0 METHOD FOR ESTABLISHING RELATIONSHIP OF REFERENCE GRID TO REFERENCE MARKS For this purpose, a ground reference plane shall be constructed which is marked with the X-X measurement and the Y-Y measurement. The method of achieving this is set out in Figure7 of this annexure, the reference plane beia hnargd, flat, level surface upon which the vehicle stands, and which has two measuring scales firmly fixed to its surface; these shall be graduated in millimetres, the X-X scale being not less than eight metres long, and the Y-Y scale not less than four metres long. The two scales must be set at right angles to each other as shown in Figure 7 to this Annexure. The intersection of these scales is ground zero. 3.0 EXAMINATION OF THE REFERENCE PLANE In order to provide for minor variations in the level of the reference plane or test area, it will be necessary to measure the deviations from ground zero along both thX aned Y scales atintervals of 250 mm and to record the readings obtained so that corrections can be made when checking the vehicle. 4.0 ACTUAL TEST ATTITUDE In order to provide for minor changes in suspension height, etc., it will be necessary to have available a means of bringing the primary reference marks to the correct coordinate positions relative to the design attitude before further measurements are taken. In addition, it must be possible to make minor lateral and/or longitudinal adjustments of the vehicle’s position so as to place it accurately in relation to the reference grid. 5.0 RESULTS The vehicle have been correctly placed relative to the reference grid and in its design attitude, the site of",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "f46cc183de3ac8b8f6f0d820578b0f8d9486fff7aab4967a60f2f5e94fc1cab0",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 24,
      "text": "In addition, it must be possible to make minor lateral and/or longitudinal adjustments of the vehicle’s position so as to place it accurately in relation to the reference grid. 5.0 RESULTS The vehicle have been correctly placed relative to the reference grid and in its design attitude, the site of the necessary points for studying the forward visibility requirements can be readily determined. Test methods to determine these requirements may include the use of theodolites, light sources or shadow devices, or any other method which can be shown to give equivalent results. @ 2) \" )\\ -2 a = 68 mm b = 5 mm ¢ = 589mm d = 665 mm (1) Line tracing the median longitudinal plane of the vehicle. (2) Line tracing the vertical plane passing through R (3) Line tracing the vertical plane passing through V1 and V2 Figure 1 Determination of V Points v1 Pm +R / P2 AV ™ Pm P1 S1 52 S Figure 2 Note : Figure 2 is for Left Hand Drive Vehicles. For Right Hand Drive Vehicles the mirror image shall be considered. Angle of obstruction of the A—pillar on the driver’'s side Angle of obstruction of the A-pillar on the passonger side parallel to— Figure 3 \\‘ P Figure 4 Dimensional Diagram Showing Relative Positions of E Points and P Points Figure 5 Evaluation of Obstructions in the 180° Forward Direct Field of Vision of the Driver AIS -021 Vertical median th}dIMI plane Vertical transverse plane S i; l l E l ! L ‘ q I ! < N E Horizontal plane s R N Figure 6 Three-Dimensional Reference Grid ]w Bo ySo 9 l a y Jy o ea u e l d a J4 9O} J XB U I P J u i o d [",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "8662888f65b954668769635f27902dabf6e8130be45cb9aa5098f7bace97bb12",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 25,
      "text": "l E l ! L ‘ q I ! < N E Horizontal plane s R N Figure 6 Three-Dimensional Reference Grid ]w Bo ySo 9 l a y Jy o ea u e l d a J4 9O} J XB U I P J u i o d [ B O S 8 ] E U I P I 0 0 D X T j u o u y a y j a o e | d B n o u a J e y s j g a y m 8 U } J O J B a l B } 0 } B u p p i o m a A e s | 0 } p u n o [ e u i I O 0 D ¥ a. yb uy o p n y i B u uo y p3 [ 0 1 Y a A 0 4 9 Z U) s e j 8 y p } i L a w j o N o I P U E a su u 1 3 ) u a b y e s g w _ m _ u . _ _ “ 3 0 Y o r ap u n o u b s w “”‘_.u:_m 0 } a y H eo : u 0 6 j 0 y d r “ n i_.___uzuwmr__or__w:« oB n o u a Jej a A e a | 0 } P a U O R I S O d A j a i n o s s p 4 0 p u n o i b a y u o a o B u j s s e d a u e | d | e o i u a A a u | - a u a",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "9817a596b85b6f443841f931915ad6d4301708e847523ff761d504ce3a0235cc",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 26,
      "text": "d A j a i n o s s p 4 0 p u n o i b a y u o a o B u j s s e d a u e | d | e o i u a A a u | - a u a 2 3 y } y B n o S [ @ B Y M J U O I B U = ~ m _ h fi m / v \\ m a j d 1 y a A ay} jo 9 ] 2 3 S A U } W O l w o o d b u p p i o m S a [ e d S a u a i s e y e i L s y } i y y } J O a _ w u im p i o o d A Figure 7 Level Work Space ANNEXURE : 111 (See Introduction) COMMITTEE COMPOSITION Automotive Industry Standards Committee Chairman Shri B. Bhanot Director The Automotive Research Association of India, Pune Members Representing Shri Alok Rawat Ministry of Road Transport & Highways, New Delhi Shri Sushil Kumar Department of Heavy Industry, Ministry of Heavy Industries & Public Enterprises, New Delhi Shri G. S. Kashyab Office of the Development Commissioner Shri M.K. Bhat Small Scale Industries, (Alternate) Ministry of Small Scale Industries, New Delhi Shri L. R. Singh Bureau of Indian Standards, New Delhi Shri A. S. Lakra Central Institute of Road Transport, Pune Shri D. G. Shirke (Alternate) Director Indian Institute of Petroleum, Dehra 'Dun Shri R. C. Sethi Vehicles Research & Development Establishment, Shri N. Karuppaiah Ahmednagar (Alternate) Shri Rajat Nandi Society of Indian Automobile Manufacturers Shri T.C. Gopalan Tractor Manufacturers Association, New Delhi Shri Ramakant Garg (Alternate) Shri K.N.D. Automotive Components Manufacturers Association",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    },
    {
      "chunk_id": "2ea91949f94854411987b697ce9740fd3463bd66e170ef0c2cea2d07a7f373d8",
      "pdf_file": "AIS_021.pdf",
      "chunk_index": 27,
      "text": "G. Shirke (Alternate) Director Indian Institute of Petroleum, Dehra 'Dun Shri R. C. Sethi Vehicles Research & Development Establishment, Shri N. Karuppaiah Ahmednagar (Alternate) Shri Rajat Nandi Society of Indian Automobile Manufacturers Shri T.C. Gopalan Tractor Manufacturers Association, New Delhi Shri Ramakant Garg (Alternate) Shri K.N.D. Automotive Components Manufacturers Association Nambudiripad Shri G. P. Banerji Automotive Components Manufacturers Association Member Secretary Mis. Rashmi Urdhwareshe Sr. Assistant Director The Automotive Research Association of India, Pune",
      "region": "India",
      "source": "automotive",
      "page_from": null,
      "page_to": null
    }
  ],
  "diagnostics": {
    "header_footer_removed": {
      "headers": [
        "AIS-021",
        "AIS - 021"
      ],
      "footers": []
    },
    "page_number_lines_removed": 27
  },
  "region": "India"
}