{
  "chunks": [
    {
      "chunk_id": "3e690b01a8bfd398dbe06405b206e83c3085a9602570069817e19d788eb16488",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 0,
      "text": "Hkkjrh; ekud IS 15140 : 2018 Indian Standard Lopyu okgu lqj{kk isVh ,oa — fu;a=k.k iz.kkfy;k¡ fof'kf\"V — (igyk iqujh{k.k) Automotive Vehicles — Safety Belt and Restraint Systems — Specification ( First Revision ) ICS 43.040.60 © BIS 2018 Hkkjrh; ekud C;wjks B U R E A U O F I N D I A N S T A N D A R D S ekud Hkou] 9 cgknqj'kkg T+kiQj ekxZ] ubZ fnYyh&110002 MANAK BHAVAN, 9 BAHADUR SHAH ZAFAR MARG NEW DELHI-110002 www.bis.org.in www.standardsbis.in March 2018 Price Group 11 Passive Safety Crash Protection Systems Sectional Committee, TED 29 FOREWORD This Indian Standard (First Revision) was adopted by the Bureau of Indian Standards, after the draft finalized by the Passive Safety Crash Protection Systems Sectional Committee had been approved by the Transport Engineering Division Council. In the formulation of this standard considerable assistance has been taken from the Automotive Industries Standard, AIS-005/2000 ‘Automotive vehicles — Safety belt assemblies — Specifications (including Amendment No. 1 of May 2002)’ prepared by the Automotive Industry Standards Committee set up by the Ministry of Road Transport and Highways, Government of India. AIS-005/2000 is further based on ECE Regulation-16 ‘Safety Belts and Restraint Systems’, 2000/3/EC ‘‘Motor Vehicle Safety Belts’ and JIS:D-4604-1988 ‘Seat Belts for Automobiles’. This standard was first published in 2003. The revision to this standard has been made by taking considerable assistance of the ECE Regulation No. 16. Major changes made are to incorporate the latest technologies/designs for occupant protection namely restraint systems, airbags, etc. In this standard the following ASTM/ISO Standards have been referred to for which at present there is no parallel Indian Standard: ASTM D 2000 Standard classification system for rubber products in automotive applications ISO 105-B 02(1994/Amd2:2000) Textiles — Tests for colour fastness — colour Fastness to artificial light :",
      "region": "India"
    },
    {
      "chunk_id": "95b4092b61201915ef754e339ea1982c0d384c3aa7c8d736d276a7a8f60cff08",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 1,
      "text": "etc. In this standard the following ASTM/ISO Standards have been referred to for which at present there is no parallel Indian Standard: ASTM D 2000 Standard classification system for rubber products in automotive applications ISO 105-B 02(1994/Amd2:2000) Textiles — Tests for colour fastness — colour Fastness to artificial light : Xenon arc fading lamp test. ISO 6487 : 2015 Road vehicles — Measurement techniques in impact test — Instrumentation Seat belt is a safety item for the passengers in case of sudden deceleration and accidents. Seats and their design, mounting, etc, contribute substantially to the riding comforts of the vehicle users. Seat belts have become mandatory fitment on front seats of M and N categories of vehicles from April 1994 in India. For the purpose of deciding whether a particular requirement of this standard is complied with, the final value, observed or calculated, expressing the result of a test or analysis, shall be rounded off in accordance with IS 2 : 1960 ‘Rules for rounding off numerical values (revised)’. The number of significant places retained in the rounded off value should be the same as that of the specified value in this standard. Indian Standard AUTOMOTIVE VEHICLES — SAFETY BELT AND RESTRAINT SYSTEMS — SPECIFICATION ( First Revision ) 1 SCOPE IS No./ Title International This standard specifies the requirements of safety belt Standard assemblies and restraint systems which are designed techniques in impact tests — for installation in motor vehicles of category M, L7 Instrumentation and N as defined in IS 14272 and intended for separate ISO 17373 : 2005 Road Vehicles — Sled test use that is, as individual fittings by a person of adult built occupying forward and rearward facing seats. procedure for evaluation of occupant head and neck 2 REFERENCES interactions with seat/head restraint designs in",
      "region": "India"
    },
    {
      "chunk_id": "3e1ba760880024daa7a1fbce329f3bc1c52c8104200eeeb8f0f84cdcd4cb9141",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 2,
      "text": "in IS 14272 and intended for separate ISO 17373 : 2005 Road Vehicles — Sled test use that is, as individual fittings by a person of adult built occupying forward and rearward facing seats. procedure for evaluation of occupant head and neck 2 REFERENCES interactions with seat/head restraint designs in low speed rear The following standards contain provisions which end impacts through reference in this text, constitute provisions of this standard. At the time of publication, the editions 3 TERMINOLOGY indicated were valid. All standards are subject to For the purposes of this standard, the following terms revision, and parties to agreements based on this and definitions shall apply. standard are encouraged to investigate the possibility of applying the most recent editions of the standards 3.1 Safety Belt/Seat Belt/Belt — An arrangement of indicated below: straps with a securing buckle, adjusting devices and attachments which are capable of being anchored to IS No./ Title the interior of a motor vehicle and designed to diminish International Standard the risk of injury to the wearer in the event of collision 3400 Methods of test for vulcanized or of abrupt deceleration of the vehicle, by limiting the rubbers: mobility of the body of wearer. Such an assembly is (Part 4) : 2012 Accelerated ageing (second known as a ‘belt assembly’ the term also embraces, any revision) device for energy absorption or belt retraction. The (Part 9) : 2014 Rubber, vulcanized or arrangement can be tested and approved as a safety- Thermoplastic — Determination belt arrangement or as a restraint system.These may be of density (first revision) of following types. (Part18):1995 Stiffness at low temperature 3.1.1 Two Point (Lap) Belt (Gehman test) (first revision) 11939 : 1998 Automotive vehicles — Steering A belt which passes across the front of the pelvic lap control systems",
      "region": "India"
    },
    {
      "chunk_id": "4ed7d84a90f63a7a4cb564269e348ead6e2845795fa0434e66d290f19c7281ae",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 3,
      "text": "belt arrangement or as a restraint system.These may be of density (first revision) of following types. (Part18):1995 Stiffness at low temperature 3.1.1 Two Point (Lap) Belt (Gehman test) (first revision) 11939 : 1998 Automotive vehicles — Steering A belt which passes across the front of the pelvic lap control systems Impact protection region of the wearer and constructed so as to extend requirements and method of over the lap area from both extremities of the lap and measurements fixed at two points (see Fig. 1). These are generally 14272 : 2011 Automotive vehicles — Types — non-retracting type (static). Terminology 15139 : 2002 Automotive vehicles — Safety 3.1.2 Three Point Belt — A belt which passes diagonally belt anchorages — Specification across the front of the chest from the hip to the opposite ISO 105-B02 : Textiles — Tests for colour shoulder and intended to constrain the lap of the wearer 2013 fastness — Part B02: Colour and upper body and constructed so that a continuous fastness to artificial light: Xenon belt is fixed to a fitting at its one end and its other end, arc fading lamp test after passing over the passenger’s shoulder and then ISO 139 : 2005 Textiles — Standard atmospheres across his chest, extends over his lap area after passing for conditioning and testing through slip guide and finally terminated at the fitting ISO 3560 : 2013 Road vehicles — Frontal fixed and supported at three points (see Fig. 2). These belts barrier or pole impact test may be retracting type or non-retracting type (static). procedure ISO 6487 : 2015 Road vehicles — Measurement 3.1.3 Harness Belt — An S-type belt arrangement FIG. 1 TWO POINT TYPE SEAT BELT ASSEMBLY FIG. 2 THREE POINT TYPE SEAT BELT ASSEMBLY comprising a lap belt and shoulder straps;",
      "region": "India"
    },
    {
      "chunk_id": "b032986c5e986e3211f23da5bc76ae11c8b5a74bca314d39c7378564b8952621",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 4,
      "text": "impact test may be retracting type or non-retracting type (static). procedure ISO 6487 : 2015 Road vehicles — Measurement 3.1.3 Harness Belt — An S-type belt arrangement FIG. 1 TWO POINT TYPE SEAT BELT ASSEMBLY FIG. 2 THREE POINT TYPE SEAT BELT ASSEMBLY comprising a lap belt and shoulder straps; a harness a) A flexible load bearing element, for example, belt may be provided with an additional crotch strap cable; assembly (Fig. 3 is an example). b) A webbing; 3.1.4 S-Type Belt —A belt arrangement other than a c) A load bearing steel plate; and three-point belt or a lap belt. d) Any other element which is capable of bearing the load. 3.2 Strap/Webbing — A flexible component designed to hold the body and transmit stresses to the belt 3.4 Belt Adjusting Device — A device enabling the anchorages. belt to be adjusted to the requirement of the individual wearer and to the position of the seat. The adjusting 3.3 Buckle — A quick release device enabling the device may be part of the buckle or a retractor or any wearer to be held by the belt. The buckle head and other part of the safety belt. anchor point may be connected by any of the following four ways: 3.5 Attachments — Parts of the belt assembly FIG. 3 HARNESS TYPE SEAT BELT ASSEMBLY including the necessary securing components, which the safety belt. It has a length adjusting capability which enable it to be attached to the belt anchorages. automatically adjust the strap to the wearer and a locking mechanism actuated in an emergency by, 3.6 Energy Absorber — A device designed to disperse energy independently or jointly with the strap and a) deceleration of the vehicle (single sensitivity); forming part of a belt assembly. b) a combination of deceleration",
      "region": "India"
    },
    {
      "chunk_id": "f2202630b921fdd741e6bf9df40103d81b7b02df0af35877b2fb80de50f4d707",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 5,
      "text": "adjust the strap to the wearer and a locking mechanism actuated in an emergency by, 3.6 Energy Absorber — A device designed to disperse energy independently or jointly with the strap and a) deceleration of the vehicle (single sensitivity); forming part of a belt assembly. b) a combination of deceleration of the vehicle, movement of the webbing or any other 3.7 Retractor — A device to accommodate part or automatic means (multiple sensitivity); and the whole of the strap of a safety belt. c) ELRs may be of simple locking or webbing 3.7.1 Non-locking Retractor (Type 1) — A retractor clamp type. from which the strap is extracted to its full length by a small external force and which provides no adjustment 3.7.5 Emergency Locking Retractor with Higher for the length of the extracted strap. Response Threshold (Type 4 N) — A retractor of the type defined in 3.7.4 but having special properties for 3.7.2 Manually Unlocking Retractor (Type 2) —A use in vehicles of categories M2, M3, N1, N2 and N3 retractor requiring manual operation of a device by the as defined in 14272 (Part 1). user to unlock the retractor in order to obtain the desired strap extraction which locks automatically when the 3.7.6 Belt Adjustment Device for Height —A device operation ceases. enabling the position in height of the upper pillar loop of a belt to be adjusted according to the requirements 3.7.3 Automatically Locking Retractor (Type 3) — A of the individual wearer and the position of the seat. It retractor allowing the extraction of the strap to the may be considered as a part of the belt or the anchorage desired length and when the buckle is fastened, of the belt. automatically adjusts the strap to the wearer. Further extraction of the strap is prevented",
      "region": "India"
    },
    {
      "chunk_id": "e2bfef554c43254e98dcc4fe741134bb8b90bf6efb9f6f5c9ae93792fddfb7b2",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 6,
      "text": "of the seat. It retractor allowing the extraction of the strap to the may be considered as a part of the belt or the anchorage desired length and when the buckle is fastened, of the belt. automatically adjusts the strap to the wearer. Further extraction of the strap is prevented without deliberate 3.8 Belt Anchorage — Parts of the vehicle or seat action by the wearer. structure or any other part of the vehicle to which the safety belt assembly is to be secured. 3.7.4 Emergency Locking Retractor (ELR) (Type 4)— A retractor which during normal driving conditions does 3.9 Vehicle Type as Regards Safety Belts and not restrict the freedom of movement by the wearer of Restraint Systems — The category of motor vehicles which do not differ in parameters such as dimensions, 3.18 Locking System of the Seat — A device ensuring geometry and materials of the components of the that the seat and its parts are maintained in any position vehicle or seat structure or any other part of the vehicle of use. to which safety belts and restraint systems are attached. 3.19 Reference Zone —The space between two 3.10 Restraint System — A system for a specific vehicle vehicle longitudinal planes, 400 mm apart and type or a type defined by the vehicle manufacturer and symmetrical with reference to the H Point and defined agreed by the testing agency consisting of a seat and a by the rotation of the apparatus described in 3.27 of belt fixed to the vehicle by appropriate means and IS15139 from vertical to horizontal. The apparatus consisting additionally of all elements which are provided shall be positioned as described in the IS 15139 and to diminish the risk of injury to the wearer, in the event set to a maximum limit",
      "region": "India"
    },
    {
      "chunk_id": "3866cc71d5a006ee89efb15b0cc4f08820449004fe710589751a404b07a73366",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 7,
      "text": "fixed to the vehicle by appropriate means and IS15139 from vertical to horizontal. The apparatus consisting additionally of all elements which are provided shall be positioned as described in the IS 15139 and to diminish the risk of injury to the wearer, in the event set to a maximum limit of 840 mm. of an abrupt vehicle deceleration, by limiting the mobility 3.20 Pre-Loading Device — An additional or of the wearer’s body. integrated device which tightens the strap in order to 3.11 Seat — A structure which may or may not be reduce the slack of the belt during a crash sequence. integral with the vehicle structure complete with trim, intended to seat one adult person. The term covers both 3.21 Recessed/Enclosed Buckle Release Button — an individual seat or part of bench seat intended to seat A buckle release button such that it shall not be possible one person. to release the button using a sphere having a diameter of 40 mm. 3.11.1 Front Passenger Seat — The seat where the H Point measured in the foremost position 3.22 Non-Recessed / Non-Enclosed Buckle Release Button — A buckle release button such that it shall be of the seating position is in or in-front-of the vertical possible to release the button using a sphere having a transverse plane through the R Point of the driver. diameter of 40 mm. 3.12 Group of Seat — Either a bench type seat or seats which are separate but side by side (i.e. fixed so that 3.23 Belt Type — The belts of different types differing front seat anchorages of one of these seats are in line substantially from one another. The differences may be of rear anchorages of the other or between the with reference to any of the following parameters such",
      "region": "India"
    },
    {
      "chunk_id": "1eecb16243beea45c85799f928af598b0c06af49825d7847b4c875d9b06e7a4a",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 8,
      "text": "fixed so that 3.23 Belt Type — The belts of different types differing front seat anchorages of one of these seats are in line substantially from one another. The differences may be of rear anchorages of the other or between the with reference to any of the following parameters such anchorages of the other seat) and accommodate one or as: more seated adult persons. a) Rigid parts (buckle, attachments, retractors 3.13 Bench Seat — A structure complete with trim, etc); intended to seat at least two adults. b) The material, weave, dimensions of the straps. 3.14 Adjustment System of the Seat — A device by Colour variations alone will not be considered which the seat or its parts can be adjusted to a position a type variation where it is demonstrated that suited to the morphology of the seated occupant. This the colour variation meets the requirements device may in particular allow the following : for straps; c) The geometry of the belt assembly except a) Longitudinal displacement. where the geometry of the seat belt anchorage b) Vertical displacement. is within 50 mm distance sphere of an c) Angular displacement. approved configuration; and 3.15 Seat Anchorage — The system by which the seat d) Where the length of strap on an adjustable assembly is secured to the vehicle structure. portion of a seat belt type does not vary by more than 150 mm and/or the buckle side of a 3.16 Seat Type — A category of seats which do not seat belt type does not vary by more than 50 differ in such as: mm of an approved type, the seat belt assembly a) The structure, shape, dimensions and materials shall be regarded as the same as the approved of the seat. type. b) The type and dimensions of the",
      "region": "India"
    },
    {
      "chunk_id": "9fd6b55ac59b9cded6710047cf58aa52523c776a07cf7e45b91efcceb0c3b8ae",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 9,
      "text": "seat belt type does not vary by more than 50 differ in such as: mm of an approved type, the seat belt assembly a) The structure, shape, dimensions and materials shall be regarded as the same as the approved of the seat. type. b) The type and dimensions of the adjustment 3.24 Airbag Assembly — A device installed to system and locking systems. supplement safety belts and restraint systems in power- c) The type and dimensions of the belt anchorages driven vehicles, i.e. system which, in the event of a on the seat, the seat anchorage and the affected severe impact affecting the vehicle automatically parts of the vehicle structure. deploys a flexible structure intended to limit, by compression of the gas contained within it, the gravity 3.17 Displacement System of the Seat — A device of the contacts of one or more parts of body of an enabling the seat or one of its parts to be displaced occupant of the vehicle with the interior of the passenger angularly or longitudinally without a fixed intermediate compartment. position to facilitate passenger access. 3.25 Rearward - Facing — Facing in the direction 4.2.1.2 All parts of the belt assembly affected by opposite to the normal direction of travel of the vehicle. corrosion shall be protected against it. After the corrosion test prescribed in 5.1, neither signs of 3.26 Tension-Reducing Device — A device which is deterioration likely to impair the proper functioning of incorporated in the retractor and reduces the tension of the device nor any significant base metal corrosion shall the strap automatically when the safety- belt is fastened. be visible to the unaided eye of a qualified observer. When it is released, such a device switches off automatically. 4.2.1.3 Rigid parts intended to absorb energy or to be subjected",
      "region": "India"
    },
    {
      "chunk_id": "87eaa9e1e00a42d3532ffdebb23244e4c4c97d91ba7760ac1eb3abb128926f3c",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 10,
      "text": "of the device nor any significant base metal corrosion shall the strap automatically when the safety- belt is fastened. be visible to the unaided eye of a qualified observer. When it is released, such a device switches off automatically. 4.2.1.3 Rigid parts intended to absorb energy or to be subjected to or transmit load shall not be fragile. 4 GENERAL REQUIREMENTS 4.2.1.4 The rigid items and plastic parts of a safety 4.1 Specifications belt shall be so located and installed that, they are 4.1.1 The safety belt/vehicle manufacturer shall provide not liable to become trapped under a moveable seat all the information as detailed in Annex A to the testing or in a door of that vehicle in their daily use. If any agency for approval of the safety belt and the restraint of these items and parts do not comply with the above system. conditions, they shall be subjected to the test specified in 5.2.4. After the test, the part shall have 4.1.2 The minimum requirements for safety belt and no disassociation or fragmentation and shall function retractors for different categories of vehicles are given properly. If any visible cracks are present in any in Table 1. plastic cover or retainer of rigid item, the complete 4.1.3 The belt or restraint system shall be so designed plastic part shall then be removed and the remaining and constructed that when correctly installed and assembly shall then be assessed for its continued properly used by an occupant, its satisfactory operation security. If the remaining assembly is still secure, or is assured and it reduces the risk of body injury in event no visible cracks are present, it will then be further of an accident. assessed against the test requirements specified in4.2.2, 4.2.3 and 4.4.2. 4.1.4 The straps of the seat belt",
      "region": "India"
    },
    {
      "chunk_id": "dbc71be8e587675cd27302cf4ba841f34a7cfbab6b061b6e2b94806f9bbe2f8e",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 11,
      "text": "If the remaining assembly is still secure, or is assured and it reduces the risk of body injury in event no visible cracks are present, it will then be further of an accident. assessed against the test requirements specified in4.2.2, 4.2.3 and 4.4.2. 4.1.4 The straps of the seat belt shall not be liable to assume a dangerous configuration. 4.2.2 Buckle 4.1.5 The belt after being put on the wearer, shall either 4.2.2.1 The buckle shall be designed as to be easy to adjust automatically to fit him or be such that the manual grasp and use and preclude any possibility of incorrect adjustment device shall be readily accessible to the use. The buckle shall not have any partial latch position. seated wearer, convenient and easy to use. It shall also The procedure for opening the buckle shall be evident. allow the belt to be tightened with one hand to suit the The parts of the buckle in contact with the body of the wearer’s body size and the position of the vehicle seat. wearer shall present a section of not less than 20 cm2 4.1.6 The use of materials with properties of and 46 mm minimum in width, measured in a plane polyamide 6 as regards water retention is prohibited in situated at a maximum distance of 2.5 mm from the all mechanical parts for which such a phenomenon is contact surface. In the case of harness belt buckles, the likely to have an adverse effect on their operation. latter requirement shall be regarded as satisfied if the contact area of the buckle with the body of the wearer 4.2 Belt Components Incorporating Rigid Parts is between 20 cm2 and 40 cm2. 4.2.1 General 4.2.2.2 The buckle when not under tension shall remain 4.2.1.1 The rigid parts of the",
      "region": "India"
    },
    {
      "chunk_id": "36e0747a1d9a87586e3a2f9a8ceecd7558c2f3b5b8d2640885e4dbe6842a85dc",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 12,
      "text": "latter requirement shall be regarded as satisfied if the contact area of the buckle with the body of the wearer 4.2 Belt Components Incorporating Rigid Parts is between 20 cm2 and 40 cm2. 4.2.1 General 4.2.2.2 The buckle when not under tension shall remain 4.2.1.1 The rigid parts of the safety belt, such as buckles, closed, whatever be its position. It shall not be possible adjusting devices, attachments, etc, shall not have sharp to release the buckle inadvertently, accidentally, or with edges liable to cause wear or breakage of the straps by a force of less than 10 N. When it is not under tension chafing. and when under a maximum load of 300 N, it shall be Table 1 Requirements for Safety Belt and Retractors (Clause 4.1.2) Sl Vehicle Category as per IS 14272 Front Row Outboard All Other Seating Positions No. (1) (2) (3) (4) i) M1, N1 and M2 < 3.5 ton GVW 3 Point belt with emergency locking 2 Point or 3 Point belt with or without retractor with single/ multiple sensitivity. retractors. ii) All other vehicles of M and N Category 2 Point or 3 Point belt with or without retractors. iii) L7 3 point belt with or without retractors. 2 point or 3 point belt with or without retractors. capable of being released by the wearer with a single 4.2.3.3 When tested in accordance with 5.2.6, the force simple movement of one hand in one direction, in required to operate any manually adjusting device shall addition, in the case of belt assemblies intended to be not exceed 50 N. used for the front outboard seats, except in these harness 4.2.4 Attachments and Belt Adjustment Devices for belts, it shall also be capable of being engaged by the Height wearer with a simple movement of",
      "region": "India"
    },
    {
      "chunk_id": "77c13575a6dba1ce30c97664b999a1370c28291e7c246b42af80085f21439005",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 13,
      "text": "shall addition, in the case of belt assemblies intended to be not exceed 50 N. used for the front outboard seats, except in these harness 4.2.4 Attachments and Belt Adjustment Devices for belts, it shall also be capable of being engaged by the Height wearer with a simple movement of one hand in one direction. The buckle shall be released by pressing a The attachments shall be tested for strength as button or activating a similar device. For the buckles prescribed in 5.2.1 and 5.2.2. Belt adjustment devices with recessed-release button, the surface to which the for height shall be tested for strength as prescribed force is applied shall have an area of not less than 4.5 in5.2.2, unless they have been tested as part of the cm2 and a width of not less than 15 mm with the button vehicle anchorage systems as per IS 15139. in the release position and when projected into a plane These parts shall not break or become detached under perpendicular to the button initial direction of motion. the tension set up by the prescribed load. For non-recessed devices, the area shall not be less than 2.5 cm2 and a width of not less than 10 mm. The buckle 4.2.5 Retractors release area shall be coloured red. No other externally Retractors, other than non-locking ones, shall be subjected visible parts of the buckle shall be of this colour. When to tests and fulfil the requirements specified below, the seat is occupied, red warning light in any part of including the tests for strength prescribed in 5.2.1 and 5.2.2. the buckle is permitted if it is switched off after the occupant has buckled. 4.2.5.1 Manually unlocking retractors 4.2.2.3 The buckle shall be capable of withstanding a) The strap of a safety belt assembly equipped repeated",
      "region": "India"
    },
    {
      "chunk_id": "360f0c66f4271110c35f4dfb7c9ae5b6a9911a784089ab145a470649f60bf9ce",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 14,
      "text": "in any part of including the tests for strength prescribed in 5.2.1 and 5.2.2. the buckle is permitted if it is switched off after the occupant has buckled. 4.2.5.1 Manually unlocking retractors 4.2.2.3 The buckle shall be capable of withstanding a) The strap of a safety belt assembly equipped repeated operation and shall operate on 5 000 opening with a manually unlocking retractor shall not and closing cycles under normal conditions of use prior move more than 25 mm between the locking to dynamic test as per 5.5.2. In the case of harness belt positions of the retractor. buckles, the test may be carried out without all the b) The strap of a safety belt assembly shall extract tongues being introduced. from a manually unlocking retractor within 6 mm of its maximum length when a tension 4.2.2.4 The buckle, when tested in accordance between 14 N and 22 N is applied to the strap with5.2.3, shall operate normally. in the normal direction of pull. 4.2.2.5 The buckle shall be tested for strength as c) The strap shall be withdrawn from the retractor prescribed in 5.2.1 and where appropriate in 5.2.5. It and allowed to retract repeatedly as described shall not break or distorted or become detached when in 5.3.1 until 5 000 cycles have been subjected to the prescribed load. completed. The retractor shall then be 4.2.2.6 In the case of buckles having a component subjected to the corrosion test given in 5.1 common to the two assemblies, if the buckle of one and the dust resistance test given in 5.3.3. It assembly can be assembled in use with the mating part shall satisfactorily complete a further 5 000 of that assembly with that of other assembly, the strength cycles of withdrawal and retraction and still and release test as",
      "region": "India"
    },
    {
      "chunk_id": "affb1c54afcba4674729ee3e53c3fd842c400577244f520da5d7348d5e214259",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 15,
      "text": "buckle of one and the dust resistance test given in 5.3.3. It assembly can be assembled in use with the mating part shall satisfactorily complete a further 5 000 of that assembly with that of other assembly, the strength cycles of withdrawal and retraction and still and release test as per 5.5.2 and 5.5.3 shall also be meet the requirement of (a) and (b). carried out for both possible means of assembly. 4.2.5.2 Automatically locking retractors 4.2.2.7 The force required to open the buckle in the a) The strap of a safety belt assembly equipped test as prescribed in 5.5.3 shall not exceed 60 N for with an automatically locking retractor shall button type buckle and 140 N for the lever type buckle not move more than 30 mm between the of a two point or three point seat belt assembly. locking positions of the retractor. After a 4.2.3 Belt Adjustment Device rearward movement by the wearer, the belt must either remain at its initial position or 4.2.3.1 Two samples of each belt adjustment device shall return to that position automatically on be tested in accordance with the requirement of 5.2.8. subsequent forward movements of the wearer. The strap slip shall not exceed 25 mm for each sample b) If the retractor is part of a lap belt, the of adjusting device and the sum of shifts for all the retracting force of the strap shall not be less adjusting devices shall not exceed 40 mm. than 7 N when measured in the free length 4.2.3.2 All the adjustment devices shall be tested for between the manikin and the retractor in strength as prescribed in 5.2.1. They shall not break or accordance with 5.3.4. If the retractor is part become detached under the tension set up by the of an",
      "region": "India"
    },
    {
      "chunk_id": "bf581d03141e6eb1c7af797e23dcc35be0104e1e81f51476a6fb92c3ced44f78",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 16,
      "text": "measured in the free length 4.2.3.2 All the adjustment devices shall be tested for between the manikin and the retractor in strength as prescribed in 5.2.1. They shall not break or accordance with 5.3.4. If the retractor is part become detached under the tension set up by the of an upper torso restraint, the retracting force prescribed load. of the strap shall be between 1 N and 7 N when measured. If the strap passes through a guide signal or power source and the failure of or pulley, the retracting force shall be measured the signal or power source is indicated to in the free length between the manikin and the driver by optical and/or acoustical guide or pulley. If the assembly incorporates means a device which upon manual or automatic b) An emergency locking retractor with multiple operation prevents the strap from being sensitivity when tested according to 5.3.2, completely retracted, such a device shall not including the strap sensitivity, shall comply be operated when the retracting force is with the specified requirements and also lock measured. up when the strap acceleration measured in c) The strap shall be withdrawn from the retractor the direction of unreeling is not less than 2 g. and allowed to retract repeatedly by the c) In each of the tests mentioned in 4.2.5.3 (a) method described in 5.3.1 until 5 000 cycles and (b), the amount of strap movement which of withdrawal and retraction have been may occur before the retractor locks shall not completed. The retractor shall then be exceed 50 mm starting at the length given subjected to the corrosion test given in 5.1 in5.3.2.1. In the case of the test mentioned followed by dust resistance test prescribed in in4.2.5.3 (a) (1), the locking shall not occur 5.3.3. It shall satisfactorily",
      "region": "India"
    },
    {
      "chunk_id": "f5a709ddfe2c8d699f54e9220040d415cf2f3f0ffd40a73265adf9ccc2f3b494",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 17,
      "text": "not completed. The retractor shall then be exceed 50 mm starting at the length given subjected to the corrosion test given in 5.1 in5.3.2.1. In the case of the test mentioned followed by dust resistance test prescribed in in4.2.5.3 (a) (1), the locking shall not occur 5.3.3. It shall satisfactorily complete a further during the 50 mm of strap movement starting 5 000 cycles and meet the requirements of at the length given in 5.3.2.1. 4.2.5.2 (a) and 4.2.5.2 (b). d) If the retractor is part of the lap belt, the 4.2.5.3 Emergency locking retractor retracting force of the strap shall not be less than 7 N when measured in the free length a) An emergency locking retractor, when tested between the manikin and the retractor in in accordance with 5.3.2, shall satisfy the accordance with 5.3.4. conditions as given below: If the retractor is part of an upper torso 1) The locking shall have occurred when the restraint, the retracting force of the strap shall deceleration of the vehicle reached 0.45 be not less than 0.1 daN and not more than g in the case of Type 4 retractors or 0.85 0.7 daN when similarly measured, except for g in the case of Type 4 N retractors. a belt equipped with a tension-reducing device, 2) It shall not lock at values of accelerations in which case the minimum retracting force of the strap, measured in the direction of may be reduced to 0.05 daN only when such a the unreeling less than 0.8 g in the case device is in operation mode. If the strap passes of Type 4 retractors or1.0 g in the case of through a guide or pulley, the retracting force Type 4 N retractors. shall be measured in the free length between 3) It shall",
      "region": "India"
    },
    {
      "chunk_id": "5f991e58566404805b71652fe9a67ed6bf3fca641ca592661cb235c10189b1be",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 18,
      "text": "unreeling less than 0.8 g in the case device is in operation mode. If the strap passes of Type 4 retractors or1.0 g in the case of through a guide or pulley, the retracting force Type 4 N retractors. shall be measured in the free length between 3) It shall not lock when the sensing device the dummy and the guide or pulley. is tilted 12° or less in any direction from If the assembly incorporates a device that upon the installation position specified by the manual or automatic operation prevents the manufacturer. strap from being completely retracted, such a 4) It shall lock when its sensing device is device shall not be operated when these tilted by more than 27° in the case of Type requirements are assessed. 4 retractors or 40° in the case of Type 4 If the assembly incorporates a tension- N retractors in any direction from the reducing device, the retracting force of the installation position specified by the strap described in the above shall be measured manufacturer. with the device in operation mode and non- 5) In case of single sensitivity [3.7.4(a)], only operation mode when these requirements are the specifications regarding the assessed before and after durability tests deceleration of vehicle are valid. according to 4.2.5.3 (e). 6) In cases where the operation of a retractor e) The strap shall be withdrawn from the retractor depends on an external signal or power and allowed to retract repeatedly by the source, the design shall ensure that the method described in 5.3.1 until 40 000 cycles retractor locks automatically upon failure have been completed. The retractor shall then or interruption of that signal or power be subjected to the corrosion test given at 5.1 source. However, this requirement need and followed by the dust resistance",
      "region": "India"
    },
    {
      "chunk_id": "8ce5a2934ea0d14a0a660bc94970dc26e3148b1f4143de706399e6f225353d8f",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 19,
      "text": "ensure that the method described in 5.3.1 until 40 000 cycles retractor locks automatically upon failure have been completed. The retractor shall then or interruption of that signal or power be subjected to the corrosion test given at 5.1 source. However, this requirement need and followed by the dust resistance test not be met in the case of a retractor with prescribed in 5.3.3. It shall satisfactorily multiple sensitivities, provided only one complete a further 5 000 cycles of withdrawal sensitivity is dependent on an external and retraction. If the assembly incorporates a tension- conformity with 5.4.2.2, the breaking load of the strap, reducing device, the above tests shall be determined as prescribed in 5.4.1, shall be not less than conducted on condition that the tension- 22.7 kN for straps of static belts and not less than 14.7 reducing device is in operation mode and in kN for straps of retractor belts. The difference between non-operation mode. the breaking loads of the two samples shall not exceed After the above tests, the retractor shall meet 10 percent of the higher value of the breaking loads the requirements of 4.2.5.3 (a) to 4.2.5.3 (d). measured. f) Retractors must fulfil, after durability test 4.3.3 Strength after Special Conditioning according to paragraph 4.2.5.3 (e) and In the case of two straps samples conditioned in immediately after the retracting force conformity with one of the provisions of 5.4.2.3 measurement according to 4.2.5.3 (d) all next to5.4.2.7, the breaking load of the strap shall be not two specifications: less than 75 percent of average of the loads determined 1) When retractors except automatically in the test referred to in 4.3.2. Additionally, for straps locking retractors are tested according to of retractor belts, the breaking load shall be not less paragraph 5.3.4.2, the retractors must be",
      "region": "India"
    },
    {
      "chunk_id": "1af53ff0de6e0fb5322241cc3267fc007c42008f3825ff9cb620cc0221e54b82",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 20,
      "text": "not two specifications: less than 75 percent of average of the loads determined 1) When retractors except automatically in the test referred to in 4.3.2. Additionally, for straps locking retractors are tested according to of retractor belts, the breaking load shall be not less paragraph 5.3.4.2, the retractors must be than 14.7 kN. The test agency conducting the tests may able to avoid any slack between torso and dispense with one or more of these tests, if the belt; and composition of the material used or information already 2) When the buckle is unlatched to release available renders the test or tests superfluous. the tongue, the retractor alone must be 4.3.4 Strength after Abrasion Conditioning able to retract strap fully. 4.3.4.1 Samples conditioned in compliance with 5.4.2.7, 4.2.5.4 Pre-loading devices the breaking strength shall be assessed as prescribed a) After being submitted to corrosion testing in in5.2.1 and 5.4.1. For both the samples, it shall be equal accordance with 5.1, the pre-loading device to at least 75 percent of the average of the breaking (including the impact sensor connected to the strength determined during tests on upbraided straps device by the original plugs but without any and not less than the minimum load specified for the current passing through them) shall operate item being tested. The difference between breaking normally. loads of the two samples shall not exceed 20 percent of the highest measured breaking load. For Type 1 and b) It shall be verified that inadvertent operation Type 2 procedures, the breaking strength test shall be of the device does not involve any risk of carried out on strap samples only according to 5.4.1. bodily injury for the wearer. For Type 3 procedure, the breaking strength test shall c) In the case of pyrotechnic pre-loading devices, be carried out",
      "region": "India"
    },
    {
      "chunk_id": "c83ccc3c7ada0bd73cd28eceb5bce5c96d378b23d7db58bc9f7ce262ba6b9ffd",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 21,
      "text": "procedures, the breaking strength test shall be of the device does not involve any risk of carried out on strap samples only according to 5.4.1. bodily injury for the wearer. For Type 3 procedure, the breaking strength test shall c) In the case of pyrotechnic pre-loading devices, be carried out on the strap in combination with the metal the operation of the pre-loading device must component involved according to 5.2.1. not have been activated by the temperature and the device shall operate normally after 4.3.4.2 The items to be subjected to the abrasion test subjected to the conditioning in accordance procedure and the procedure(s) to be followed are with 5.2.7. Precautions shall be taken to indicated in Table 2. A new sample shall be used for prevent the hot gases expelled from igniting each procedure: adjacent flammable materials. Table 2 Abrasion Test Procedure 4.3 Straps (Clause 4.3.4.2) 4.3.1 General Sl Component/ Procedure Type 1 Type 2 Type 3 No. 4.3.1.1 The characteristics of the straps shall be such as (1) (2) (3) (4) (5) to ensure that their pressure on the wearer body is i) Attachment – – × distributed as evenly as possible over their width and do ii) Guide or pulley – × – not twist under load. They shall have energy absorbing iii) Buckle loop – × × and dispersing capacities. The straps shall have finished iv) Adjusting device × – × salvages which shall not become unravelled in use. v) Parts sewn to the strap – – × 4.3.1.2 The width of the straps under load of 9.8+1 kN −0 4.3.5 Elongation shall be not less than 46 mm when measured during the breaking strength test prescribed in 5.4.5. The elongation of the webbing shall be 20 percent or less when the webbing is tested by",
      "region": "India"
    },
    {
      "chunk_id": "202d673357c8f1fee20679d590f565678cd2b4aac3c9c961849a2d2412f407b3",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 22,
      "text": "– × 4.3.1.2 The width of the straps under load of 9.8+1 kN −0 4.3.5 Elongation shall be not less than 46 mm when measured during the breaking strength test prescribed in 5.4.5. The elongation of the webbing shall be 20 percent or less when the webbing is tested by the method specified 4.3.2 Strength after Room Conditioning in 5.4.3. This test shall not be applicable for straps of In the case of two straps samples conditioned in retractor belts. 4.3.6 Energy Absorptivity 4.4.2.5 The belts shall be subjected to the corrosion test prescribed in 5.1 after which the Buckle shall be The work and work load ratio shall not be less than the subjected to 500 additional opening and closing cycles values mentioned in Table 3 when the webbing is tested under normal conditions of use. by the method specified in 5.4.4. This test shall not be applicable for straps of retractor belts. 4.4.2.6 Safety belts with retractors shall have been subjected to the tests as per 4.2.5.1 or 4.2.5.2 or 4.2.5.3 Table 3 Work and Work Load Ratio but not required, if retractor had already passed the (Clause 4.3.6) corrosion test. Sl Type of Webbing Work/Length Work Load No. Nm/m Ratio 4.4.2.7 In the case of a belt intended for use with a belt (1) (2) (3) (4) adjustment device for height, the test shall be carried i) Lap webbing 500 50 out with the device adjusted in the most unfavourable position(s). However if the belt adjustment device for ii) Continuous webbing 800 55 height consists of belt anchorage itself, it shall conform 4.4 Belt Assembly or Restraint Systems to IS 15139, provision of 5.5.2.1 may apply. 4.4.1 Static Strength/Displacement Test on Seat Belt 4.4.2.8 In the case of a safety belt with pre-loading Assembly/Restraint Systems (not Applicable",
      "region": "India"
    },
    {
      "chunk_id": "513524c585b356cf5373fae6080d9fad08a61c770c690c8058ea560aa580d7e4",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 23,
      "text": "for ii) Continuous webbing 800 55 height consists of belt anchorage itself, it shall conform 4.4 Belt Assembly or Restraint Systems to IS 15139, provision of 5.5.2.1 may apply. 4.4.1 Static Strength/Displacement Test on Seat Belt 4.4.2.8 In the case of a safety belt with pre-loading Assembly/Restraint Systems (not Applicable for ELR device, the minimum displacements as given in Belt) 4.4.2.9(b) may be reduced to half. For the purpose of this test, the pre-loading device shall be in operation. When tested in accordance with the provisions of 5.5.1, the seat belt shall sustain the maximum test load for the 4.4.2.9 During this test, the following requirements shall type of assembly for a minimum continuous period of be met: 30 s. The test load shall then be reduced to a force of a) No part of the belt assembly or a restraint 665 ± 50N and the buckle opening force as per 5.5.3 system affecting the restraint of the occupant shall not exceed 60 N for button type buckle and 140N shall break and no buckles or locking system for the lever type buckle of a two point or three point or displacement system shall release or unlock; seat belt assembly. and 4.4.1.1 The displacement shall be measured after the b) The forward displacement of the manikin shall test load has been applied for a minimum continuous be between 80 mm and 200 mm at pelvic level period of 30 s according to 5.5.1 and this shall not be in the case of lap belts. In the case of harness more than 180 mm for two point and 250 mm for three belt, the minimum displacement specified for point safety belt assemblies. the pelvis may be reduced by half. In the case of other types of belts, the forward 4.4.1.2 This",
      "region": "India"
    },
    {
      "chunk_id": "3937d9cbd2f141fbf3270d3cd96784b8975cfb0ce550bff13f35ea139bce38c4",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 24,
      "text": "case of lap belts. In the case of harness more than 180 mm for two point and 250 mm for three belt, the minimum displacement specified for point safety belt assemblies. the pelvis may be reduced by half. In the case of other types of belts, the forward 4.4.1.2 This requirement is not applicable, if the displacement shall be between 80 mm and 200 dynamic test requirement as per 4.4.2 is met. mm at the pelvic level and between 100 mm 4.4.2 Dynamic Test and 300 mm at torso level. These displacements are the displacements in relation 4.4.2.1 The belt assembly or restraint system shall be to the measurement points shown in Fig. 25 subjected to a dynamic test in conformity with 5.5.2. (see Annex D). 4.4.2.2 The dynamic test shall be performed on two c) In the case of a safety-belt intended to be used assemblies which have not been earlier under load, in an outboard front seating position protected except in the case of belt assemblies forming part of by an airbag in front of it, the displacement of restraint systems when the dynamic test shall be the chest reference point may exceed that performed on the restraint systems intended for one specified in paragraph 4.4.2.9 (b), if its speed group of seats which have not previously been under at this value does not exceed 24 km/h. load. 4.4.2.10 In the case of a restraint system 4.4.2.3 The buckles of the belt assemblies to be tested The movement of the torso reference point may exceed shall have met the requirements of 4.2.2.3. In the case that specified in 4.4.2.9 (b), if it can be shown either by of safety belts with retractors, the retractor shall have calculation or a further test that no part of the torso or",
      "region": "India"
    },
    {
      "chunk_id": "5533887b44b9e84fb3ce9aec55516ef037877c621f4a98a01600cb5aa18c5153",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 25,
      "text": "of the torso reference point may exceed shall have met the requirements of 4.2.2.3. In the case that specified in 4.4.2.9 (b), if it can be shown either by of safety belts with retractors, the retractor shall have calculation or a further test that no part of the torso or been subjected to the dust resistance test (see 5.3.3). the head of the manikin used in the dynamic test would 4.4.2.4 In addition, in case of safety belts/restraint have come into contact with, system equipped with a pre-loading device comprising a) any forward rigid part of the vehicle other than pyrotechnic means, the device shall have been subjected the chest with the steering assembly, if the to the conditioning specified in 5.2.7. latter meets the requirements of IS 11939 and provided the contact does not occur at a speed for 2 h. Immediately after being removed from the higher than 24 km/h. For this assessment the chamber, the mating parts of the buckle shall then be seat shall be considered to be in the position locked together manually. The buckle shall operate specified in 5.5.2.5. normally. b) in vehicles where such devices are used, the 5.2.4 Two samples of the complete belt assembly shall displacement and locking system enabling the be placed in a low-temperature chamber at a occupants of all seats to leave the vehicle shall temperature of –10 ± 1°C for 2 h. All rigid items and still be operable by hand after the dynamic test. parts made of plastic under test shall then be laid in 5 TESTS turn on a flat rigid steel surface (which has been kept with the samples in the low temperature chamber), The details of number of samples to be taken and tests placed on the horizontal surface of a compact rigid",
      "region": "India"
    },
    {
      "chunk_id": "fa31a078ee6836e0a0af1953faabbad7cff977471184fb870e88f4b0f9d265c9",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 26,
      "text": "of plastic under test shall then be laid in 5 TESTS turn on a flat rigid steel surface (which has been kept with the samples in the low temperature chamber), The details of number of samples to be taken and tests placed on the horizontal surface of a compact rigid block to be carried out for acceptance of a type of belt or with a mass of at least 100 kg, within 30 s of their restraint system shall be as given in Table 4. being removed from the low-temperature chamber. An 18 kg steel mass shall be allowed to fall under gravity 5.1 Corrosion Test from a height of 300 mm on to the test sample. The 5.1.1 The complete safety belt assembly shall be impact force of the 18 kg mass shall take the form of subjected to salt spray testing in a test chamber as convex surface with a hardness of 45 HRC minimum prescribed in Annex B. In the case of an assembly having a transverse radius of 10 mm and a longitudinal incorporating a retractor, the strap shall be unwound radius of 150 mm placed along the centre line of the to full length less 300 ± 3 mm. The test duration shall mass. One sample shall be tested with the axis of the be 50 h. curved bar in line with the strap and the other sample shall be tested at 90° to the strap. 5.1.2 On completion of the test, the assembly shall be washed, in a clean running water at a temperature not 5.2.5 Buckles having parts common to two safety belts higher than 38°C, to remove any salt deposit that may shall be loaded in such a way as to simulate the have formed and then allowed to dry at room",
      "region": "India"
    },
    {
      "chunk_id": "2c0832ec704b81b185b3441c3b58693a0677914e67de27cffc17d07b49df55f3",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 27,
      "text": "be washed, in a clean running water at a temperature not 5.2.5 Buckles having parts common to two safety belts higher than 38°C, to remove any salt deposit that may shall be loaded in such a way as to simulate the have formed and then allowed to dry at room conditions of use in a vehicle with the seats in the mid- temperature for 24 h and checked in accordance position of their adjustment. The direction of application with4.2.1.2. of the load shall be established in accordance with5.5.2.1. A load of 14.7 kN shall be applied 5.2 Static Test of Belt Components Incorporating simultaneously to each of the straps. A suitable Rigid Parts apparatus for the above test is shown in Fig. 4. 5.2.1 The buckle and strap adjusting device shall be 5.2.6 When testing any manual adjusting device, the connected to a tensile-testing machine and apply a load strap shall be drawn steadily through that device, having of 9.8 kN. In the case of harness belts, the buckle shall regard to normal conditions of use, at a rate of be connected to the testing apparatus by the straps 100mm/s, and the maximum force shall be measured which are attached to the buckle and the tongue or two to the nearest 1 N after the first 25 mm of strap tongues located symmetrically to the geometric centre movement. The test shall be carried out in both of the buckle. If the buckle or adjusting device is part directions of strap travel through the adjusting device, of the attachment or of the common component of a the strap being cycled 10 times prior to measurement. three-point strap, the buckle or adjusting device shall be tested together with the attachment in accordance 5.2.7 Additional Tests on Safety Belts with Pre-Loading with 5.2.2",
      "region": "India"
    },
    {
      "chunk_id": "6e7faa9bc761e53416f9753981418570beb952108423ab9423ed6083dc819df5",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 28,
      "text": "travel through the adjusting device, of the attachment or of the common component of a the strap being cycled 10 times prior to measurement. three-point strap, the buckle or adjusting device shall be tested together with the attachment in accordance 5.2.7 Additional Tests on Safety Belts with Pre-Loading with 5.2.2 except in the case of retractors with return Devices — Conditioning pulley at the upper strap anchorage. In this case the The pre-loading device may be separated from the safety test load shall be 9.8 kN and the length of strap belt to be tested and kept for 24 h at a temperature of remaining on the reel at the moment of locking shall be 60 ± 5°C. The temperature shall then be raised to as close as possible to 450 mm. 100 ± 5°C for 2 h. Subsequently it shall be kept for 24 5.2.2 The attachments and any belt adjustment devices h at a temperature of –30 ± 5°C. After being removed for height shall be tested as per 5.2.1 and the load of from conditioning, the device shall warm up to ambient 14.7 kN shall be applied in the least favourable temperature and fitted again to the safety belt. conditions likely to occur in a vehicle in which the belt 5.2.8 Micro Slip Test is installed as per 5.5.2.1. In the case of retractors the test shall be performed with the strap completely 5.2.8.1 The samples to be submitted to the micro-slip unwound from the reel. test shall be kept for a minimum of 24 h in an atmosphere having a temperature of 20 ± 5 °C and a relative 5.2.3 Two samples of the complete belt assembly shall humidity of 65 ± 5 percent. The test shall be carried be placed in a low-temperature chamber at",
      "region": "India"
    },
    {
      "chunk_id": "b6b6ee70f2d310b5815e6c9c3f372f9443985c848a3773e1d63d177fbde46bb4",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 29,
      "text": "shall be kept for a minimum of 24 h in an atmosphere having a temperature of 20 ± 5 °C and a relative 5.2.3 Two samples of the complete belt assembly shall humidity of 65 ± 5 percent. The test shall be carried be placed in a low-temperature chamber at –10 ± 1°C Table 4 Samples for the Type Approval Tests ( Clause 5) Sl Ref to Test Sample No. Clause Belt or Restraint System Straps 1 2 3 4 5 6 7 1 2 3 4 5 6 7 8 9 10 11 12 13 (1) (2) (3) (4) (5) (6) (7) (8) (9) (10) (11) (12) (13) (14) (15) (16) (17) (18) (19) (20) (21) (22) (23) i) 4.1.3,4.1.4, Inspection of Belt or × 4.1.5 Restraint System Belt Components Incorporating Rigid Parts ii) 4.2.1.1, Inspection × × × × × × × 4.2.1.3 4.2.1.4, 4.2.2.1 iii) 4.2.1.2, 5.1 Corrosion Resistance × × iv) Low Temperature × × 4.2.1.4, 5.2.4 Impact Test v) 4.2.2.3 Durability of Buckle × × vi) 4.2.2.4, 5.2.3 Low Temperature Test × × on Buckle vii) 4.2.2.6, Buckle Strength Test × 5.2.1,5.2.5 viii) 4.2.3.3, 5.2.6 Ease of Adjustment × ix) 4.2.3.1, 5.2.8 Micro Slip Test × × x) 4.2.3.2, 5.2.1, Strength Test on × 5.2.2, Adjusting Device 5.2.5 (when necessary on retractors) xi) 4.2.4, 5.2.1, Strength Test on × 5.2.2 Attachments (when necessary on retractors) Retractors: xii) 4.2.5.1, Retracting Force, × × 4.2.5.2 Durability, Corrosion, 4.2.5.3, 5.3 Dust Seat Belt Assembly xiii) 4.4.2, 5.5.2, Dynamic Test × × 5.5.3 xiv) 4.4.1, 5.5.1, Static Strength/ × × 5.5.3 Displacement Test xv) 4.3.4, 5.4.2.7 Abrasion Test × × Straps: xvi) 4.3.1.2,5.4.1 Testing of Strap Width × × Strap Strength After (5.5.1) xvii) 4.3.2, 5.4.2.2 Room Conditioning × × xviii) 4.3.3, 5.4.2.3 Light Conditioning × × xix) 4.3.3,",
      "region": "India"
    },
    {
      "chunk_id": "687d5d803d965f60964bc2c1c113db11bfd347b59dc9b08112ee758593c3a006",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 30,
      "text": "Test × × 5.5.3 xiv) 4.4.1, 5.5.1, Static Strength/ × × 5.5.3 Displacement Test xv) 4.3.4, 5.4.2.7 Abrasion Test × × Straps: xvi) 4.3.1.2,5.4.1 Testing of Strap Width × × Strap Strength After (5.5.1) xvii) 4.3.2, 5.4.2.2 Room Conditioning × × xviii) 4.3.3, 5.4.2.3 Light Conditioning × × xix) 4.3.3, 5.4.2.4 Low Temperature × × Conditioning xx) 4.3.3, 5.4.2.5 Heat Conditioning × × xxi) 4.3.3, 5.4.2.6 Water Conditioning × × xxii) 4.3.5, 4.3.6, Elongation and × × Energy Absorptive xxiii) ...... Retention of Strap × Sample FIG. 4 BUCKLE STRENGTH TEST out immediately after conditioning at a temperature being 300 ± 20 mm. The 50 N load shall be applied between 15°C and 30°C. only during the time corresponding to a shift of 100 ± 20 mm for each half period. 5.2.8.2 It shall be ensured that the free section of the adjusting device points either up or down on the test 5.3 Tests for Retractors bench, as in the vehicle. 5.3.1 Durability of Retractor Mechanism 5.2.8.3 A 50 N load shall be attached to the lower end of the section of strap. The other end shall be subjected The strap shall be withdrawn and allowed to retract for to a back and forth motion, the total amplitude being the required number of cycles at a rate of not more 300 ± 20 mm. A typical arrangement is shown in Fig.11 than 30 cycles/min. In the case of emergency locking for reference. retractors, a snatch to lock the retractor shall be introduced at each fifth cycle. The snatches shall occur 5.2.8.4 If there is a free end serving as a reserve strap, in equal numbers at each of five different extractions, it shall in no way be fastened or clipped to the section namely, 90, 80, 75, 70 and 65",
      "region": "India"
    },
    {
      "chunk_id": "6103b7812c4038b39f3a33b082acd90a8e281f3369fb39eecc5fce7b43e31921",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 31,
      "text": "be introduced at each fifth cycle. The snatches shall occur 5.2.8.4 If there is a free end serving as a reserve strap, in equal numbers at each of five different extractions, it shall in no way be fastened or clipped to the section namely, 90, 80, 75, 70 and 65 percent of the total length under load. of the strap remaining wound on the retractor. However, 5.2.8.5 It shall be ensured that on the test bench, the where more than 900 mm is provided, the above strap, in the slack position, descends in a concave curve percentages shall be related to the final 900 mm of strap from the adjusting device, as in the vehicle. The 50 N which can be withdrawn from the retractor. A suitable load applied on the test bench shall be guided vertically apparatus is shown in Fig. 5. in such a way as to prevent the load swaying and the 5.3.2 Locking of Emergency Locking Retractors belt twisting. The attachment shall be fixed to the 50 N load as in the vehicle. 5.3.2.1 The retractor shall be tested once for locking when 300 ± 3 mm of the strap remain wound on the 5.2.8.6 Before the actual start of the test, a series of retractor reel. 20 cycles shall be completed so that the self-tightening system settles properly. 5.3.2.2 In the case of the retractor actuated by strap movement, the extraction shall be in the direction in 5.2.8.7 One thousand cycles shall be completed at a which it normally occurs when the retractor is installed frequency of 0.5 cycles per second, the total amplitude in a vehicle. FIG. 5 TYPICAL APPARATUS TO TEST DURABILITY OF RETRACTOR MECHANISM 5.3.2.3 When retractors are being tested for sensitivity shall consist of about 1 kg of dry quartz of",
      "region": "India"
    },
    {
      "chunk_id": "c623dc2a2de5199bbcf59bd651854b4bd4a3b8f59d9f5e1b7a588c0ddc490cc4",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 32,
      "text": "a which it normally occurs when the retractor is installed frequency of 0.5 cycles per second, the total amplitude in a vehicle. FIG. 5 TYPICAL APPARATUS TO TEST DURABILITY OF RETRACTOR MECHANISM 5.3.2.3 When retractors are being tested for sensitivity shall consist of about 1 kg of dry quartz of particle size to vehicle deceleration they shall be tested at the above distribution as follows: extraction along two mutually perpendicular axes, Percent which are horizontal, if the retractor is installed in a a) Passing 150 micron aperture, 99-100 vehicle as specified by the safety belt manufacturers. One of these axes shall be in the direction chosen by 104 micron wire diameter the test agency to give the most adverse conditions with b) Passing 105 micron aperture, 76-86 respect to actuation of the locking mechanism. 64 micron wire diameter 5.3.2.4 A suitable apparatus for the tests is shown in c) Passing 75 micron aperture, 60-70 Annex C. The design of which ensure that the required 52 micron wire diameter acceleration is given before the webbing is withdrawn 5.3.4 Retracting Force (see Fig. 7) out of the retractor by more than 5 mm and that the withdrawal takes place at an average rate of increase 5.3.4.1 The retracting force shall be measured with the of acceleration of at least 55 g/s and not more than 150 safety belt assembly fitted to a manikin as per the g/s in testing sensitivity for strap movement and of at dynamic test prescribed in 5.5.2. The strap tension shall least 25 g/s and not more than 150 g/s in testing be measured at the point of contact with the manikin sensitivity for vehicle deceleration. while the strap is being retracted at rate of 0.6 m/min. In the case of a safety-belt with tension-reducing device, 5.3.2.5 To",
      "region": "India"
    },
    {
      "chunk_id": "82a291a1ecc2e714d78a1bff27acb936358e631927f08f9cfd05a94b999384f0",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 33,
      "text": "strap tension shall least 25 g/s and not more than 150 g/s in testing be measured at the point of contact with the manikin sensitivity for vehicle deceleration. while the strap is being retracted at rate of 0.6 m/min. In the case of a safety-belt with tension-reducing device, 5.3.2.5 To check conformity with the requirements the retracting force and strap tension shall be measured of4.2.5.3 (a) (3) and (4), the retractor shall be mounted with the tension-reducing device in both operation mode on a horizontal table tilted with a speed not exceeding and non-operation mode. 2°/s until locking has occurred. The test shall be repeated with tilting in other directions to ensure that 5.3.4.2 Before the dynamic test described in 5.5.2, the the requirements are fulfilled. seated dummy, which is clothed with a cotton shirt, shall be tilted frontward until 350 mm of the strap is 5.3.3 Dust Resistance withdrawn from retractor, and then released to the initial 5.3.3.1 The retractor shall be positioned in a test chamber position. as described in Fig. 6. It shall be mounted with the same relative position as in the vehicle. The test chamber shall 5.4 Tests on Straps contain dust as specified in 5.3.3.2. A length of 500 mm 5.4.1 Breaking Strength of Strap (Static Test) of the strap shall be extracted from the retractor and kept extracted, except that it shall be subjected to ten 5.4.1.1 The test shall be carried out each time on two complete cycles of retraction and withdrawal within one new samples of strap of sufficient length, conditioned or two minutes after each agitation of the dust. For a in conformity with 5.4.2. period of 5 h, the dust shall be agitated every 20 min for 5.4.1.2 Each strap shall be gripped between the clamps five seconds by",
      "region": "India"
    },
    {
      "chunk_id": "cf98795a448b4006503bad063bfcf3f52cecfd2921bf944312e0bcfbd2f5bd56",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 34,
      "text": "within one new samples of strap of sufficient length, conditioned or two minutes after each agitation of the dust. For a in conformity with 5.4.2. period of 5 h, the dust shall be agitated every 20 min for 5.4.1.2 Each strap shall be gripped between the clamps five seconds by compressed air free of oil and moisture of a tensile testing machine. The clamps shall be so at a gauge pressure of 550 kPa entering through an orifice designed as to avoid breakage of the strap at or near 1.5 ± 0.1 mm in diameter. the point of contact with the clamps. The speed of 5.3.3.2 The dust used in the test prescribed in 5.3.3.1 traverse shall be about 100 mm/min. The free length of FIG. 6 TYPICAL APPARATUS FOR TESTING THE DUST RESISTANCE OF RETRACTORS FIG. 7 RETRACTION FORCE MEASUREMENT the specimen between the clamps of the machine at the 5.4.2 Conditioning of Straps start of the test shall be 200 ± 40 mm. A recommended 5.4.2.1 Samples cut from the strap given for testing arrangement for gripping the strap in tensile testing shall be conditioned, machine is shown in Fig. 8. a) at room conditions as per 5.4.2.2; and 5.4.1.3 The tension shall be increased until the strap b) at special conditions as per 5.4.2.3 to 5.4.2.7. breaks and the breaking load is noted. 5.4.2.2 Room conditioning 5.4.1.4 If the strap slips or breaks at the point of contact or within 10 mm of either of the clamps, the test shall The strap shall be conditioned in accordance with be invalid and a new test shall be carried out on another ISO 139, using the standard atmosphere or specimen. alternative standard atmosphere.If the test is not FIG. 8 TYPICAL SETUP FOR GRIPPING THE STRAP IN TENSILE TESTING MACHINE",
      "region": "India"
    },
    {
      "chunk_id": "956d1cf5b80213d22ae43427924f20a91157c6816985f109c78a82e59187bba3",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 35,
      "text": "the test shall The strap shall be conditioned in accordance with be invalid and a new test shall be carried out on another ISO 139, using the standard atmosphere or specimen. alternative standard atmosphere.If the test is not FIG. 8 TYPICAL SETUP FOR GRIPPING THE STRAP IN TENSILE TESTING MACHINE carried out immediately after conditioning, the 5.4.2.5 Heat conditioning specimen shall be replaced in a hermetically closed The strap shall be kept for 3 h in a heating cabinet in an receptacle until the test begins. The breaking load atmosphere having a temperature of 60 ± 5°C at a shall be determined within five minutes after removal relative humidity of 65 ± 5 percent. The breaking load of the strap from the conditioning atmosphere or from shall be determined within 5 min after removal of the the receptacle. strap from the heating cabinet. 5.4.2.3 Light conditioning 5.4.2.6 Exposure to water The provision of recommendations of The strap shall be kept fully immersed for 3 h in distilled ISO 105-B 02 (1994/Amd2:2000) shall apply. The strap water, at a temperature of 20 ± 5°C, to which a trace of shall be exposed to light for the time necessary to produce wetting agent has been added. Any wetting agent a contrast equal to Grade 4 on the grey scale on Standard suitable for the fibre under the test may be used. The Blue Dye No. 7. After exposure the strap shall be breaking load shall be determined within 10 min after conditioned and tested for breaking load as per 5.4.2.2. removal of the strap from the water. 5.4.2.4 Cold conditioning 5.4.2.7 Abrasion conditioning The strap shall be conditioned according to 5.4.2.2. 5.4.2.7.1 The abrasion conditions will be performed on Then the strap shall be kept for 1.5 h on a plane surface",
      "region": "India"
    },
    {
      "chunk_id": "9bf95e6d2bf879c5ba9ffe5506a0cf4582337dd3122cc52f93f676ada683998f",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 36,
      "text": "and tested for breaking load as per 5.4.2.2. removal of the strap from the water. 5.4.2.4 Cold conditioning 5.4.2.7 Abrasion conditioning The strap shall be conditioned according to 5.4.2.2. 5.4.2.7.1 The abrasion conditions will be performed on Then the strap shall be kept for 1.5 h on a plane surface each and every device in which the strap is in contact in a low temperature chamber in which the air with a rigid part of the belt. However, Type 1 abrasion temperature is kept at – 30 ± 5°C and kept under load test need not be carried out on the belt adjusting device for 30 min in the same low temperature chamber. Then where the micro slip test as per 5.2.8 shows the strap the mass shall be removed and the breaking load shall slip less than half the specified amount. The setting on be measured within 5 min after removal of the strap the test apparatus will approximately maintain the from the low temperature chamber relative position of the strap and contact area. The changes direction once in passing through a samples shall be conditioned as per 5.4.2.2. The ambient rigid part. During this test, the angles which temperature during the abrasion procedure shall be both strap ends make with each other shall be between 15°C and 30°C. maintained as shown in Fig. 10. A steady load of 5 N shall be maintained during the test. If 5.4.2.7.2 The requirements for each abrasion procedure the strap changes direction more than once in are listed in Table 5. The shift given in the last column passing through a rigid part, the load of 5 N of this table represents the amplitude of a back and forth may be increased so as to achieve the motion applied to the strap:",
      "region": "India"
    },
    {
      "chunk_id": "aa226794e3850e0ac87d48e84bbc315c468ff3ae0f2d7052828adc5a684ba64d",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 37,
      "text": "more than once in are listed in Table 5. The shift given in the last column passing through a rigid part, the load of 5 N of this table represents the amplitude of a back and forth may be increased so as to achieve the motion applied to the strap: prescribed strap movement of 300 mm through Table 5 Requirements for Abrasion Procedures that rigid part. (Clause 5.4.2.7.2) c) Type 3 — This is for cases where the strap is Sl Procedure Load Frequency No. of Shift fixed to a rigid part of sewing or similar means. No. N Hz Cycles The total back and forth motion that is, shift (1) (2) (3) (4) (5) (6) shall be 300 ± 20 mm and the 50 N load shall i) Type 1 25 0.5 5 000 300 ± 20 only be applied during the time corresponding ii) Type 2 5 0.5 45 000 300 ± 20 to a shift of 100 ± 20 mm for each half period iii) Type 3 0-50 0.5 45 000 — as shown in Fig. 11. 5.4.2.7.3 Details of procedures 5.4.3 Elongation Test a) Type 1 — This procedure is for cases where A test piece shall be fixed on the tensile testing machine the strap slides through an adjusting device. A in the method described in 5.4.1.2 and apply an initial vertical steady load of 25 N shall be maintained load of 200 N, to strain the test piece with the clamps on one end of the strap, the other end of the kept 200 ± 20 mm apart. Gauge marks of 200 mm strap shall be attached to a device giving the distance within the clamp distance shall be marked. strap a horizontal back and forth motion. The The tension load shall be applied",
      "region": "India"
    },
    {
      "chunk_id": "af6c0707859b1a3e9e6c96ea808a36229bfb64791006a09f4358e6b290de45cb",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 38,
      "text": "of the strap, the other end of the kept 200 ± 20 mm apart. Gauge marks of 200 mm strap shall be attached to a device giving the distance within the clamp distance shall be marked. strap a horizontal back and forth motion. The The tension load shall be applied at a rate of adjusting device shall be placed on the approximately 100 mm/min. When the load reaches horizontal strap so that the strap remains under 11.1 kN, the distance between the gauge marks should load as shown in Fig. 9. be measured and percentage elongation shall be b) Type 2 — This is for cases where the strap calculated. FIG. 9 TYPE 1 — PROCEDURE TEST EXAMPLE OF TEST ARRANGEMENTS CORRESPONDING TO THE TYPE OF ADJUSTING DEVICE FIG. 10 TYPE 2 — PROCEDURE TEST FIG. 11 ABRASIONS AND MICRO SLIP TEST 5.4.4 Energy Absorptivity Test load. The work load area (ABC) enclosed by the curve AB at the time of the tension and the curve BC at the A tension load up to 11.1 kN shall be applied at an time of removal are to be measured. The work load approximate rate of 100 mm/min on the test piece by ratio representing the energy absorptivity is obtained the method specified in 5.4.1.2 and then decreased to from the following formula: the initial load of 200 N at the same rate. The load/ elongation diagram shall be drawn (see Fig. 12). Work load ratio = ABC/ABD × 100 percent 5.4.5 Width Under Load The work load per unit elongation is obtained by dividing the work load area (ABD) produced by the 5.4.5.1 The test shall be carried out each time on two tension load curve from the time of initial load to that new samples of strap, of sufficient length",
      "region": "India"
    },
    {
      "chunk_id": "8bf3fd6defec3a53dd8c7e506fe72f48a75245f2cf393f14ce13d2384169b4b4",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 39,
      "text": "Width Under Load The work load per unit elongation is obtained by dividing the work load area (ABD) produced by the 5.4.5.1 The test shall be carried out each time on two tension load curve from the time of initial load to that new samples of strap, of sufficient length conditioned of final load by the gauge length at the time of initial in conformity with the provisions of 5.4.2. FIG. 12 ENERGY ABSORPTIVITY GRAPH 5.4.5.2 The tests shall be conducted according supported by roller bearings. The load is applied to5.4.1.2. When the load reaches 9.8+1 kN, the centrally to the rollers by a suitable loading block at −0 machine shall be stopped and the measurement shall the rate of 100 mm/min. The belt assembly shall be fixed be completed within 5 s. The test has to be performed in the same way as it is in the vehicle using the same separately from the tensile test. fitments and bolts. 5.5.1.3 For seat belt equipped with non-locking 5.5 Tests on Seat Belt Assemblies retractor, the test shall be carried out with the fully 5.5.1 Static Strength/Displacement Test of Seat Belt extended condition of the webbing. For those equipped Assembly/Restraint Systems with automatic/emergency locking retractors, the test shall be made in the condition where the locking 5.5.1.1 The assembly shall be conditioned for room mechanism functions. conditions as per 5.4.2.2. 5.5.1.4 Two point type (see Fig. 13) 5.5.1.2 The test apparatus consists of two rollers of 100 mm dia, with its centre kept 300 mm apart and The test assembly shall be mounted on to the testing FIG. 13 STATIC STRENGTH/DISPLACEMENT OF SEAT BELT ASSEMBLY/RESTRAINT SYSTEM SETUP FOR TWO POINT TYPE apparatus with its loop length about 5.5.2.2 In the case of a safety belt or restraint system forming part of",
      "region": "India"
    },
    {
      "chunk_id": "fcaba202a52db19cc6fe3935ad7e9fe6697c1c2d5abbea3ce6f6c216e9bdacdf",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 40,
      "text": "centre kept 300 mm apart and The test assembly shall be mounted on to the testing FIG. 13 STATIC STRENGTH/DISPLACEMENT OF SEAT BELT ASSEMBLY/RESTRAINT SYSTEM SETUP FOR TWO POINT TYPE apparatus with its loop length about 5.5.2.2 In the case of a safety belt or restraint system forming part of an assembly for which approval is 1 300 mm. In case the length is less than 1 300 mm, the requested as a restraint system, the safety belt shall be test may be carried out with the longest possible length. mounted either as defined in 5.5.2.1 or on the part of A tension load from 200 N to 22.7 kN shall be applied the vehicle structure to which the restraint system is at the specified rate. The component and its parts shall normally fitted and this part shall be rigidly attached to be examined for any abnormalities and the vertical the trolley as given in 5.5.2.3 to 5.5.2.7. displacement of the rollers during the loading, that is, between 200 N and 22.7 kN. Alternatively, in the case where those devices cannot be tested on the test trolley, the manufacturer may 5.5.1.5 Three point type demonstrate by a conventional frontal impact test at 50 The test is carried out in the same way as the two point km/h in conformity with the procedure ISO 3560 that belt as per Fig. 14. the device complies with the requirements of the standard. 5.5.1.6 The buckle opening test shall be continued with a load of 665 ± 50 N on the assembly in accordance 5.5.2.3 The method used to secure the vehicle during with 5.5.3. the test shall not be such as to strengthen the anchorage of the seats or safety belts or to lessen the normal 5.5.2 Dynamic Test of Belt Assembly deformation",
      "region": "India"
    },
    {
      "chunk_id": "eb22161c4031d0b726f6e6debf6f425484e30847049ac2f51f469a07fe649aa0",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 41,
      "text": "of 665 ± 50 N on the assembly in accordance 5.5.2.3 The method used to secure the vehicle during with 5.5.3. the test shall not be such as to strengthen the anchorage of the seats or safety belts or to lessen the normal 5.5.2 Dynamic Test of Belt Assembly deformation of the structure. No forward movement of 5.5.2.1 The belt assembly shall be mounted on a trolley the vehicle shall be present which by limiting the forward equipped with the seat and the anchorages defined in movement of the manikin except the foot, would reduce Annex D (see Fig. 16). However, if the belt assembly is the load imposed on the restraint system during the test. intended for a specific vehicle or for specific types of The discarded part of the structure can be replaced by vehicle, the distances between the manikin and the parts of equivalent strength provided they do not hinder anchorages shall be determined, either in conformity the forward movement of the manikin. with the fitting instructions supplied with the belt or in 5.5.2.4 A securing device can be considered satisfactory, conformity with the data supplied by the manufacturer if it produces no effect on the area extending over the of the vehicle. In that case, when the dynamic test has entire width of the structure and if the vehicle or the been carried out for a type of vehicle, it need not be structure is blocked or fixed at a distance of not less repeated for other types of vehicles where each than 500 mm from the anchorage of the restraint system. anchorage point is less than 50 mm distant from the At the rear, the structure shall be secured at a sufficient corresponding anchorage point of the tested belt. distance behind the anchorage to ensure",
      "region": "India"
    },
    {
      "chunk_id": "d34990eb205383069d20a360c3a31043ee2a9200c33ec2dbad51602487a91aa5",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 42,
      "text": "other types of vehicles where each than 500 mm from the anchorage of the restraint system. anchorage point is less than 50 mm distant from the At the rear, the structure shall be secured at a sufficient corresponding anchorage point of the tested belt. distance behind the anchorage to ensure that the Alternatively, manufacturers may determine requirements of the 5.5.2.3 are complied. hypothetical anchorage positions for testing in order to enclose the maximum number of real anchorages points. 5.5.2.5 The seats shall be adjusted and placed in the If the belt is equipped with a belt adjustment device for position for driving use chosen by test agency for height, the position of the device and its means of adverse conditions with respect to strength, consistent securing shall be the same as those of the vehicle design. with the positioning of the manikin in the vehicle. The FIG. 14 STATIC STRENGTH/DISPLACEMENT OF SEAT BELT ASSEMBLY/RESTRAINT SYSTEM SETUP FOR THREE POINT TYPE positions of the seat shall be stated in the report. If the be total mass of the trolley, the vehicle seat back is adjustable, it shall be locked as specified structure and the inert masses differ from by the manufacturer or, in the absence of any the nominal value for calibration tests by specification, to an actual seat back angle as near as more than ± 40 kg. The stopping distance possible to 25° in the case of vehicles of categories M1 during calibration of the trolley shall be 400 and N1 and as near as possible to 15° in the case of ± 20 mm and the speed of the trolley shall vehicles of all other categories. be 50 ± 1 km/h. b) Acceleration Test Device 5.5.2.6 For the assessment of the requirements in4.4.2.10 (a), the seat shall be",
      "region": "India"
    },
    {
      "chunk_id": "f5f33c94b39a695af3f514469e990094ae33f85da633f91c84f491cae281313d",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 43,
      "text": "and N1 and as near as possible to 15° in the case of ± 20 mm and the speed of the trolley shall vehicles of all other categories. be 50 ± 1 km/h. b) Acceleration Test Device 5.5.2.6 For the assessment of the requirements in4.4.2.10 (a), the seat shall be regarded as being in 1) The trolley shall be so propelled that its its most forward driving or travelling position total velocity change ΔV is 51+2km/h. –0 appropriate to the dimensions of the manikin. The trolley shall remain horizontal during 5.5.2.7 All the seats of the same group shall be tested the acceleration. The acceleration of the simultaneously. trolley shall be achieved by using the apparatus complying with the 5.5.2.8 The seat belt assembly shall be attached to the performance hereafter specified. manikin as described in D-5 and Fig. 15. A board 25mm 2) The acceleration curve of the trolley, thick shall be placed between the back of the manikin weighted with inert mass, must remain and the seat back. The belt shall be fastened around within the hatched area in Fig. 19, and the manikin. The board shall then be removed so that stay above the segment defined by the the whole length of its back is in contact with the seat coordinates 10 g, 5 ms and 20 g, 10 ms. back. A check shall be made to ensure that the mode of The start of the impact (T0) is defined, engagement of the two parts of the buckle entails no according to ISO 17373 for a level of risk of reducing the reliability of locking. acceleration of 0.5 g. In no case shall the 5.5.2.9 The free ends of the straps shall extend beyond total mass of the trolley and vehicle the adjusting devices to allow for",
      "region": "India"
    },
    {
      "chunk_id": "6b60984d0e73ec93994ca4667596c913dd8384c2f2ac181efd85b930abc88724",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 44,
      "text": "buckle entails no according to ISO 17373 for a level of risk of reducing the reliability of locking. acceleration of 0.5 g. In no case shall the 5.5.2.9 The free ends of the straps shall extend beyond total mass of the trolley and vehicle the adjusting devices to allow for slip. structure and inert masses differ from the nominal value for calibration tests by 5.5.2.10 Acceleration and Deceleration Device more than ± 40 kg. During calibration of The applicant may choose to use any one of the 5511++22 the acceleration test device, trolley’s total ––00 following devices: velocity change ΔV shall be km/h. a) Deceleration Test Device 5.5.2.11 The trolley speed immediately before impact 1) The trolley shall be so propelled that at (only for deceleration trolleys, needed for stopping the moment of impact its free running distance calculation), the trolley acceleration or speed is 50 ± 1 km/h and the manikin deceleration, the forward displacement of the manikin remains stable. The stopping distance of and the speed of the chest at a 300 mm displacement of the trolley shall be 40 ± 5 cm. The trolley the chest shall be measured. shall remain horizontal throughout The velocity change will be calculated by integration deceleration. The deceleration of the of the recorded trolley acceleration or deceleration. trolley shall be achieved by using the apparatus described in Annex D or any The distance to achieve the first km/h of the other device giving equivalent results. velocity change of the trolley may be calculated by This apparatus shall comply with the double integration of the recorded trolley deceleration. performance here after specified. In all cases the calibration and measuring procedures 2) The deceleration curve of the trolley shall correspond to those defined in the International weighted with inert masses to produce a",
      "region": "India"
    },
    {
      "chunk_id": "b5bf66e7ccdc35e278a21e05796f09604358ed9a6b711705b095fa08b5a8aae2",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 45,
      "text": "be calculated by This apparatus shall comply with the double integration of the recorded trolley deceleration. performance here after specified. In all cases the calibration and measuring procedures 2) The deceleration curve of the trolley shall correspond to those defined in the International weighted with inert masses to produce a Standard ISO 6487, the measuring equipment shall total of 455 ± 20 kg for safety belt tests correspond to the specification of a data channel with and 910 ± 40 kg for restraint system tests, a channel frequency class (CFC) 60. where the nominal mass of the trolley and vehicle structure is 800 kg, must remain 5.5.2.12After impact, the belt assembly or restraint within the hatched area in Fig. 20. If system and its rigid parts shall be inspected visually, necessary, the nominal mass of the trolley without opening the buckle, to determine whether there and attached vehicle structure can be has been any failure or breakage. In the case of restraint increased by increments of 200 kg, in which systems, it shall also be ascertained, after the test, case an additional inert mass of 28 kg shall whether the parts of the vehicle structure which are be added per increment. In no case shall attached to the trolley have undergone any visible or permanent deformation. If there is any such deformation normal for opening the buckle. For lever type buckles found, this shall be taken into account in any calculation a hole of 2.5 mm dia may be drilled through the buckle made [see 4.4.2.10(a)]. tab or lever on a centre line between 3.0 and 3.3 mm from its edge and a small loop of soft wire may be used 5.5.2.13. The belt assembly shall be removed from the on the connecting link between the buckle tab or lever",
      "region": "India"
    },
    {
      "chunk_id": "ccbe678838a6a417a30da8017914012ff4e94f16e3e60df4405ac67254ddeaad",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 46,
      "text": "through the buckle made [see 4.4.2.10(a)]. tab or lever on a centre line between 3.0 and 3.3 mm from its edge and a small loop of soft wire may be used 5.5.2.13. The belt assembly shall be removed from the on the connecting link between the buckle tab or lever test trolley without the buckle being opened. The buckle and the force measuring device. The buckle opening opening test shall be carried out in accordance with 5.5.3. force shall be measured and any failure of the buckle 5.5.2.14 After the buckle opening test, the components noted. of the belt assembly or of the restraint device shall be inspected and the extent of the damage sustained by 5.6 Test Report the belt assembly or restraint device during the dynamic The test report shall record the results of all the tests test shall be recorded in the test report. given in 5 and in particular the trolley speed, the 5.5.2.15 However, if the tests were performed at a maximum forward displacement of the manikin, the higher speed and/or the acceleration curve have position of the buckle, the buckle opening force and exceeded the upper level of the hatched area and the any failure or breakage. If by virtue of 5.5.2.1, the safety belt meets the requirements, the test shall be anchorage prescribed in D-3 and Fig. 15 have not been considered satisfactory. respected, the test report shall describe how the belt assembly or the restraint system was installed and shall 5.5.3 Buckle Opening Test specify important angles and dimensions. The report 5.5.3.1 For this test, belt assemblies or restraint devices shall also mention any distortion or breakage of the which has already undergone the static strength/ buckle that has occurred during the test. In the case of displacement test in conformity with",
      "region": "India"
    },
    {
      "chunk_id": "95da57025e2e9ea83d4968ba779e76e3e52924dc37f028b21cfd5cc6dcd323d7",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 47,
      "text": "Opening Test specify important angles and dimensions. The report 5.5.3.1 For this test, belt assemblies or restraint devices shall also mention any distortion or breakage of the which has already undergone the static strength/ buckle that has occurred during the test. In the case of displacement test in conformity with 5.5.1 or dynamic a restraint system, the test report shall also specify the test in accordance with 5.5.2 shall be used. manner of attaching the vehicle structure to the trolley, 5.5.3.2 In case of samples subjected to static strength/ the position of the seats and the inclination of the seat displacement test, it is continued in accordance backs. If the forward displacement of the manikin has with5.5.1.6. exceeded the values prescribed in 4.4.2.9 (b), the report shall state whether the requirements in 4.4.2.10 (a) are 5.5.3.3 In case of samples subjected to dynamic test, met. a load shall be applied to the buckle by direct traction via the straps fixed to it so that all the straps are 6 SEAT BELT MARKING subjected to the force of (600/n )N, where ‘n’ is the number of straps linked to the buckle when it is in a 6.1 Each seat belt assembly shall be legibly and indelibly locked position and its minimum is deemed to be 2. In marked with the following: the case where the buckle is connected to a rigid part, a) Manufacturer’s name or trade-mark; the load shall be applied at the same angle as the one b) Means of identification; and formed by the buckle and the rigid end during the c) Means of Traceability dynamic test. 5.5.3.4 The buckle opening force shall be applied at a 6.2 BIS Certification Marking speed of 400 ± 20 mm/min to the geometric centre of The seat belt may also be",
      "region": "India"
    },
    {
      "chunk_id": "fb60ffe8e2755e8c3467a969a4505ec0b93d78b3db768576942b301711614190",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 48,
      "text": "of identification; and formed by the buckle and the rigid end during the c) Means of Traceability dynamic test. 5.5.3.4 The buckle opening force shall be applied at a 6.2 BIS Certification Marking speed of 400 ± 20 mm/min to the geometric centre of The seat belt may also be marked with the Standard the buckle release button along a fixed axis running Mark. parallel to the initial direction of motion of the button. During the application of the force needed to open the 6.2.1 The use of the Standard Mark is governed by the buckle, the buckle shall be held by a rigid support. The provisions of the Bureau of Indian Standards Act, 1986 point of contact of the test equipment shall be spherical and the Rules and Regulations made thereunder. The in shape of radius 2.5 ± 0.1 mm. It shall have a polished details of conditions under which the licence for the metal surface. For lift cover buckles, the buckle opening use of the Standard Mark may be granted to the force shall be applied by a spring balance or other manufacturers or producers may be obtained from the measuring device in a manner and direction which are Bureau of Indian Standards ANNEX A (Clause 4.1.1) INFORMATION TO BE PROVIDED BY THE SAFETY BELT/VEHICLE MANUFACTURER FOR APPROVAL OF SAFETY BELT/RESTRAINT SYSTEMS A-1 GENERAL a) State whether it is intended to be used with an airbag. a) Make (trade name of manufacturer); b) State whether the dynamic test needs to be b) Type and general commercial description(s); conducted in conjunction with air bag. If yes, c) Name and address of manufacturer; and mounting instructions and firing time of airbag d) Address(es) of assembly plant(s). to be provided. A-2 LIST OF VEHICLE(S) TO WHICH THE A-3.2 Restraint System DEVICE",
      "region": "India"
    },
    {
      "chunk_id": "bdb8104b3c773d6460cd7ea3bf42d3d50f437eaa5451b835ffa0fa22677feca2",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 49,
      "text": "needs to be b) Type and general commercial description(s); conducted in conjunction with air bag. If yes, c) Name and address of manufacturer; and mounting instructions and firing time of airbag d) Address(es) of assembly plant(s). to be provided. A-2 LIST OF VEHICLE(S) TO WHICH THE A-3.2 Restraint System DEVICE IS INTENDED TO BE FITTED (IF A-3.2.1 Drawings of the relevant parts of the vehicle APPLICABLE) structure and any seat anchorage reinforcements. A-3 DESCRIPTION OF THE DEVICE A-3.2.2 Drawings of the seat, showing its structure, A-3.1 Safety Belt adjustment system and fixing components, with an indication of the materials used. A-3.1.1 Configuration of safety belt (two point belt, three point belt, static, automatic). A-3.2.3 Drawing or photograph of the restraint system A-3.1.2 Details of webbing (material, weave, as installed. dimensions and colour). A-4 DESCRIPTION OF THE VEHICLE A-3.1.3 Type of retractor and classify further in the Photographs and/or drawings of a representative vehicle. case of emergency locking retractor — simple locking type, or webbing clamp type (see 3.7). A-5 BODY WORK A-3.1.4 Information on additional functions, if applicable. A-5.1 Seats A-3.1.5 Drawings of the rigid parts. A-5.1.1 Number A-3.1.6 Type of buckle (see 3.3). A-5.1.2 Position and Arrangement A-3.1.7 Diagram of the safety belt assembly enabling A-5.1.3 Characteristics identification and location of the rigid parts. For seats non-type-approved as components, A-3.1.8 Mounting instructions showing, interalia, the description and drawings of. installation of the retractor and its sensing device. a) the seats and their anchorages; A-3.1.9 If a belt adjustment device for height is present, b) the adjustment system; state whether it is considered to be part of the belt. c) the displacement and locking systems; and A-3.1.10 In the case of a pre-loading device or system, a d) the seat belt anchorages if incorporated in the full technical description of",
      "region": "India"
    },
    {
      "chunk_id": "065c06a25562204f4b59cbde0b9132563c918bf10bb8b52bc474351ffb64c57c",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 50,
      "text": "for height is present, b) the adjustment system; state whether it is considered to be part of the belt. c) the displacement and locking systems; and A-3.1.10 In the case of a pre-loading device or system, a d) the seat belt anchorages if incorporated in the full technical description of the construction and function seat structure. including any sensing device, describing the method of activation and any necessary method to avoid inadvertent A-5.2 Safety Belts and/or Other Restraint Systems activation. Pre-loading device firing time shall be specified. Number and position of safety belts and restraint systems A-3.1.11 For the belts intended for use in front outboard and seats on which they can be used ( see Table 6 ). seating position: Table 6 Number and Position of Safety Belts and Restraint System and Seat ( Clause A-5.2 ) Sl Row of Seat Location1) Type of Seat Variant Belt Adjustment Device for Height No. Belt (if Applicable) (Indicate Yes/No/Optional) (1) (2) ( 3) (4) (5) (6) i) First row of seats L C R ii) Second row of seats2) L C R 1) L = left-hand side, R = right-hand side, C = centre). 2) The table may be extended as necessary for vehicles with more than two rows of seats or if there are more than three seats across the width of the vehicle. ANNEX B (Clause 5.1.1) TEST CHAMBER FOR CORROSION TEST B-1 TEST APPARATUS B-3 SALT SOLUTION B-1.1 The apparatus shall consist of a mist chamber, a B-3.1 The salt solution shall be prepared by dissolving salt solution reservoir, supply of suitable conditioned 5 ± 1 parts by mass of sodium chloride in 95 parts of compressed air, one or more atomizing nozzles, samples distilled water. The salt shall be sodium chloride support, provision of heating the chamber",
      "region": "India"
    },
    {
      "chunk_id": "c6b774ab112c0e18e3814c6b9078637ad673478dbc780adf205726d557e062ad",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 51,
      "text": "The salt solution shall be prepared by dissolving salt solution reservoir, supply of suitable conditioned 5 ± 1 parts by mass of sodium chloride in 95 parts of compressed air, one or more atomizing nozzles, samples distilled water. The salt shall be sodium chloride support, provision of heating the chamber and necessary substantially free of nickel and copper and containing means of control. The size and detailed construction of on the dry basis not more than 0.1 percent of sodium the apparatus shall be optional provided that the test iodide and not more than 0.3 percent of the total conditions are met. impurities. B-1.2 It is important to ensure that drops of solution B-3.2 The solution shall be such that when atomized at accumulated on the ceiling or cover of the chamber do 35°C the collected solution is in the pH range of 6.5 to not fall on test samples. 7.2. B-1.3 Drops of solution which fall from test samples B-4 AIR SUPPLY shall not return to the reservoir for re-spraying. B-1.4 The apparatus shall not be constructed of The compressed air supply to the nozzle for atomizing materials that will affect the corrosiveness of the mist. the salt solution shall be free of oil and dirt and maintained at a pressure between 70 kPa and 180 kPa. B-2 LOCATION OF TEST SAMPLES IN THE MIST CABINET B-5 CONDITIONS IN THE MIST CHAMBER B-2.1 Samples except retractors, shall be supported or B-5.1 The exposure zone of the mist chamber shall be suspended between 15° and 30° from the vertical and maintained at 35 ± 5°C. Two clean mist collectors shall preferably parallel to the principal direction of horizontal be placed within the exposure zone to prevent drops of flow of mist through the chamber, based upon the solution from the",
      "region": "India"
    },
    {
      "chunk_id": "a98832ef12d19d48dab45a33ab8602e45be0759c94dec0d434bb73c4db7679e6",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 52,
      "text": "be suspended between 15° and 30° from the vertical and maintained at 35 ± 5°C. Two clean mist collectors shall preferably parallel to the principal direction of horizontal be placed within the exposure zone to prevent drops of flow of mist through the chamber, based upon the solution from the test samples or any other source from dominant surface being tested. accumulating. The collectors shall be placed near the B-2.2 Retractors shall be supported or suspended so test samples, one as near as possible to the nozzles and that the axes of the reel for storing the strap shall be the other as far away as possible from the nozzles. The normal to the principle direction of horizontal flow of mist shall be such that, for each 80 cm2 of horizontal mist through the chamber. The strap opening in the collecting area, an average of between 1.0 and 2.0 ml retractor shall also be facing in this principle direction. of solution per hour is collected in each collector when measured over at least 16 h. B-2.3 Each sample shall be placed so as to permit free setting of mist on all samples. B-5.2 The nozzle or nozzles shall be directed or baffled in such a manner that the spray does not strike directly B-2.4 Each sample shall be so placed to prevent salt onto the test samples. solution from one sample dripping on to any other samples. ANNEX C (Clause 5.3.2.4) TYPICAL APPARATUS TO TEST LOCKING OF EMERGENCY LOCKING RETRACTORS C-1 A suitable apparatus is illustrated in Fig. 15 and consist C-2 On the trolley a carrier is mounted which can be of a motor-driven cam, the follower of which is attached swivelled to enable the retractor to be mounted in by wires to a small trolley mounted on a",
      "region": "India"
    },
    {
      "chunk_id": "f2d135adc7731f0005396b89ae62f49912d25ee8d3fc0374f06794109b7e0d82",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 53,
      "text": "C-1 A suitable apparatus is illustrated in Fig. 15 and consist C-2 On the trolley a carrier is mounted which can be of a motor-driven cam, the follower of which is attached swivelled to enable the retractor to be mounted in by wires to a small trolley mounted on a track. The cam varying positions relative to the direction of movement follower incorporates a ‘lost-motion’ device which absorbs of the trolley. any movement should be reel lock before the full stroke C-3 When testing retractors for sensitivity to strap of the follower is completed. The cam design and motor movement, the retractor is mounted on a suitable fixed speed combination is such as to give the required bracket and the strap is attached to the trolley. acceleration at a rate of increase of acceleration as specified in 5.3.2.4 and the stroke is arranged to be in excess of C-4 When carrying out the above tests, any brackets, maximum permitted strap movement before locking. supplied by the manufacturer or his representative shall be incorporated in the test installation to simulate as closely as possible the intended installation in a vehicle. C-5 Any additional brackets, that may be required to simulate the installation as intended in a vehicle shall be provided by the manufacturer or his representative. FIG. 15 RETRACTOR ANNEX D (Clauses 5.5.2.1 and 5.6) DESCRIPTION OF TROLLEY, SEAT, ANCHORAGES, STOPPING DEVICE AND MANIKIN FOR DYNAMIC TEST D-1 TROLLEY systems. The particulars given in Fig. 1 shall be followed, care being taken that no metal part can come For tests on safety belts the trolley carrying the seat only, into contact with the belt. shall have a mass of 400 ± 20 kg. For tests on restraint systems the trolley, with the vehicle structure attached, D-3 ANCHORAGES shall have a mass",
      "region": "India"
    },
    {
      "chunk_id": "9f4453d815e0472d564ae3d152c64db564a5cf3433e36e647f4065cf48ca0fc0",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 54,
      "text": "taken that no metal part can come For tests on safety belts the trolley carrying the seat only, into contact with the belt. shall have a mass of 400 ± 20 kg. For tests on restraint systems the trolley, with the vehicle structure attached, D-3 ANCHORAGES shall have a mass of 800 kg. However, if necessary, the total mass of the trolley and vehicle structure may be D-3.1 The anchorages shall be positioned as shown in increased by increments of 200 kg and shall not differ Fig. 16. The circular marks, which correspond to the from the nominal value by more than ± 40 kg. arrangement of the anchorages, show where the ends of the belt are to be connected to the trolley or to the load D-2 SEAT transducer, as the case may be. The anchorages for normal use are the points A, B and K, if the strap length between The seat shall be of rigid construction and present a the upper edge of the buckle and hole for the attachment smooth surface, except in the case of tests on restraint of the strap support is not more than 250 mm. Otherwise, normally mounted which shall be securely fixed on the the points A and B shall be used. The structure carrying test trolley. 1 1 the anchorages shall be rigid. The upper anchorage must not be displaced by more than 0.2 mm in the longitudinal D-4 STOPPING DEVICE direction when a load of 1 kN is applied to it in that D-4.1 This device consists of two identical absorbers direction. The trolley shall be so constructed that no mounted in parallel, except in the case of restraint permanent deformation shall occur in the parts bearing systems when four absorbers shall be used for a nominal the anchorages",
      "region": "India"
    },
    {
      "chunk_id": "a5f0ce96bab8e025dd534b85daf0c1f486ca4493d34a2b2b9abf68a7726bba75",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 55,
      "text": "to it in that D-4.1 This device consists of two identical absorbers direction. The trolley shall be so constructed that no mounted in parallel, except in the case of restraint permanent deformation shall occur in the parts bearing systems when four absorbers shall be used for a nominal the anchorages during the test. mass of 800 kg. If necessary, an additional absorber D-3.2 The tolerance on the position of the anchorage shall be used for each 200 kg increase of nominal mass. points is such that each anchorage point shall be situated D-4.2 Each absorber comprises, at the most at 50 mm from corresponding points A, B a) an outer casing formed from a steel tube, and K indicated in Fig. 15, or A , B , and K , as the 1 1 1 b) a polyurethane energy-absorber tube, case may be. c) a polished-steel olive-shaped knob penetrating D-3.3 If a fourth anchorage is necessary in order to into the absorber, and attach the retractor, this anchorage, d) a shaft and an impact plate. a) shall be located in the vertical longitudinal D-4.3 The dimensions of the various parts of this energy plane passing through K 1; absorber are shown in Figs. 17, 18 and 19. The b) shall enable the retractor to be tilted to the characteristic values of the energy-absorbing material angle prescribed by the manufacturer; and are given below. Immediately before each test, the tubes c) shall be located on the arc of a circle with must be conditioned at a temperature between 15 and centre K; and with radius KB = 790 mm, if 25°C for minimum 12 h without being used. The the length between the upper strap guide and temperature of the stopping device during the dynamic the strap outlet at the retractor",
      "region": "India"
    },
    {
      "chunk_id": "3754ee0d35d6f04dd8d7759b3254bb5982456f099ef8f5186779785560e5be73",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 56,
      "text": "must be conditioned at a temperature between 15 and centre K; and with radius KB = 790 mm, if 25°C for minimum 12 h without being used. The the length between the upper strap guide and temperature of the stopping device during the dynamic the strap outlet at the retractor is not less than testing of safety belts and restraint systems must be the 540 mm. In all other cases, the fourth same as during the calibration test to within ± 2°C. encourage shall be on the arc of a circle with D-4.4 Characteristic Values of the Energy- centre K and radius 350 mm. Absorbing Material (ASTM Method D 2000 and D-3.4 In the case of a belt equipped with a belt Unless Otherwise Stated) adjustment device for height, this shall be secured either D-4.4.1 Shore Hardness A: 95 ± 2 at 20 ± 5°C to a rigid frame or to a part of the vehicle on which it is All dimensions in millimetres. FIG. 16 TROLLEY, SEAT, ANCHORAGE All dimensions in millimetres. FIG. 17 STOPPING DEVICE ≥≥≥≤ All dimensions in millimetres. FIG. 18 STOPPING DEVICE (POLYURETHANE TUBE) All dimensions in millimetres. FIG. 19 STOPPING DEVICE (OLIVE-SHAPED KNOB) D-4.4.2 Breaking Strength: Ro ≥ 343 daN/cm2 D-4.4.5 Low-Temperature Brittleness D-4.4.3 Minimum Elongation: Ao 400 percent [IS 3400 (Part 18)]: 5 h at –55°C D-4.4.4 Modulus D-4.4.6 Compression set: 22 h at 70°C a) At 100 percent elongation: 108 daN/cm2 (Method B) 45 percent b) At 300 percent elongation: 235 daN/cm2 D-4.4.7 Density at 25°C: 1.05–1.10 D-4.4.8 Ageing in air [(IS 3400 (Part 4)/IS 3400 D-4.4.10.3 Immersion in distilled water: One week at 70°C (Part 9)] a) Breaking Strength: decrease < 35 percent of D-4.4.9 70 h at 100°C: Ro b) Elongation: decrease < 20 percent of Ao a) Shore Hardness A",
      "region": "India"
    },
    {
      "chunk_id": "c6767e79f28e6b44a0539e8755234eeb9367fad049d6557d1605ad3b5bdd6c9d",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 57,
      "text": "Density at 25°C: 1.05–1.10 D-4.4.8 Ageing in air [(IS 3400 (Part 4)/IS 3400 D-4.4.10.3 Immersion in distilled water: One week at 70°C (Part 9)] a) Breaking Strength: decrease < 35 percent of D-4.4.9 70 h at 100°C: Ro b) Elongation: decrease < 20 percent of Ao a) Shore Hardness A : maximum variation ±3 D-4.5 The requirements relating to the stopping device b) Breaking Strength: decrease < 10 percent of are given in 4.6 below. Any other device giving Ro equivalent results is acceptable. c) Elongation: decrease < 10 percent of Ao d) Mass: decrease < 1 percent D-5 MANIKIN D-4.4.10 Immersion in Fluids D-5.1 Specifications of the Manikin D-4.4.10.1 Immersion in oil (ASTM Method No. 1 oil): D-5.1.1 General 70 h at 100°C The main characteristics of the manikin are indicated in a) Shore Hardness A : maximum variation ±4 the following figures and tables: b) Breaking Strength: decrease < 15 percent of a) Fig. 21 Side view of head, neck and torso; Ro Fig. 22 Front view of head, neck and torso; c) Elongation: decrease < 10 percent of Ao Fig. 23 Side view of hip, thighs and lower leg; d) Volume: swelling < 5 percent Fig. 24 Front view of hip, thighs and lower D-4.4.10.2 Immersion in oil (ASTM Method No. 3 oil): leg; Fig. 25 Principal dimensions; Fig. 26 70 h at 100°C: Manikin in sitting position, showing: a) Breaking Strength: decrease < 15 percent of 1) Location of the centre of gravity; Ro 2) Location of points at which displacement b) Elongation: decrease < 15 percent of Ao shall be measured; and c) Volume:swelling < 20 percent 3) Shoulder height; NOTE — The line in shade area applies only for acceleration test devices FIG. 20 DESCRIPTION OF THE CURVE OF TROLLEY DECELERATION OR ACCELERATION AS",
      "region": "India"
    },
    {
      "chunk_id": "1db159107cfa4d19b351cb07d062f45ad9a8904d79ebfee2681dee93c2e6d518",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 58,
      "text": "of points at which displacement b) Elongation: decrease < 15 percent of Ao shall be measured; and c) Volume:swelling < 20 percent 3) Shoulder height; NOTE — The line in shade area applies only for acceleration test devices FIG. 20 DESCRIPTION OF THE CURVE OF TROLLEY DECELERATION OR ACCELERATION AS FUNCTION OF TIME FIG. 21 MANIKIN — SIDE VIEW OF HEAD,NECK AND TORSO b) Table 7 Mass of head, neck, torso, thigh and a) A hip tube (2), lower leg; and b) A roller chain (4), c) Table 8 References, names, materials and c) Ribs (6) and (7), principal dimensions of the components of the d) A sternum(8), and manikin. e) Chain attachments (3 and, partly, 7 and 8). D-5.1.2 Description of the Manikin D-5.1.2.4 Neck (see Fig. 21 and 22) D-5.1.2.1 Lower leg structure (see Figs. 23 and 24) The neck consists of seven polyurethane discs (9). The The lower leg structure consists of three components: degree of stiffness of the neck can be adjusted by means of a chain tensioner. a) A sole plate (30), b) A shin tube (29), and D-5.1.2.5 Head (see Fig. 21 and 22) c) A knee tube (26). The head (15) is hollow; the polyurethane is reinforced by steel bands (17). The chain tensioner which enables The knee tube has two lugs, which limit the movement of the neck to be adjusted consists of a polyamide block the lower leg in relation to the thigh. The lower leg can (10), a tubular spacer (11) and a tensioning component rotate rearwards about 120° from the straight position. (12 and 13). The head can rotate at the joint between D-5.1.2.2 Thigh structure (see Figs. 23 and 24) the first and second cervical vertebrate (the atlas-axis joint), which consists of an adjuster assembly (14 and The",
      "region": "India"
    },
    {
      "chunk_id": "27cbe09ddc5005968118e1e3cbcf9ecbd4bf3e5714640b86c3d11795e591bf1b",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 59,
      "text": "(11) and a tensioning component rotate rearwards about 120° from the straight position. (12 and 13). The head can rotate at the joint between D-5.1.2.2 Thigh structure (see Figs. 23 and 24) the first and second cervical vertebrate (the atlas-axis joint), which consists of an adjuster assembly (14 and The thigh structure consists of three components: 18), a spacer (16) and a polyamide block (10). a) A knee tube (22), D-5.1.2.6 Knee joint (see Fig. 24) b) A thigh bar (21), and c) A hip tube (20). The lower leg and thighs are connected by a tube (27) and a pensioner (28). Movement of the knee is limited by two cut-outs in the knee tube (22), which engage with the lugs of the leg. D-5.1.2.7 Hip joint (see Fig. 24) D-5.1.2.3 Torso structure (see Figs. 21 and 22) The thighs and torso are connected by a tube (23), friction plates (24) and a tensioner (25). The torso structure consists of the following components: D-5.1.2.8 Polyurethane FIG. 22 MANIKIN — FRONT VIEW OF HEAD,NECK AND TORSO FIG. 23 MANIKIN — SIDE VIEW OF FIG. 24 MANIKIN — FRONT VIEW OF HIP,THIGHS AND LOWER LEG HIP,THIGHS AND LOWER LEG All dimensions in millimetres. FIG. 25 MANIKIN — FRONT VIEW OF HEAD,NECK AND TORSO Manikin seated in a position shown in Fig. 15. G = centre of gravity T = torso measurement point (located at the centre line of the manikin) P = pelvis measurement point (located at the back on the centre of line of the manikin) The displacement measurement at point P shall not contain rotational components around the hip axis and around a vertical axis. All dimensions in millimetres. FIG. 26 MANIKIN IN SEATED POSITION a) Type: PU 123 CH compound D-5.4.3 Hip Joints b) Hardness: 50 to 60 shore",
      "region": "India"
    },
    {
      "chunk_id": "9a6aca97804087b18216e52f10018c87ddd64d65097d1f460e7d205e713d3570",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 60,
      "text": "of line of the manikin) The displacement measurement at point P shall not contain rotational components around the hip axis and around a vertical axis. All dimensions in millimetres. FIG. 26 MANIKIN IN SEATED POSITION a) Type: PU 123 CH compound D-5.4.3 Hip Joints b) Hardness: 50 to 60 shore A a) Increase the rigidity of the hip joints for the D-5.1.2.9 Overall purpose of adjustment; b) Place the thighs in horizontal position and the The manikin is covered by a special overall. torso in a vertical position; D-5.2 Correction of the Mass c) Rotate the torso towards until it forms an angle In order to calibrate the manikin to certain values and its of 60° with the thighs; total mass, the mass distribution must be adjusted by d) Gradually slacken the tensioner until the torso means of six correction weights of 1 kg each which can starts to fall under its own weight; and be fitted to the hip joint. Six other polyurethane weights e) Lock the tensioner in this position. of 1 kg each can be fitted to the back of the torso. D-5.4.4 Atlas-Axis Joint D-5.3 Cushion a) Adjust the atlas-axis joint so that it just resists A cushion shall be positioned between the chest of the its own weight; and manikin and the overall. This cushion must be made of b) Lock the tensioner in this position. polyurethane foam complying with the following specification: D-5.4.5 Neck a) Hardness : 7 to 10 shore A a) The neck can be adjusted by means of the chain b) Thickness : 25 ± 5 mm tensioner (13); and b) When the neck is adjusted, the upper end of It may be replaceable. the tensioner shall be displaced between 40 D-5.4 Adjustment of the Joints and 60 mm when subjected",
      "region": "India"
    },
    {
      "chunk_id": "89cb6baa2cad6b00b994248d340228874cb6e09b72cef62acd96e922a3f57a36",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 61,
      "text": "neck can be adjusted by means of the chain b) Thickness : 25 ± 5 mm tensioner (13); and b) When the neck is adjusted, the upper end of It may be replaceable. the tensioner shall be displaced between 40 D-5.4 Adjustment of the Joints and 60 mm when subjected to horizontal load D-5.4.1 General of 100 N. In order to achieve reproducible results, it is necessary Table 7 Mass of Head, Neck, Torso, Thigh and to specify and control the friction at each joint. Lower Leg (Clause D-5.1.1) D-5.4.2 Knee Joint Sl Components of Manikin Mass a) Tighten the knee joint; No. (kg) b) Set the thigh and lower leg vertical; (1) (2) (3) c) Rotate the lower leg through 30°; i) Head and neck 4.6 ± 0.3 ii) Torso and arms 40.3 ± 1.0 d) Gradually slacken the tensioner until the lower iii) Thighs 16.2 ± 0.5 leg starts to fall under its own weight; and iv) Lower leg and foot 9.0 ± 0.5 e) Lock the tensioner in this position. Total mass including correction weights 75.5 ± 1.0 Table 8 References, Names, Materials and Principal Dimensions of the Components of the Manikin (Clause D-5.1.1) Reference Names Materials Dimensions Number mm (1) (2) (3) (4) 1 Body Material polyurethane — 2 Hip tub steel 76 × 70 × 100 3 Chain-attachments steel 25 × 10 × 70 4 Roller chain steel 0.75 5 Shoulder plate polyurethane — 6 Rolled section steel 30 × 30 × 3 × 250 7 Ribs perforated steelplate 400 × 85 × 1.5 8 Sternum perforated steelplate 250 × 90 × 1.5 9 Discs (six) polyurethane 90 dia × 20 80 dia × 20 75 dia × 20 70 dia × 20 65 dia × 20 60 dia × 20 10 Block polyamide 60",
      "region": "India"
    },
    {
      "chunk_id": "c6612c642a2b765de05c009a24de4b868ab052427a7fe0a8d45c5521668e5a77",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 62,
      "text": "7 Ribs perforated steelplate 400 × 85 × 1.5 8 Sternum perforated steelplate 250 × 90 × 1.5 9 Discs (six) polyurethane 90 dia × 20 80 dia × 20 75 dia × 20 70 dia × 20 65 dia × 20 60 dia × 20 10 Block polyamide 60 × 60 × 25 11 Tubular spacer steel 40 × 40 × 2 × 50 12 Tensioning bolt steel M16 × 90 13 Tensioner nut steel M16 14 Tensioner for atlas axis joint steel 12 dia × 130 15 Head polyurethane — 16 Tubular spacer steel 18 dia × 13 × 17 17 Reinforced plate steel 30 × 3 × 500 18 Tensioner nut steel M12 19 Thighs polyurethane — 20 Hip tube steel 76 × 70 × 80 21 Thigh bar steel 30 × 30 × 440 22 Knee tube steel 52 × 46 × 40 23 Hip connection tube steel 70 × 64 × 250 24 Friction plates (four) steel 160 × 75 × 1 25 Tensioner assembly steel M12 × 320 Plates and nuts 26 Knee tube steel 52 × 46 × 160 27 Knee connection tube steel 44 × 39 × 190 28 Tensioner plate steel 70 dia × 4 29 Shin tube steel 50 × 50 × 2 × 460 30 Sole plate steel 100 × 170 × 3 31 Torso correction mass (six) polyurethane Each mass 1 kg 32 Cushion polystyrene foam 350 × 250 × 25 33 Overall cotton and polyamide straps — 34 Hip correction masses (six) steel Each mass 1 kg Bureau of Indian Standards BIS is a statutory institution established under the Bureau of Indian Standards Act, 1986 to promote harmonious development of the activities of standardization, marking and quality certification of goods and attending to connected matters in the",
      "region": "India"
    },
    {
      "chunk_id": "472e68099c1715746a237fc7948d66b8aa65109822e6a5f10a40897894b2a09b",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 63,
      "text": "34 Hip correction masses (six) steel Each mass 1 kg Bureau of Indian Standards BIS is a statutory institution established under the Bureau of Indian Standards Act, 1986 to promote harmonious development of the activities of standardization, marking and quality certification of goods and attending to connected matters in the country. Copyright BIS has the copyright of all its publications. No part of these publications may be reproduced in any form without the prior permission in writing of BIS. This does not preclude the free use, in the course of implementing the standard, of necessary details, such as symbols and sizes, type or grade designations. Enquiries relating to copyright be addressed to the Director (Publications), BIS. Review of Indian Standards Amendments are issued to standards as the need arises on the basis of comments. Standards are also reviewed periodically; a standard along with amendments is reaffirmed when such review indicates that no changes are needed; if the review indicates that changes are needed, it is taken up for revision. Users of Indian Standards should ascertain that they are in possession of the latest amendments or edition by referring to the latest issue of ‘BIS Catalogue’ and ‘Standards: Monthly Additions’. This Indian Standard has been developed from Doc No.: TED 29 (1061). Amendments Issued Since Publication Amend No. Date of Issue Text Affected BUREAU OF INDIAN STANDARDS Headquarters: Manak Bhavan, 9 Bahadur Shah Zafar Marg, New Delhi 110002 Telephones : 23230131, 23233375, 23239402 Website: www.bis.org.in Regional Offices: Telephones Central : Manak Bhavan, 9 Bahadur Shah Zafar Marg {2323 7617 NEW DELHI 110002 2323 3841 Eastern : 1/14 C.I.T. Scheme VII M, V. I. P. Road, Kankurgachi {2337 8499, 2337 8561 KOLKATA 700054 2337 8626, 2337 9120 Northern : Plot No. 4-A, Sector 27-B, Madhya Marg, CHANDIGARH 160019 {2650206 Southern : C.I.T.",
      "region": "India"
    },
    {
      "chunk_id": "a01d17140fdbabfe9b9aa35f0e389f4843c0120ca63c2a6d53db4519598b1bd1",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 64,
      "text": "Bhavan, 9 Bahadur Shah Zafar Marg {2323 7617 NEW DELHI 110002 2323 3841 Eastern : 1/14 C.I.T. Scheme VII M, V. I. P. Road, Kankurgachi {2337 8499, 2337 8561 KOLKATA 700054 2337 8626, 2337 9120 Northern : Plot No. 4-A, Sector 27-B, Madhya Marg, CHANDIGARH 160019 {2650206 Southern : C.I.T. Campus, IV Cross Road, CHENNAI 600113 {2254 1216, 2254 1442 2254 2519, 2254 2315 Western : Manakalaya, E9 MIDC, Marol, Andheri (East) {2832 9295, 2832 7858 MUMBAI 400093 2832 7891, 2832 7892 Branches: AHMEDABAD. BENGALURU. BHOPAL. BHUBANESHWAR. COIMBATORE. DEHRADUN. DURGAPUR. FARIDABAD. GHAZIABAD. GUWAHATI. HYDERABAD. JAIPUR. JAMMU. JAMSHEDPUR. KOCHI. LUCKNOW. NAGPUR. PARWANOO. PATNA. PUNE. RAIPUR. RAJKOT. VISAKHAPATNAM. Published by BIS, New Delhi AMENDMENT NO. 1 FEbruAry 2022 TO IS 15140 : 2018 AuTOMOTIVE VEHICLES — SAFETy bELT AND rESTrAINT SySTEMS — SPECIFICATION ( First Revision ) (Page 7, clause 4.2.5.3, line 6) — Substitute ‘3 g’ for ‘2 g’. (Page 9, clause 4.4.2.9(b), line 11) — Substitute ‘Fig. 26’ for ‘Fig. 25’. (Page 20, clause 5.5.2.8, line 2) — Substitute ‘Fig. 16’ for ‘Fig. 15’. (Page 20, clause 5.5.2.10(b)(2), line 3) — Substitute ‘Fig. 20’ for ‘Fig. 19’. (Page 20, clause 5.5.2.10(b)(2), line-13) — Substitute ‘total velocity change ΔV shall be 51 ± 2km/h.’ for ‘total velocity change ΔV shall be km/h’. (Page 20, clause 5.5.2.10(b)(2), line-13) — Delete ‘51 +2’ -0 (Page 20, clause 5.5.2.11, line-9) — Substitute ‘The distance to achieve the first 50 +1 km/h’ for ‘The distance to achieve the first km/h’. -0 (Page 21, clause 5.6, line 6) — Substitute ‘Fig. 16’ for ‘Fig. 15’. (Page 25, Annex-D, clause D-3.2, line-4) — Substitute ‘Fig. 16’ for ‘Fig. 15’. (Page 26, Annex-D, clause D-4.4.3) — Substitute ‘Minimum Elongation: Ao ≥ 400 percent’ for ‘Minimum Elongation: Ao 400 percent. (Page 26, Annex D, clause D-4.4.4) — Substitute the",
      "region": "India"
    },
    {
      "chunk_id": "361a08003b23a6c853d56a4baf524aa0a21e1c4e96e6fb9ad99a858177f1f878",
      "pdf_file": "IS15140_2018.pdf",
      "chunk_index": 65,
      "text": "line 6) — Substitute ‘Fig. 16’ for ‘Fig. 15’. (Page 25, Annex-D, clause D-3.2, line-4) — Substitute ‘Fig. 16’ for ‘Fig. 15’. (Page 26, Annex-D, clause D-4.4.3) — Substitute ‘Minimum Elongation: Ao ≥ 400 percent’ for ‘Minimum Elongation: Ao 400 percent. (Page 26, Annex D, clause D-4.4.4) — Substitute the following for the existing: ‘D-4.4.4 Modulus a) At 100 percent elongation ≥ 108 daN/cm2 b) At 300 percent elongation ≥ 235 daN/cm2’ (Page 26, Annex D, clause D-4.4.6) — Substitute ‘Compression set (Method B): 22 h at 70°C ≤ 45 percent’ for ‘Compression set: 22 h at 70°C (Method B) 45 percent’. (Page 27, Annex D, clause D-5.1.1(a), line-5) — Substitute ‘Manikin seated in a position shown in Fig. 16’ for ‘Fig. 26 Manikin in sitting position, showing’. (Page 27, Annex D, clause D-4.5, line 2) — Substitute ‘D-4 above’ for ‘4.6 below’. (Page 28, Annex D, clause D-5.1.2.6, line 2) — Substitute ‘tensioner’ for ‘pensioner’. (Page 31, Annex D, clause D-5.4.2(d), line 1) — Substitute ‘tensioner (28)’ for ‘tensioner’. (TED 29) Publication Unit, BIS, New Delhi, India",
      "region": "India"
    }
  ],
  "diagnostics": {
    "header_footer_removed": {
      "headers": [
        "IS 15140 : 2018"
      ],
      "footers": []
    },
    "page_number_lines_removed": 37
  },
  "region": "India"
}